[
  {
    "qid": "108325fa-819d-4c8a-b983-2002b1195810",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Habitat)<-[r0:inhabits]-(m0:Taxon {name: 'Silver-tipped Imperial Pigeon'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the habitats where the Silver-tipped Imperial Pigeon lives?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "641217e8-ca85-486c-a1f1-b3b37a45fbce",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Pro Patria'}) WITH DISTINCT n RETURN n.name, n.date_of_birth",
    "nl_question": "Who are the individuals who created the sculpture Pro Patria, and what are their dates of birth?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "6acbaedb-5d34-4ffc-84ee-0894dc99bb4f",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'Coccoidea'}),(n:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Chalcidoidea'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa that feed on Coccoidea and have Chalcidoidea as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "1bb93006-ac23-4573-a4ed-741d46ede4d8",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Critically Endangered'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans of taxa that are preyed upon by species with a conservation status of Critically Endangered?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "38fd9cd0-9962-4ad6-bab6-9eeaa802e49c",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Weapon)<-[r0:employs]-(m0:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'mortar'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of weapons used in terrorist attacks that also involve mortars?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "91da96d3-1b1f-4913-9110-bd483a6d247a",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'FK Rudar Pljevlja'}) WITH DISTINCT n RETURN n.name, n.footedness",
    "nl_question": "What are the names and footedness of players who have played for FK Rudar Pljevlja at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "78b082aa-9f0c-40ad-89b9-b8e28ffc3c6a",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Neoseiulus'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans in years of taxa that are preyed upon by a taxon whose parent is Neoseiulus?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "243c49e1-767f-4351-8c6f-7d7188fef7c7",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'automatic rifle'}) WITH DISTINCT n RETURN n.name, n.number_of_deaths",
    "nl_question": "What are the names and death tolls of terrorist attacks that used an automatic rifle?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "a9a356c5-ee8f-4fb2-bbc7-bdfeced3f583",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Inter Milan'}) WHERE r0.start_year IS NOT NULL AND r0.end_year IS NULL WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the players currently playing for Inter Milan?",
    "from_template": {
      "match_category": "special_time-sensitive",
      "match_cypher": "MATCH (n)-[r0<start_year,end_year^>]->(m0<name>) WHERE r0.start_year IS NOT NULL AND r0.end_year IS NULL",
      "return_pattern_id": "n_name_special",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "cbb9117f-33f8-45f4-b20f-bf1a27a14029",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: 'Championnat National'}) WITH DISTINCT n RETURN n.name, n.head_coach",
    "nl_question": "What are the names of clubs that are part of the Championnat National league, along with their head coaches?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "7cb2313f-3d4e-40f7-b12e-150f36d18b13",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Cristiano Biraghi'}), (m0:Player {name: 'Lino Grava'}) RETURN CASE WHEN n.height_cm > m0.height_cm THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Who is taller, Cristiano Biraghi or Lino Grava?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "fb2750f2-7e24-432b-bb86-4aab3aa75d75",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'Impressionism'}) WITH DISTINCT n RETURN count(DISTINCT n.country_of_origin)",
    "nl_question": "How many different countries of origin are there for sculptures associated with the Impressionism art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "4d3531a1-e9b6-4256-b07d-eb0287232bff",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'parvclass'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of taxa that have the rank of parvclass?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "b9f7ceb5-5e81-4f18-afda-5dd8266937d8",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'river'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Crustacea'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that live in rivers and feed on Crustacea?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "5275743a-f3c5-4515-904c-a2635e619302",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Reclining Nude'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "Who is the creator of the sculpture Reclining Nude, and what is their gender?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "45d593cd-5aed-48db-9863-502a7083f649",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Painting {name: 'Interior of right wing, St. Ursula altarpiece'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of museums where the painting \"Interior of right wing, St. Ursula altarpiece\" is displayed?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "0b6fe16e-8101-44c1-a9eb-bb483cf6857b",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Théodore Rousseau'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of paintings created by Théodore Rousseau?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "11533737-c863-416f-b1ed-fa5913b40812",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Venue)<-[r0:hasHomeVenue]-(m0:Club {name: 'R.O.C. de Charleroi-Marchienne'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of venues that have served as the home ground for R.O.C. de Charleroi-Marchienne at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "77b05936-4169-4b3a-a148-7ba80fb32741",
    "graph": "biology",
    "gold_cypher": "MATCH (n:TaxonRank)<-[r0:hasRank]-(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Myriophyllum'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxonomic ranks for taxa that have Myriophyllum as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "12111480-8c42-4348-bbba-bb5a51a66e20",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon)<-[r1:employs]-(m1:TerroristAttack {name: '2015 Ankara bombings'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of terrorist attacks that used the same weapons as the 2015 Ankara bombings, and how many of those weapons did each attack employ?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "6d2fff65-8dac-42c4-a040-696433801d4e",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: 'Guildford pub bombings'}) WITH DISTINCT n RETURN n.locations",
    "nl_question": "Where did the Guildford pub bombings take place?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "91347577-f69e-499a-8bce-a80038ea6f06",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'Mannheimer Galerie'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of paintings displayed at the Mannheimer Galerie?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "a55231ed-5fcf-487f-ba02-b12e8c1e4887",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Painting)-[r1:createdBy]->(m1:Person {name: 'Dirk Stoop'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of museums where paintings by Dirk Stoop are displayed?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "c895dc03-b476-4ce6-9d8d-67d164dba730",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'solutional cave'}) RETURN n, m0 as m UNION MATCH (n:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Trachelospermum'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that either live in solutional caves or have Trachelospermum as a parent?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "e6d0d2f6-8fb2-4f99-ae61-0bdca0ee0beb",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon)<-[r1:employs]-(m1:TerroristAttack {name: '2022 Kabul mosque attack'}) WITH DISTINCT n RETURN n.name ORDER BY n.date ASC LIMIT 1",
    "nl_question": "What is the earliest terrorist attack that used the same weapon as the 2022 Kabul mosque attack?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "c4f6d69a-7935-4144-9d5e-67f7b3361f21",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League)<-[r1:partOfLeague]-(m1:Club {name: 'PEC Zwolle'}) WITH DISTINCT n RETURN n.name, n.inception_year",
    "nl_question": "What are the names and founding years of clubs that are in the same league as PEC Zwolle?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "ec02c10e-eaf5-4e7b-9d00-1eaa698f1c5b",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'order'}) OPTIONAL MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of all taxa with the rank of order, along with the number of habitats each one inhabits.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "15973e71-ea1c-4acc-ab68-954b4cdb7540",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasConservationStatus]->(m0:ConservationStatus {name: 'Least Concern'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Toona sureni'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans of taxa that are classified as Least Concern and feed on Toona sureni?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "85e8d331-83a7-4ebe-ad59-b8e476e72c24",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'shrubland'}) WITH DISTINCT n RETURN DISTINCT n.diel_cycle",
    "nl_question": "What are the unique diel cycles of taxa that feed on species living in shrubland habitats?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "b55c2a18-45b1-4d7a-990d-fc8c6ac05585",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Habitat)<-[r0:inhabits]-(m0:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'arable land'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of habitats that are home to species also found in arable land, and how many such species inhabit each of these habitats?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "da6e9659-65e7-4a1d-b53d-56b25132e423",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Country)<-[r0:occursIn]-(m0:TerroristAttack {name: 'June 2016 Mogadishu attacks'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Which countries did the June 2016 Mogadishu attacks take place in?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "4b9ba437-9764-4934-a33e-44743c45135d",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'Early Netherlandish painting'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of genres for paintings associated with the Early Netherlandish painting movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "87ef0084-d114-4934-8915-3b44b15d7a4e",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'shoulder-fired missile'}),(n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'rocket-propelled grenade'}) WITH DISTINCT n RETURN n.name, n.number_of_injuries",
    "nl_question": "What are the names and injury counts of terrorist attacks that used both shoulder-fired missiles and rocket-propelled grenades?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "ffe04c8a-7064-4926-aa6a-c5cf3398f465",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Alfredo Colombo'}),(n:Club)<-[r1:playsFor]-(m1:Player {name: 'Marco Tardelli'}) WITH DISTINCT n RETURN n.name, n.inception_year",
    "nl_question": "What are the names and founding years of clubs that both Alfredo Colombo and Marco Tardelli have played for at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "49b4673e-8e7f-47e4-805f-151efc5c3b94",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'United States of America'}) WITH DISTINCT n RETURN n.name ORDER BY n.date ASC LIMIT 1",
    "nl_question": "What is the name of the earliest terrorist attack that took place in the United States of America?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "30cce515-2c87-4bdb-bc8f-69d070df7af3",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club {name: 'Orange County Blue Star'}) WITH DISTINCT n RETURN n.country",
    "nl_question": "Which country is Orange County Blue Star located in?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "379d7fd5-0034-4c05-b98d-ba9bce1c1cf1",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'hand grenade'}) WITH DISTINCT n RETURN max(n.date)",
    "nl_question": "What is the latest date of a terrorist attack that used a hand grenade?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "45844e0f-ce8c-48dd-af06-81a30cf9b660",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Félix-Alexandre Desruelles'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'public art'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures either created by Félix-Alexandre Desruelles or classified as public art?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "81cf4359-adb2-4c8d-87bf-d5b88ce4f92d",
    "graph": "biology",
    "gold_cypher": "MATCH (n:ConservationStatus)<-[r0:hasConservationStatus]-(m0:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'subspecies'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of conservation statuses assigned to subspecies, and how many subspecies have each of these statuses?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "b4a236ce-b1d6-4378-b195-e350a3fa81d4",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'Le Bassin des Nympheas'}) RETURN n, m0 as m UNION MATCH (n:Person)<-[r1:createdBy]-(m1:Painting {name: 'Carrières-Saint-Denis'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many individuals created either Le Bassin des Nympheas or Carrières-Saint-Denis?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "818f9a1e-3b14-4bb7-bb5e-4df766c7d681",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Venue)<-[r0:hasHomeVenue]-(m0:Club)<-[r1:playsFor]-(m1:Player {name: 'Giuseppe Negretti'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of venues that have served as the home ground for any club Giuseppe Negretti has played for?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "d50287ee-b980-4360-8cea-25e7a6a05d67",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Auguste Rodin'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many art movements are linked to sculptures created by Auguste Rodin?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "e84b6d0a-2164-4311-b342-3d73353dd015",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'VfL Wolfsburg'}) WITH DISTINCT n WHERE n.height_cm < 190 RETURN n.name",
    "nl_question": "What are the names of players who have been part of VfL Wolfsburg and are shorter than 190 cm?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "5bb573e5-3553-41a8-89b2-b0eb20a8fb77",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Alessandro Doga'}), (m0:Player {name: 'Diego Perrone'}) RETURN n.gender = m0.gender AS answer",
    "nl_question": "Are Alessandro Doga and Diego Perrone of the same gender?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "485f87df-0233-479e-9803-3b7c02141da7",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League)<-[r1:partOfLeague]-(m1:Club {name: 'Deportivo Toluca F.C.'}) WITH DISTINCT n WHERE 'Cemento Cruz Azul' IN n.owners RETURN n.name",
    "nl_question": "What are the names of clubs in the same league as Deportivo Toluca F.C. that are owned by Cemento Cruz Azul?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "c8d3880e-1128-43af-9b5f-7f38fe345868",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award)<-[r1:receivesAward]-(m1:Player {name: 'Fabio Cannavaro'}) WITH DISTINCT n RETURN avg(n.mass_kg)",
    "nl_question": "What is the average mass in kilograms of players who have received the same awards as Fabio Cannavaro?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "eac42d83-6249-4106-9ffb-f00712ee2287",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player)-[r1:playsPosition]->(m1:Position {name: 'left winger'}) WITH DISTINCT n RETURN DISTINCT n.country",
    "nl_question": "Which countries have clubs that have had a player in the left winger position at some point?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "c2cf40a0-05f1-4e43-851f-773464889edf",
    "graph": "biology",
    "gold_cypher": "MATCH (n:ConservationStatus)<-[r0:hasConservationStatus]-(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Aplonis'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many distinct conservation statuses are there for taxa that have Aplonis as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "9bdb6a1f-0a39-449d-8bc0-80410647bb79",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Fruit Torso (Torse fruit)'}),(n:Person)<-[r1:createdBy]-(m1:Painting {name: 'Untitled Project (for a rug or tapestry)'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "Who are the individuals who created both the sculpture Fruit Torso (Torse fruit) and the painting Untitled Project (for a rug or tapestry), and where were they born?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "ca74cfcc-4869-4353-aa61-df28c2cdb4ea",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club)-[r1:partOfLeague]->(m1:League {name: 'Slovenian Third League'}) WITH DISTINCT n RETURN n.name ORDER BY n.date_of_death ASC",
    "nl_question": "What are the names of players who have played for a club in the Slovenian Third League, sorted by their date of death from earliest to latest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  }
]
