[
  {
    "qid": "88c623ad-00cf-465d-be3f-87825985d023",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Reclining Nude'}) WITH DISTINCT n RETURN n.name, n.date_of_birth",
    "nl_question": "Who are the individuals who created the sculpture Reclining Nude, and what are their birth dates?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "13121e5e-c967-43ec-8c26-66536133bd6d",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture {name: 'Fugitive Love by Auguste Rodin-RF 2241'}), (m0:Sculpture {name: 'doors of market church'}) RETURN n.creation_year = m0.creation_year AS answer",
    "nl_question": "Were Fugitive Love by Auguste Rodin-RF 2241 and the doors of market church created in the same year?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "a4281ad0-3df3-4049-ba99-75c946c89e99",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Städel Museum'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures exhibited at the Städel Museum?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "578bedb2-154f-49c3-b84e-98d746fbaae9",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'aphid'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Horntail'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa that feed on both aphids and Horntails?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "21afba49-076a-4ca8-91b9-02424f0d127e",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'VfL Wolfsburg'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "What are the names and birthplaces of players who have been part of VfL Wolfsburg at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "f4b925c3-3d32-4e60-8c49-af9d7a9ca3a6",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'Russia'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'pistol'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many terrorist attacks either took place in Russia or involved the use of a pistol?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "6fd8c66d-7e13-406a-a417-5bcaad37deff",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player)-[r1:playsPosition]->(m1:Position {name: 'playmaker'}) WITH DISTINCT n RETURN count(DISTINCT n.country)",
    "nl_question": "How many different countries have clubs that have had a playmaker on their team at some point?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "4941aedf-775d-4846-a6ec-8854c83c74f2",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Vulnerable'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days ASC LIMIT 1",
    "nl_question": "What is the name of the taxon, which is preyed upon by a taxon with a Vulnerable conservation status, that has the shortest average gestation period?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "79307f8d-1556-4964-8185-770fe4156948",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Rodin Museum'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year ASC LIMIT 1",
    "nl_question": "What is the name of the oldest sculpture displayed at the Rodin Museum?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "2e955038-621a-43f1-979b-d466b3d9ac1d",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'Germany'}),(n:TerroristAttack)-[r1:perpetratedBy]->(m1:Terrorist {name: 'Ralf Wohlleben'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks that took place in Germany and were carried out by Ralf Wohlleben?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "ffc50d52-a22a-4f65-a97a-4fdc269fd128",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Italian Football Hall of Fame'}),(n:Player)-[r1:receivesAward]->(m1:Award {name: 'European Golden Shoe'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the players who have received both the Italian Football Hall of Fame and the European Golden Shoe awards?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "b5b10780-9e30-49fb-9a10-a4b4e8b47a97",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon {name: 'turtle'}) WITH DISTINCT n RETURN n.taxon_name",
    "nl_question": "What is the taxonomic name of the turtle?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "36d0ecb6-134b-4bb4-8cdf-7d82739515f0",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person)<-[r1:createdBy]-(m1:Painting {name: 'Portrait of Professor W. D. Marks'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings created by the same artist who painted Portrait of Professor W. D. Marks?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "2e0b598c-d2f2-47f6-9d86-70f36be209dc",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'class'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that are classified under the rank of class?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "ba99fa99-3f37-4282-ac58-aece733f73cd",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Alfredo Colombo'}),(n:Club)<-[r1:playsFor]-(m1:Player {name: 'Marco Tardelli'}) WITH DISTINCT n RETURN n.name, n.head_coach",
    "nl_question": "What are the names of clubs that both Alfredo Colombo and Marco Tardelli have played for, along with the names of their head coaches?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "b14ae02a-2e97-496b-a514-9948f06706b1",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'genre painting'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures that belong to the genre of genre painting?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "53afb959-7095-47ee-bfa5-df47c9a89b16",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'hand grenade'}),(n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Spain'}) WITH DISTINCT n RETURN n.name, n.number_of_deaths",
    "nl_question": "What are the names and death tolls of terrorist attacks in Spain that involved the use of hand grenades?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "5a63e2c9-2572-4811-8f4c-c3fb1c78dee5",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Museum of Grenoble'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of genres for paintings exhibited at the Museum of Grenoble, and how many paintings of each genre are displayed there?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "70a54c5a-d9f8-4659-ac48-276914a798da",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'Leporidae'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that prey on Leporidae?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "a392074b-7d3f-4d2c-978a-83318ab57083",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Riccardo Bocalon'}) WITH DISTINCT n RETURN n.name ORDER BY n.inception_year DESC",
    "nl_question": "What are the names of clubs Riccardo Bocalon has played for, sorted by their founding year from the newest to the oldest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "1ca480f1-9b63-4714-b04b-94c8d617fd59",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'commemorative statue'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'public art'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many sculptures are there that are either commemorative statues or public art?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "3d8c3573-6b29-4d1c-8ecb-bd17600ec99e",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'mangrove forest'}) RETURN n, m0 as m UNION MATCH (n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'insect'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many taxa either live in mangrove forests or feed on insects?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "a5a2445f-9814-4016-94a1-506e0bdbfb49",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Illigera'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods in days of taxa that have Illigera as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "59682672-9a9c-4b1c-bcfb-c0e2ee099572",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Meret Oppenheim'}),(n:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'surrealism'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures created by Meret Oppenheim that are associated with surrealism?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "7a365d2a-7380-41ba-a465-7407e2ed0977",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'tribe'}),(n:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Centaureinae'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods in days of taxa that are ranked as a tribe and are children of Centaureinae?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "1bc29fcd-0907-4d89-931f-1199e13ec4ab",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Oryctolagus'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of taxa that feed on species with Oryctolagus as a parent, and how many such species does each taxon feed on?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "7b9ecc9f-0fa5-4409-af73-fc8692157566",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'William Orpen'}),(n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Walker Art Gallery'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC LIMIT 1",
    "nl_question": "What is the name of the most recently created painting by William Orpen that is displayed at the Walker Art Gallery?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "3621ba57-aedd-4c73-9248-9c271680939f",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'smell of burning'}),(n:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Calluna'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans in years of taxa that live in the smell of burning and have Calluna as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "e31f5357-983f-4093-95dc-5d1e19fffc3a",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Luigi Binda'}),(n:Club)<-[r1:playsFor]-(m1:Player {name: 'Giuseppe Unere'}) WITH DISTINCT n RETURN n.name, n.head_coach",
    "nl_question": "What are the names of clubs that both Luigi Binda and Giuseppe Unere have played for, along with their head coaches?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "630dd82e-9e2a-4b99-9cec-b6996774f612",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:League)<-[r0:partOfLeague]-(m0:Club)<-[r1:playsFor]-(m1:Player {name: 'Andrea Luci'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of the leagues that include clubs Andrea Luci has played for, and how many such clubs are in each league?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "8e2a6637-45cd-4ed5-a69b-c87136aae0ba",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'forest'}),(n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'wolf'}) WITH DISTINCT n WHERE n.avg_gestation_period_days < 230 RETURN n.name",
    "nl_question": "What are the names of species that live in forests and are preyed upon by wolves, with an average gestation period of less than 230 days?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "9fb916aa-cd0a-4674-9e3e-25c526aecc9e",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'revolver'}) WITH DISTINCT n RETURN n.name, n.number_of_deaths",
    "nl_question": "What are the names and death tolls of terrorist attacks that used a revolver?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "9fd663bd-31c8-486b-8384-301a16b61b8a",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Bird Mask (Masque d\\'oiseau)'}) WITH DISTINCT n RETURN n.name, n.date_of_birth",
    "nl_question": "Who are the creators of the sculpture Bird Mask (Masque d'oiseau), and when were they born?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "cef99cdf-ad92-4c14-a80c-f3e001fa070e",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'small arms'}),(n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'assault rifle'}) WITH DISTINCT n RETURN n.name, n.locations",
    "nl_question": "What are the names and locations of terrorist attacks that used both small arms and assault rifles?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "c7dde77e-7c00-4855-a042-8fc5702c4bf2",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting {name: 'Christ and the Centurion'}), (m0:Painting {name: 'Natura Morta [Still Life]'}) RETURN CASE WHEN n.creation_year > m0.creation_year THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Which painting was created later, Christ and the Centurion or Natura Morta [Still Life]?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "451bd451-9864-413d-9d9d-393d5e219130",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Psammophiinae'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods (in days) of taxa that are descendants of taxa which have Psammophiinae as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "b1710821-0d8a-44bc-9a3c-ca4b1e712711",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'sword'}),(n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'pistol'}) WITH DISTINCT n RETURN n.name, n.locations",
    "nl_question": "What are the names and locations of terrorist attacks that involved both a sword and a pistol?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "abfa8ac1-8114-40bc-9946-5ce72c965629",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'Impressionism'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of art movements linked to sculptures that are also connected with Impressionism?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "f42675d6-4e0e-4358-8eec-91f89808eba5",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Aston Villa F.C.'}),(n:Player)-[r1:receivesAward]->(m1:Award {name: 'Landon Donovan MVP Award'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the players who have been part of Aston Villa F.C. and have also received the Landon Donovan MVP Award?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "ed991906-b72c-4555-9bc7-cdfa1360bbde",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Marcos Miranda'}),(n:Club)<-[r1:playsFor]-(m1:Player {name: 'Giuliano Bertarelli'}) WITH DISTINCT n RETURN n.name, n.head_coach",
    "nl_question": "What are the names of clubs that both Marcos Miranda and Giuliano Bertarelli have played for, along with the names of their head coaches?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "6b1ea002-a603-4b42-af4e-8c6116a704d2",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'rifle'}),(n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Israel'}) WITH DISTINCT n RETURN n.name, n.number_of_injuries",
    "nl_question": "What are the names and injury counts of terrorist attacks in Israel that involved the use of a rifle?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "9a363a1d-c47c-47a4-886d-005476dca80a",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'attacking midfielder'}) WITH DISTINCT n RETURN n.name ORDER BY n.height_cm DESC LIMIT 1",
    "nl_question": "Who is the tallest player in the attacking midfielder position?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "a2bba4c1-a3b1-4b99-9774-4814324e5fa9",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Painting {name: 'The Martyrdom and Last Communion of Saint Lucy'}),(n:Museum)<-[r1:displayedAt]-(m1:Sculpture {name: 'Oriforme'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of museums where both the painting \"The Martyrdom and Last Communion of Saint Lucy\" and the sculpture \"Oriforme\" are displayed?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "3fbeed94-94a7-4e93-9591-8f1898b18f5e",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'grassland'}) OPTIONAL MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of all taxa that live in grasslands, along with the number of different taxa they feed on.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "637e3e15-05e8-426a-842f-1651d208de01",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "Provide the names and taxon names of taxa that feed on other taxa.",
    "from_template": {
      "match_category": "basic_(n)-(m0)",
      "match_cypher": "MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "6d9ed3e7-17bd-4756-8836-44f53adcfce3",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'portrait sculpture'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "Who are the individuals who created portrait sculptures, and what are their genders?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "4b0862fd-56ec-458e-9b34-855324d8082f",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Avarice and lust'}),(n:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'The Kiss by Auguste Rodin'}) WITH DISTINCT n RETURN n.name, n.date_of_death",
    "nl_question": "Who are the individuals who created both the sculptures Avarice and Lust and The Kiss by Auguste Rodin, and when did they pass away?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "33cdf7aa-8cb2-4499-9479-9317f1dfb7c0",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'aphid'}),(n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Common Starling'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans of taxa that eat aphids and are also preyed upon by the Common Starling?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  }
]
