[
  {
    "qid": "0a8d08e2-0d3c-4906-a621-875ec9243a58",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Inter Milan'}) RETURN n, m0 as m UNION MATCH (n:Player)-[r1:receivesAward]->(m1:Award {name: 'FIFA World Player of the Year'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many players have either played for Inter Milan at some point or received the FIFA World Player of the Year award?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "ac09dfbe-19db-46e9-9ba7-bdbf373fbcd7",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'portrait'}),(n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'High Renaissance'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings that are portraits and are linked to the High Renaissance art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "fcc73631-60e0-4a2e-ae35-b5750ab1d1c8",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'subterranea'}),(n:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Mayagryllus tumbalaensis'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa that live in subterranean habitats and are offspring of Mayagryllus tumbalaensis?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "187cd578-de7b-4c1b-b67c-02f88132d51f",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: 'Melbourne Turkish consulate bombing'}), (m0:TerroristAttack {name: 'April 2022 Mogadishu bombing'}) RETURN CASE WHEN n.date > m0.date THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Which occurred later: the Melbourne Turkish consulate bombing or the April 2022 Mogadishu bombing?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "a0bf4ee8-5e9f-41df-b224-29c2ab7e08e8",
    "graph": "biology",
    "gold_cypher": "MATCH (n:TaxonRank) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many distinct taxonomic ranks are there?",
    "from_template": {
      "match_category": "basic_(n)",
      "match_cypher": "MATCH (n)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "7fc75bff-7e75-4592-9f6a-5ba076227ccb",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'Royal Museum of Fine Arts Antwerp'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Who are the artists who have created sculptures displayed at the Royal Museum of Fine Arts Antwerp, and how many such sculptures has each artist created?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "cc8a6ff3-4e91-4cdd-856e-58dced25e09c",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Félix-Alexandre Desruelles'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'public art'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many sculptures were either created by Félix-Alexandre Desruelles or belong to the genre of public art?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "5f48da56-b4ab-4f62-ba15-41f7a0c0e2bf",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'Portrait of Hendrik van der Zande, Jurist and Dramatic Poet in Amsterdam'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "Who are the individuals who created the painting titled Portrait of Hendrik van der Zande, Jurist and Dramatic Poet in Amsterdam, and what are their genders?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "1b5bcd39-a75f-424a-8c71-2a9a5096aec9",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'neoclassicism'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures linked to the neoclassicism art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "3ccb42a7-85a3-4082-9d40-f56b2ed6672d",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'Apostle series Almadrones'}),(n:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'Statue of The Risen Christ'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the artists that created both the Apostle series Almadrones and the Statue of The Risen Christ?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "e1324d44-7999-4dd2-beab-48e1165dedcf",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Least Concern'}) WITH DISTINCT n RETURN DISTINCT n.diel_cycle",
    "nl_question": "What are the unique diel cycles of taxa whose parents have a conservation status of Least Concern?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "326c99b1-b844-48c9-a9c1-108e113b2781",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'wetland'}) WITH DISTINCT n RETURN max(n.avg_gestation_period_days)",
    "nl_question": "What is the longest average gestation period among taxa that live in wetlands?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "8c1a4f8c-d0a0-46a4-9588-72cdb3ef18a3",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Weapon)<-[r0:employs]-(m0:TerroristAttack)-[r1:targets]->(m1:Target {name: 'Al-Noor Islamic Centre'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of weapons used in terrorist attacks targeting the Al-Noor Islamic Centre?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "c1abd9fa-a8b1-476f-932c-a0992b05c590",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Position)<-[r0:playsPosition]-(m0:Player)-[r1:playsFor]->(m1:Club {name: 'FC Montceau'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many different positions have been played by players who have been part of FC Montceau at some point?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "0ec8f19a-2837-4883-bff9-73b46f253c83",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club)-[r1:partOfLeague]->(m1:League {name: 'Liga 1'}) WITH DISTINCT n RETURN n.name, n.date_of_death",
    "nl_question": "What are the names and dates of death of players who have been part of a club in Liga 1?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "bdc7df23-b038-4fd4-a6b7-d82a85f7be77",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Target)<-[r0:targets]-(m0:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Iraq'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of targets of terrorist attacks that took place in Iraq?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "17bd20fa-2746-4aba-9e26-f66fcc590d03",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist {name: 'Amedy Coulibaly'}) WITH DISTINCT n RETURN n.country_of_citizenship",
    "nl_question": "What is Amedy Coulibaly's country of citizenship?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "9edaf237-9987-43f1-b102-60e2ec365d4b",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'Denmark'}) WITH DISTINCT n RETURN n.name ORDER BY n.number_of_injuries ASC",
    "nl_question": "What are the names of terrorist attacks that took place in Denmark, sorted by the number of injuries from the fewest to the most?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "288d482b-c23e-4ce8-9566-2a72e1f23ce3",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Reclining Nude'}) WITH DISTINCT n RETURN n.name, n.date_of_death",
    "nl_question": "Who are the individuals who created the sculpture Reclining Nude, and when did they pass away?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "06a27523-ba4b-4be6-a302-447243bffbd6",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Villa Nova Atlético Clube'}) WITH DISTINCT n RETURN n.name, n.height_cm",
    "nl_question": "What are the names and heights in centimeters of players who have played for Villa Nova Atlético Clube at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "1783aa2d-dc22-42a7-b921-6c44f578a938",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club {name: 'Portland Timbers'}), (m0:Club {name: 'Vagonul Arad'}) RETURN n.inception_year - m0.inception_year AS answer",
    "nl_question": "What is the difference in the founding years between Portland Timbers and Vagonul Arad?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  },
  {
    "qid": "4ccf4a34-4e64-4a99-83ac-74283747e478",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: '2002 Immanuel bus attack'}), (m0:TerroristAttack {name: 'Droppin Well bombing'}) RETURN n.number_of_deaths = m0.number_of_deaths AS answer",
    "nl_question": "Do the 2002 Immanuel bus attack and the Droppin Well bombing result in the same number of deaths?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "bebc6ce2-1ad5-4f7e-a7c6-2fb187626fac",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Magnoliales'}),(n:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'family'}) WITH DISTINCT n RETURN count(DISTINCT n.diel_cycle)",
    "nl_question": "How many unique diel cycles are there among taxa that belong to the family rank and have Magnoliales as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "7b8c81bb-bd46-4682-9eee-bf9431a0b7c6",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'High Renaissance'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'Renaissance'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings linked to either the High Renaissance or the Renaissance art movements?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "424f97a8-f8e5-4c43-8d7f-ca5ab7e74024",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Award)<-[r0:receivesAward]-(m0:Player)-[r1:playsFor]->(m1:Club {name: 'Atlético Madrid'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of awards received by players who have played for Atlético Madrid?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "c9a1a194-f9c8-40e8-bc64-61df349a7190",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Meret Oppenheim'}),(n:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'surrealism'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of sculptures made by Meret Oppenheim that are linked to surrealism?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "59770fc8-46e9-4137-b181-ecc024c8eef8",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person)<-[r1:createdBy]-(m1:Painting {name: 'Taking Up Net'}) WITH DISTINCT n WHERE n.creation_year > 1903 RETURN n.name",
    "nl_question": "What are the names of paintings created by the same artist who made Taking Up Net, with a creation year after 1903?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "412d1ee2-0c2e-4e97-96c6-fd7dcdcd910b",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club {name: 'FC Liefering'}) WITH DISTINCT n RETURN n.inception_year",
    "nl_question": "When was FC Liefering founded?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "7c30abbb-fd19-4a42-956d-aadd71f9581a",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'Städel Museum'}) OPTIONAL MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of sculptures displayed at the Städel Museum, and how many different genres does each sculpture belong to?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "6ba9cd6b-f44e-44f8-942a-0b26fe0b440a",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of species that are preyed upon by other species?",
    "from_template": {
      "match_category": "basic_(n)-(m0)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "09cbe647-518c-4ed7-8ed6-dbf7f16f3a59",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'religious art'}) OPTIONAL MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of sculptures in the religious art genre, and how many art movements is each associated with?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "5bd21180-5777-4b3d-b69c-9dcd6e216c9c",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'kinetic art'}) OPTIONAL MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of sculptures in the kinetic art genre, and how many art movements is each associated with?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "6463fb4f-19f7-4897-9687-f178a9f5b8e4",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'landscape art'}),(n:Painting)-[r1:hasGenre]->(m1:Genre {name: 'religious art'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC LIMIT 1",
    "nl_question": "What is the name of the most recently created painting that belongs to both the landscape art and religious art genres?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "fadb4e5f-87fc-4e56-957b-f538219876a9",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'commemorative statue'}) OPTIONAL MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of sculptures that are commemorative statues, and how many different genres does each one belong to?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "8aa98e41-11bb-4ef0-853d-a46af3d32b3f",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture {name: 'Revolving Torsion'}) WITH DISTINCT n RETURN n.name, n.end_year",
    "nl_question": "What are the names and end years of art movements associated with the sculpture Revolving Torsion?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "0759608b-956e-43b1-9a9b-654b1d92cb00",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Metapterygota'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa that feed on species whose parent is Metapterygota?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "3e13ffaf-02ab-40ae-a7ac-48edfc4563c4",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'Neptune by Gabriel-Vital Dubray'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures made by the same person who created Neptune by Gabriel-Vital Dubray?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "b6cd6baa-0c34-4f31-b63a-dfb17fb08442",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'bomb'}),(n:TerroristAttack)-[r1:targets]->(m1:Target {name: 'St. Sebastian’s Church'}) WITH DISTINCT n RETURN n.name, n.number_of_injuries",
    "nl_question": "What are the names of terrorist attacks that used a bomb and targeted St. Sebastian’s Church, along with the number of injuries they caused?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "64345c95-60d8-479b-91f6-3fa5af3f33af",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Egypt'}) OPTIONAL MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of terrorist attacks that took place in Egypt, and how many different weapons were used in each?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "06ce7de0-67c4-469b-8130-9fe2979adeb8",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon {name: 'adder'}) RETURN n, m0 as m UNION MATCH (n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Pseudocerastes urarachnoides'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many taxa are preyed upon by either the adder or Pseudocerastes urarachnoides?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "1bdc2338-d463-46da-9380-8cb9e10f561c",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'S.S.C. Napoli'}) RETURN n, m0 as m UNION MATCH (n:Player)-[r1:playsFor]->(m1:Club {name: 'AS Monaco FC'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many players have been part of either S.S.C. Napoli or AS Monaco FC at any time?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "d52660fc-c410-4840-9b96-b033de5b21d4",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'desert'}),(n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Efferia'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that live in the desert and are preyed upon by Efferia?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "685a7b7f-fbe3-457f-9a15-c1ff27c95414",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Steynbank'}),(n:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'Georges Eekhoud'}) WITH DISTINCT n RETURN n.name, n.date_of_death",
    "nl_question": "Who are the individuals who created both the sculptures Steynbank and Georges Eekhoud, and when did they pass away?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "ea35d921-67ec-413a-b598-0d84aa7165cd",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Cruzeiro E.C.'}),(n:Player)-[r1:playsPosition]->(m1:Position {name: 'midfielder'}) WITH DISTINCT n RETURN n.name, n.schools_attended",
    "nl_question": "What are the names and schools attended by players who have been midfielders for Cruzeiro E.C. at some point?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "deb54172-5657-47f8-8397-3dcd60ce92bc",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Musée des Beaux-Arts de Strasbourg'}) WITH DISTINCT n RETURN n.name ORDER BY n.end_year ASC LIMIT 1",
    "nl_question": "What is the name of the art movement linked to paintings exhibited at the Musée des Beaux-Arts de Strasbourg that ended the earliest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "72f9c465-7457-4315-a5e2-4d82538939a3",
    "graph": "biology",
    "gold_cypher": "MATCH (n:TaxonRank)<-[r0:hasRank]-(m0:Taxon {name: 'Lysimachia dushanensis'}),(n:TaxonRank)<-[r1:hasRank]-(m1:Taxon {name: 'Stephens\\' Banded Snake'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxonomic ranks shared by both Lysimachia dushanensis and Stephens' Banded Snake?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "d92ca72d-4bae-493b-9d3f-aee231cdd354",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Auguste Rodin'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'Modern sculpture'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures either created by Auguste Rodin or linked to the Modern sculpture movement?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  }
]
