[
  {
    "qid": "0970e859-c9bc-407b-9033-aea4afd39345",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'avant-garde'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of art movements linked to sculptures that are associated with the avant-garde movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "3bcb74dd-dcc9-4e43-85dd-fa10492bb5a1",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'Gastropoda'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days DESC LIMIT 1",
    "nl_question": "Which taxon that preys on Gastropoda has the longest average gestation period?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "84a50843-4673-4912-beea-9e4dd190c6a6",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person)<-[r1:createdBy]-(m1:Painting {name: 'Taking Up Net'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings created by the same artist who made Taking Up Net?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "00813a52-aca3-4ef7-9fab-2b95d6bd9dd6",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Venia Demetrakopoulou'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures created by Venia Demetrakopoulou?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "2d2670c6-0c9d-426c-90b6-160088bedd8b",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Jean-Claude Yacoubian'}) WITH DISTINCT n RETURN DISTINCT n.country",
    "nl_question": "Which countries have clubs that Jean-Claude Yacoubian has played for at any time, either in the past or present?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "ebd69df3-3143-4360-a0d1-d98036e1e151",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'grassland'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that feed on species living in grassland habitats?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "07a362af-2175-4dcf-98e6-652e8b6b2b6e",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'playmaker'}) WITH DISTINCT n RETURN n.name, n.date_of_birth",
    "nl_question": "What are the names and birthdates of players who play as a playmaker?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "55fb90bf-f6f8-4e08-bc9f-15f9b893f00a",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre)<-[r1:hasGenre]-(m1:Painting {name: 'The Feast of Dives and Lazarus'}) WITH DISTINCT n RETURN DISTINCT n.country_of_origin",
    "nl_question": "Which unique countries are the origin of paintings that share the same genre as The Feast of Dives and Lazarus?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "4c284f8c-388d-43d9-a2ec-a3a499e711d7",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting {name: 'The Wounded Cuirassier, study'}) WITH DISTINCT n RETURN n.creation_year",
    "nl_question": "When was The Wounded Cuirassier, study created?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "a570f2b3-2a85-41fd-8118-bb1a73469a41",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Award)<-[r0:receivesAward]-(m0:Player)-[r1:playsPosition]->(m1:Position {name: 'defender'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of awards received by players in the defender position, and how many such players have received each award?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "6776c618-7b19-4750-8e6b-434887609f3a",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'Euphausiacea'}),(n:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Balaenoptera'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that feed on Euphausiacea and have Balaenoptera as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "333081c8-1dcb-45f7-8ca3-81263aa2f57e",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r1:playsFor]->(m1:Club {name: 'A.C.R. Messina'}) OPTIONAL MATCH (n:Player)-[r0:receivesAward]->(m0:Award) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of all players who have played for A.C.R. Messina at any time, along with the number of awards each has received.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "436d3bd1-a3fc-4851-b90e-32256a9bb420",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'genus'}),(n:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Myotinae'}) WITH DISTINCT n RETURN n.name ORDER BY n.longest_lifespan_years ASC",
    "nl_question": "What are the names of taxa that are classified as a genus and have Myotinae as a parent, sorted by their longest lifespan from shortest to longest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "3b3ef70c-f887-4b88-8e75-da35f0bb95a9",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon {name: 'Pinnipedia'}), (m0:Taxon {name: 'Hog badger'}) RETURN n.longest_lifespan_years - m0.longest_lifespan_years AS answer",
    "nl_question": "What is the difference in the longest lifespan, in years, between Pinnipedia and the Hog badger?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  },
  {
    "qid": "a36df78d-906b-4789-b2c6-cd67b76133dd",
    "graph": "biology",
    "gold_cypher": "MATCH (n:TaxonRank)<-[r0:hasRank]-(m0:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Sangihe Scops Owl'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of taxonomic ranks assigned to the prey of the Sangihe Scops Owl, and how many prey items fall under each rank?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "e44d561d-6271-4a7d-89f1-900ebc583f54",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'religious art'}),(n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Herzog Anton Ulrich Museum'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings that belong to the religious art genre and are exhibited at the Herzog Anton Ulrich Museum?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "878154f3-315d-4966-b7f4-322a2428fb72",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'Deutsche Barockgalerie'}),(n:Painting)-[r1:hasGenre]->(m1:Genre {name: 'mythological painting'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of mythological paintings displayed at the Deutsche Barockgalerie?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "a605b6a3-438f-4bdf-999c-13eeb59df185",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'Museum of Fine Arts of Lyon'}),(n:Painting)-[r1:createdBy]->(m1:Person {name: 'Claude Monet'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC LIMIT 1",
    "nl_question": "What is the name of the most recently created painting by Claude Monet that is displayed at the Museum of Fine Arts of Lyon?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "f3eb2af1-da16-4b39-98c4-b73064c6a538",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'division'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that consume other taxa classified at the division rank?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "b1c99bf2-b4cd-4c73-8246-f9eb4148b126",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'group portrait'}) WITH DISTINCT n RETURN count(DISTINCT n.country_of_origin)",
    "nl_question": "How many different countries of origin are there for paintings classified as group portraits?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "e1b3a8d0-32bd-4d96-bd6c-88702f270954",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: 'Bir-Hakeim bridge attack'}) WITH DISTINCT n RETURN n.date",
    "nl_question": "When did the Bir-Hakeim bridge attack occur?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "3832c5b1-0003-4c4f-92b2-d122f010b5a8",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack)-[r1:perpetratedBy]->(m1:Terrorist {name: 'Shehzad Tanweer'}) WITH DISTINCT n RETURN min(n.date_of_birth)",
    "nl_question": "What is the earliest birth date of terrorists involved in attacks also carried out by Shehzad Tanweer?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "5d99bb8c-35b0-4d39-93e8-2826992bb555",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'gopher tortoise'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the parents of taxa that feed on the gopher tortoise?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "84a637f9-2bca-4060-a508-80dbebe85baa",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'aphid'}),(n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Common Starling'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods (in days) of taxa that both feed on aphids and are preyed upon by the Common Starling?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "bba077c7-a8ae-4a08-a6bd-d395e02bb157",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: 'EFL Championship'}),(n:Club)-[r1:hasHomeVenue]->(m1:Venue {name: 'Kirklees Stadium'}) WITH DISTINCT n RETURN n.name, n.inception_year",
    "nl_question": "What are the names and founding years of clubs that are part of the EFL Championship and have Kirklees Stadium as their home venue, either currently or in the past?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "33d259dc-86ff-4f0f-8ed6-684c51dbf323",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League)<-[r1:partOfLeague]-(m1:Club {name: 'Real Sociedad B'}) WITH DISTINCT n RETURN n.name ORDER BY n.inception_year ASC LIMIT 1",
    "nl_question": "Which club, competing in the same league as Real Sociedad B, was founded the earliest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "f27c00a2-0d74-4f2a-9275-8be07bee6c2c",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'Neptune (Sète)'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures created by the same person who made Neptune (Sète)?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "08f8343e-c695-4f43-9446-f44de9f137d2",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Gerbillinae'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that are descendants of taxa which have Gerbillinae as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "c098e566-3073-444b-ae1c-2adec126b62d",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Metapterygota'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans of taxa that feed on species whose parent is Metapterygota?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "56145ebe-e7d1-450e-b7a4-e5e15e0abafb",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'ACF Fiorentina'}),(n:Player)-[r1:receivesAward]->(m1:Award {name: 'Chilean Sportsman of the Year'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the players who have been part of ACF Fiorentina and have also received the Chilean Sportsman of the Year award?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "a37649a8-68bd-48cb-8ab1-82ab4f451a78",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Fimleikafélag Hafnarfjarðar'}),(n:Player)-[r1:playsPosition]->(m1:Position {name: 'midfielder'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "What are the names and birthplaces of players who have played as midfielders for Fimleikafélag Hafnarfjarðar?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "4cf4ed25-5236-41e7-b731-e42baf576936",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'desert'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans in years of taxa that are preyed upon by species living in the desert?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "447119fa-4ca3-4bd4-a4e1-a7cbf0af35ef",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Barringtonia'}),(n:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Least Concern'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa that are children of Barringtonia and have a conservation status of Least Concern?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "2bd95d16-6e3a-45a9-8f40-2c8bfa60008f",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'VfL Wolfsburg'}),(n:Player)-[r1:receivesAward]->(m1:Award {name: 'Goal of the Month'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the players who have been part of VfL Wolfsburg and have also received the Goal of the Month award?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "21b55703-0d4a-4906-a8d4-e1c8d273bb3f",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'Alte Nationalgalerie'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many different genres are associated with sculptures displayed at the Alte Nationalgalerie?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "a92c0969-873a-451d-9f9d-5287ac45a5d6",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement)<-[r1:associatedWith]-(m1:Painting {name: 'Les Coquelicots'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "List the names of sculptures linked to art movements that are also connected to the painting Les Coquelicots, and for each sculpture, provide the count of such art movements.",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "bb25615a-6aad-44f9-82ae-3292d3d2870f",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Sculpture {name: 'Monument to the Lion of Judah'}),(n:Genre)<-[r1:hasGenre]-(m1:Sculpture {name: 'La Rivière'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the genres shared by both the Monument to the Lion of Judah and La Rivière sculptures?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "bd1e30ef-0f5a-49c1-90bd-d01bf874f954",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Arachnida'}) WITH DISTINCT n RETURN DISTINCT n.diel_cycle",
    "nl_question": "What are the unique diel cycles of taxa that prey on organisms belonging to the Arachnida class?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "609a1d79-e34b-47c0-9521-e83883944a10",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Position)<-[r0:playsPosition]-(m0:Player)-[r1:playsFor]->(m1:Club {name: 'USM Sétif'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What positions have been played by players who have been part of USM Sétif?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "b59ca59b-e617-404c-868d-cf32ac49b1d5",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'group of sculptures'}) WITH DISTINCT n WHERE n.creation_year < 1930 RETURN n.name",
    "nl_question": "What are the names of sculptures classified as a group of sculptures that were created before 1930?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "2560bd77-0d97-4667-8c42-714c93c299ce",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Acorus'}),(n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'solutional cave'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days ASC LIMIT 1",
    "nl_question": "What is the name of the taxon, which has Acorus as a parent and lives in a solutional cave, with the shortest average gestation period?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "3c00f389-df3b-407d-9cc1-1058d38f6463",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'Le Bassin des Nympheas'}) RETURN n, m0 as m UNION MATCH (n:Person)<-[r1:createdBy]-(m1:Painting {name: 'Carrières-Saint-Denis'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the artists of either Le Bassin des Nympheas or Carrières-Saint-Denis?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "c6997546-1a95-4f1c-b9d2-e00e68821809",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: 'Guildford pub bombings'}) WITH DISTINCT n RETURN n.number_of_injuries",
    "nl_question": "How many people were injured in the Guildford pub bombings?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "279ecab3-9388-4572-897b-df65ffb74198",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'sloth bear'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of taxa that consume the same prey as the sloth bear, and how many of those prey do they consume?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "d722af87-dbda-478a-a68c-2b9bf0c647d2",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Neuroptera'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Tetranychidae'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods (in days) of taxa that are children of Neuroptera and feed on Tetranychidae?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "1812ad7d-7912-4c3e-acb1-c68c34dd4260",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'order'}),(n:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Symphyta'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that are classified as an order and are children of Symphyta?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "12f1da05-cc10-413a-9b04-23ac514f68c4",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Painting)-[r1:displayedAt]->(m1:Museum {name: 'North Carolina Museum of Art'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of genres for paintings displayed at the North Carolina Museum of Art, and how many paintings of each genre are exhibited there?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "ddb2f3f0-e85e-49f7-a38c-0a8d435e2b7f",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Vierge du Mas Rillier'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "Who are the individuals who created the sculpture Vierge du Mas Rillier, and what is their gender?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "e5ae3727-722c-4eb7-b91e-6705f527e26b",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'Art Nouveau'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "Who are the artists who created sculptures associated with the Art Nouveau movement, and where were they born?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  }
]
