[
  {
    "qid": "9356c48e-2447-40af-ac09-5df39abcd7c1",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Joseph Beuys'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of museums that exhibit sculptures created by Joseph Beuys, and how many of his sculptures are displayed at each museum?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "fb9ff579-39dc-44c7-8711-1a10bb41a54b",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Target)<-[r0:targets]-(m0:TerroristAttack {name: 'July 1979 Madrid bombings'}),(n:Target)<-[r1:targets]-(m1:TerroristAttack {name: '2006 Madrid–Barajas Airport bombing'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of targets that were involved in both the July 1979 Madrid bombings and the 2006 Madrid–Barajas Airport bombing?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "34524b39-dcd4-4e8c-8028-cacb256ae1b5",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'midfielder'}),(n:Player)-[r1:playsPosition]->(m1:Position {name: 'forward'}) WITH DISTINCT n UNWIND n.country_of_citizenship AS prop RETURN DISTINCT prop",
    "nl_question": "Which countries are home to players who play both as midfielders and forwards?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_array_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n UNWIND n.${prop} AS prop RETURN DISTINCT prop"
    }
  },
  {
    "qid": "a44b9e88-9229-4b67-90da-e608e84fe9bb",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Franco Selvaggi'}) WITH DISTINCT n WHERE 'NEEP Roma Holding' IN n.owners RETURN n.name",
    "nl_question": "What are the names of clubs that Franco Selvaggi has played for, which are owned by NEEP Roma Holding?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "62fbeb90-c92f-4be2-aa51-72a2438aea12",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Serge Gakpé'}) WITH DISTINCT n WHERE NOT 'Dmitry Rybolovlev' IN n.owners RETURN n.name",
    "nl_question": "What are the names of clubs that Serge Gakpé has played for, excluding those owned by Dmitry Rybolovlev?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "55a5df19-65ec-4ece-b5e6-eb7c097f5a5d",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:perpetratedBy]->(m0:Terrorist {name: 'Alessio Casimirri'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Italy'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many terrorist attacks were either carried out by Alessio Casimirri or took place in Italy?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "27a77cf3-6fac-4f49-a943-864026287af5",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'The Pack (Das Rudel)'}),(n:Person)<-[r1:createdBy]-(m1:Painting {name: 'Call'}) WITH DISTINCT n RETURN n.name, n.date_of_death",
    "nl_question": "Who are the individuals who created both The Pack (Das Rudel) and Call, and what are their dates of death?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "8871f14d-1257-415d-a1f1-0b8a546b570d",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Félix-Alexandre Desruelles'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures created by Félix-Alexandre Desruelles?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "57d0f419-1253-4104-9210-8a9d9202b35b",
    "graph": "biology",
    "gold_cypher": "MATCH (n:TaxonRank)<-[r0:hasRank]-(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Neognathae'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of taxonomic ranks assigned to taxa that have Neognathae as a parent, and how many such taxa exist for each rank?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "21d11bbc-1910-48ec-9d7c-abc223d04871",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Dicaeum'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Araneae'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa that have Dicaeum as a parent and feed on Araneae?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "f50a19fc-f8ee-47be-96c1-be72c2829218",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Venue)<-[r0:hasHomeVenue]-(m0:Club {name: 'IK Brage'}) WHERE r0.start_year IS NOT NULL AND r0.end_year IS NULL WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the venues that currently serve as the home ground for IK Brage?",
    "from_template": {
      "match_category": "special_time-sensitive",
      "match_cypher": "MATCH (n)<-[r0<start_year,end_year^>]-(m0<name>) WHERE r0.start_year IS NOT NULL AND r0.end_year IS NULL",
      "return_pattern_id": "n_name_special",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "91b3737e-f336-444f-8d1e-81d188b66deb",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Riccardo Bocalon'}) WITH DISTINCT n RETURN DISTINCT n.country",
    "nl_question": "Which countries have clubs that Riccardo Bocalon has played for at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "e85c8bcd-513b-47d8-983d-19b5c37e2784",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Psammophiinae'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa that are children of the parent of Psammophiinae?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "fb16bf7f-e707-4612-9c84-184dadbbef0f",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Weapon)<-[r0:employs]-(m0:TerroristAttack)-[r1:perpetratedBy]->(m1:Terrorist {name: 'Thenmozhi Rajaratnam'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of weapons used in terrorist attacks carried out by Thenmozhi Rajaratnam?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "94d29319-02ec-48c7-840e-021ed627a31c",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'mirorder'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days DESC",
    "nl_question": "What are the names of taxa whose parent belongs to the mirorder rank, sorted by their average gestation period from longest to shortest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "811a7e95-824c-4b1b-82b7-70839adedfb3",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Auguste Rodin'}),(n:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'San Diego Museum of Art'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures created by Auguste Rodin and displayed at the San Diego Museum of Art?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "4bf504e7-a935-4c21-9e17-465517fca166",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Pueraria thomsonii'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that are preyed upon by those that feed on Pueraria thomsonii?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "da5e4af5-8ea1-4513-9ae9-17abc4854698",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'Impressionism'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of museums that have displayed sculptures associated with Impressionism, and how many such sculptures have they exhibited?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "89294a89-1e38-431e-8426-29a3af07c7d3",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Landon Donovan MVP Award'}) WITH DISTINCT n RETURN n.name, n.height_cm",
    "nl_question": "What are the names and heights in centimeters of players who have received the Landon Donovan MVP Award?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "d45a96a0-6768-4422-9926-ee88d7b3c220",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'French Player of the Year'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the players who have received the French Player of the Year award?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "5bc03c48-6210-47be-b334-c81356aea14f",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'Christ Carrying the Cross'}) RETURN n, m0 as m UNION MATCH (n:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'Rearing Horse and Mounted Warrior'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many individuals created either the painting Christ Carrying the Cross or the sculpture Rearing Horse and Mounted Warrior?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "19a9e23d-77e6-4cf8-9804-8f2b39fc1cd4",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'car bomb'}) WITH DISTINCT n RETURN n.name ORDER BY n.date ASC",
    "nl_question": "What are the names of terrorist attacks that used a car bomb, listed from the earliest to the latest date?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "0bde840e-0edb-45f1-a6fe-309dc49b6907",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'species'}),(n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'marine habitat'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of species that live in a marine habitat?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "24c2f9f3-5451-4a92-8763-f006b611dce8",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Guillaume Geefs'}) OPTIONAL MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of sculptures created by Guillaume Geefs, and how many different genres does each sculpture belong to?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "220783e0-1725-4044-abbf-33e0c2f538d5",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'Spain'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'letter bomb'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks that took place in Spain or involved the use of a letter bomb?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "77288574-2507-47fd-9a9f-508f2ad41626",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'mannerism'}) OPTIONAL MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of paintings linked to the mannerism art movement, and how many different art movements is each of them associated with?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "7012c470-0b3b-466c-b81b-1518a5c8874d",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'James Surls'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures created by James Surls?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "c49fa721-3d35-46c4-859b-61fcaca119a8",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Auguste Rodin'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of museums where sculptures by Auguste Rodin are displayed?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "f2939c27-9b5a-49f4-a7c7-0742d1cee984",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum)<-[r1:displayedAt]-(m1:Sculpture {name: 'The Old Tree'}) WITH DISTINCT n WHERE n.creation_year < 1958 RETURN n.name",
    "nl_question": "What are the names of sculptures, created before 1958, that are displayed in the same museum as The Old Tree?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "8c4f2426-ae60-4884-92e1-8fb68a6404fc",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Giuseppe Signori'}) WITH DISTINCT n RETURN n.country_of_citizenship",
    "nl_question": "What is Giuseppe Signori's country of citizenship?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "921db5d0-6edf-4d7d-b4bb-a96619068c38",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'animal sculpture'}) WITH DISTINCT n RETURN n.name ORDER BY n.date_of_death DESC LIMIT 1",
    "nl_question": "Who is the most recently deceased person who created a sculpture in the genre of animal sculpture?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "0a135de7-4f9a-447f-a4e0-67e15a73ad83",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Head of Balzac'}),(n:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'The Age of Bronze'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "Who are the individuals who created both the Head of Balzac and The Age of Bronze, and what is their gender?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "18c7d377-cde5-4132-9c76-bd3bfafcd12c",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Venue)<-[r0:hasHomeVenue]-(m0:Club {name: 'ADO Den Haag'}) WHERE r0.start_year <= 2007 AND (r0.end_year >= 2007 OR r0.end_year IS NULL) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of venues that served as the home ground for ADO Den Haag in the year 2007?",
    "from_template": {
      "match_category": "special_time-sensitive",
      "match_cypher": "MATCH (n)<-[r0<start_year,end_year?>]-(m0<name>) WHERE r0.start_year <= ${r0_start_year} AND (r0.end_year >= ${r0_start_year} OR r0.end_year IS NULL)",
      "return_pattern_id": "n_name_special",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "d5e4edaf-25df-454c-9893-ab6be102c4f9",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Rattus andamanensis'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of species that feed on the parent of Rattus andamanensis?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "d13ff711-1126-4eca-97a1-1b9ad48bbd68",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: '2011 Al Hillah bombing'}) WITH DISTINCT n RETURN n.number_of_injuries",
    "nl_question": "How many people were injured in the 2011 Al Hillah bombing?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "7db51636-0395-4d1b-b2b2-0af64f0beeb2",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'shrubland'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that feed on species living in shrubland habitats?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "a3202d0d-a297-46da-a065-0c183689fd4f",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting)-[r1:createdBy]->(m1:Person {name: 'Albrecht Altdorfer'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of art movements linked to paintings by Albrecht Altdorfer, and how many of his paintings are associated with each movement?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "474c6f6e-0b4b-4ec3-8bdf-53724c893fdf",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person {name: 'Filippo Lauri'}), (m0:Person {name: 'Diego Velázquez'}) RETURN CASE WHEN n.date_of_birth > m0.date_of_birth THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Who was born later, Filippo Lauri or Diego Velázquez?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "4e1a6adf-7023-4f24-8125-d634a947bcbc",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Egyptian tomb bat'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of species that feed on the same prey as the Egyptian tomb bat?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "0a2f882d-bfdf-4d96-a183-84d808f00055",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement)<-[r1:associatedWith]-(m1:Painting {name: 'Ecce Homo'}) WITH DISTINCT n RETURN DISTINCT n.country_of_origin",
    "nl_question": "Which countries are the origin of paintings linked to the same art movement as Ecce Homo?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "c5a4676d-a6e7-4a3c-bcb7-8cbb85749597",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack)-[r1:targets]->(m1:Target {name: 'Uffizi Gallery'}) WITH DISTINCT n RETURN DISTINCT n.gender",
    "nl_question": "What are the unique genders of terrorists involved in attacks targeting the Uffizi Gallery?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "4175f689-5111-407a-aa84-5ddb00f9f1c3",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Siricoidea'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that feed on species whose parent is Siricoidea?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "9b9bc9cc-f8c1-4e21-9701-a72913b7c2de",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Nezara'}) RETURN n, m0 as m UNION MATCH (n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'tomato'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that either have Nezara as a parent or feed on tomatoes?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "86d1e700-70e1-4576-bef8-543715b314cb",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'academic art'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the artists who created paintings associated with the academic art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "8682f1dd-2c52-4607-9e07-1680e18b96bd",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack {name: 'Attack of the 27 April 2020 in Colombes'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "Who are the terrorists involved in the Attack of April 27, 2020, in Colombes, and where were they born?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "9c3088fe-c171-4b73-b5c1-8325e67c9a77",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:League)<-[r0:partOfLeague]-(m0:Club)<-[r1:playsFor]-(m1:Player {name: 'Carlo Benelli'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of leagues that include clubs Carlo Benelli has played for, and how many such clubs are in each league?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "b36539d7-4339-4cbc-b12a-ce339901acf9",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'The Rio della Salute, 1908'}),(n:Person)<-[r1:createdBy]-(m1:Painting {name: 'Self-portrait in Beret'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "Who are the artists who created both The Rio della Salute, 1908 and Self-portrait in Beret, and what are their genders?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "5b8399b4-dae3-44d6-b265-bfa9755aefcb",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Award)<-[r0:receivesAward]-(m0:Player {name: 'Luís Figo'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the awards received by Luís Figo?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  }
]
