[
  {
    "qid": "1376736a-325b-497d-97f8-9a1e54ae022e",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r1:createdBy]->(m1:Person {name: 'Adam Elsheimer'}) OPTIONAL MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of paintings created by Adam Elsheimer, and how many art movements is each associated with?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "65ccb03c-7897-4471-ace0-0348f82999f5",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'grenade launcher'}) OPTIONAL MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of terrorist attacks that used a grenade launcher, along with the count of different weapons employed in each attack.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "689b0210-c0a8-48e1-9668-660d8bb5e305",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting)-[r1:hasGenre]->(m1:Genre {name: 'mythological painting'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Who are the artists who have created mythological paintings, and how many such paintings has each artist created?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "52d335b3-5d27-4fbb-ac61-9a387ef2e3b6",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Putorius'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of taxa that are preyed upon by those that Putorius feeds on, and how many of these predators feed on each of them?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "2affaa5c-7cdb-439a-a7e5-1590f440af67",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: 'Bombing of Cinema Capri'}), (m0:TerroristAttack {name: '2012 Brindisi school bombing'}) RETURN n.number_of_injuries = m0.number_of_injuries AS answer",
    "nl_question": "Do the Bombing of Cinema Capri and the 2012 Brindisi school bombing result in the same number of injuries?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "305eae5e-2955-47f7-90b1-130bf5abe96a",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Target)<-[r0:targets]-(m0:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'firearm'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many targets are there for terrorist attacks that use firearms?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "4444519d-b79c-46fa-818e-06fbf8cc722e",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Target)<-[r0:targets]-(m0:TerroristAttack {name: 'missile attack on Vinnytsia'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the targets of the missile attack on Vinnytsia?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "94d565a8-798c-4ad4-a919-e727f9c364a8",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Maxillopoda'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that feed on organisms whose parent is Maxillopoda?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "aae9142c-242d-42c8-9289-78586bc6d954",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r1:createdBy]->(m1:Person {name: 'Alexandre Cabanel'}) OPTIONAL MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "List the names of all paintings created by Alexandre Cabanel, along with the number of genres associated with each painting.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "1af09727-1df5-4e52-a271-4b2fbeede354",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'United States of America'}) WITH DISTINCT n RETURN n.name ORDER BY n.date ASC",
    "nl_question": "What are the names of terrorist attacks that took place in the United States of America, listed from the earliest to the latest date?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "d5b5c624-a0dc-4aa0-98e5-734d8752f05c",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasConservationStatus]->(m0:ConservationStatus {name: 'Least Concern'}) WITH DISTINCT n RETURN max(n.avg_gestation_period_days)",
    "nl_question": "What is the longest average gestation period, in days, among taxa with a conservation status of Least Concern?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "2223651a-8312-443a-a514-f40706b77a02",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'Venetian school'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of genres for paintings linked to the Venetian school, and how many such paintings are there for each genre?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "1f6a19c2-7940-4345-8cad-ab7b8843458f",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Weapon)<-[r0:employs]-(m0:TerroristAttack {name: '2009 Beledweyne bombing'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of weapons used in the 2009 Beledweyne bombing?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "283692c0-1bf3-47b7-8190-f21e19560430",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture {name: 'The Age of Bronze'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of art movements associated with the sculpture The Age of Bronze?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "6569c54b-bf88-4e38-b2a9-05e9c6434a6c",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target {name: 'Tokyo subway'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:perpetratedBy]->(m1:Terrorist {name: 'Kiyotaka Tonozaki'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many terrorist attacks either targeted the Tokyo subway or were carried out by Kiyotaka Tonozaki?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "f5c77dcb-023c-44da-9da7-73f6567171d7",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'mannerism'}),(n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Cleveland Museum of Art'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year ASC",
    "nl_question": "What are the names of paintings linked to the Mannerism art movement and exhibited at the Cleveland Museum of Art, sorted by their year of creation from oldest to newest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "c8fdccbf-4d82-49f7-b45f-fa2f43195d06",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'National Gallery'}),(n:Painting)-[r1:hasGenre]->(m1:Genre {name: 'inverted still-life'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings that are showcased at the National Gallery and belong to the inverted still-life genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "847e8b50-4a19-497a-ad88-e0ed2cd59fd7",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'marine art'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings that belong to the marine art genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "3f47f5b4-2696-473c-87a5-66c239b84d55",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club)<-[r1:playsFor]-(m1:Player {name: 'Italo Acconcia'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Identify the players who have been part of the same clubs as Italo Acconcia at any time, and specify how many of those clubs each player has been associated with.",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "646503cc-56b2-4f6d-acac-a8364b93f791",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Théodore Rousseau'}) WITH DISTINCT n WHERE n.creation_year > 1852 RETURN n.name",
    "nl_question": "What are the names of paintings created by Théodore Rousseau after the year 1852?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "4f05a422-82f1-49d0-bc1a-841aa0bad128",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'infraorder'}) WITH DISTINCT n RETURN DISTINCT n.diel_cycle",
    "nl_question": "What are the unique diel cycles of taxa that consume taxa ranked as infraorder?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "7c3eacd7-3933-473c-9683-188dbe9d7851",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:Country)<-[r0:occursIn]-(m0:TerroristAttack {name: '1989 Tel Aviv murders'}) RETURN n, m0 as m UNION MATCH (n:Country)<-[r1:occursIn]-(m1:TerroristAttack {name: 'Stage Club bombing'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many countries were involved in either the 1989 Tel Aviv murders or the Stage Club bombing?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "e48f0f22-7f0c-4842-8bd8-9d8d8f165577",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Quercus minima'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of the parents of taxa that feed on Quercus minima?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "497e2a40-2f1b-4112-aa08-71ab7cc4a1c4",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'highway art'}) WITH DISTINCT n RETURN DISTINCT n.country_of_origin",
    "nl_question": "Which countries are the origin of sculptures that belong to the highway art genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "c98fd93c-0ed7-496f-ae73-bf6baf206d7e",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'High Renaissance'}),(n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Museo del Prado'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC",
    "nl_question": "What are the names of paintings linked to the High Renaissance and exhibited at the Museo del Prado, sorted from the newest to the oldest by their year of creation?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "93616d68-3992-45eb-a134-b2aa43afeb31",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: '2021 Kandahar bombing'}) WITH DISTINCT n RETURN n.number_of_deaths",
    "nl_question": "How many people died in the 2021 Kandahar bombing?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "206923bf-4b44-4a44-a393-5597d44d7821",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person {name: 'Grada Hermina Marius'}) WITH DISTINCT n RETURN n.place_of_birth",
    "nl_question": "Where was Grada Hermina Marius born?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "7035afe6-1488-451c-9a1e-247e4ab136a8",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:League)<-[r0:partOfLeague]-(m0:Club)-[r1:hasHomeVenue]->(m1:Venue {name: 'Neo Química Arena'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of leagues that include clubs which have used Neo Química Arena as their home venue, and how many such clubs are there in each league?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "d0e3ed36-6192-4700-932f-a3777658af9b",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Isopoda'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of taxa that consume other taxa which feed on Isopoda, and how many such taxa do they consume?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "6afc575f-a009-4091-a830-d51370de4c3a",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Homoptera'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of taxa that prey on organisms which themselves feed on Homoptera?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "fdf24165-66ee-429f-923f-6863f2e83f4e",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r1:playsFor]-(m1:Player {name: 'Giancarlo Danova'}) OPTIONAL MATCH (n:Club)-[r0:hasHomeVenue]->(m0:Venue) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of all clubs Giancarlo Danova has played for, along with the number of venues each club has had as a home venue?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)<-[r1]-(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "970063f9-72cf-4e9a-aa11-b843cca23215",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'subcohort'}) WITH DISTINCT n RETURN n.name ORDER BY n.longest_lifespan_years DESC",
    "nl_question": "What are the names of taxa with the rank of subcohort, sorted by their longest lifespan in descending order?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "b0a3c4d4-5090-4e63-b669-3163d2bce6fe",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Position)<-[r0:playsPosition]-(m0:Player)-[r1:receivesAward]->(m1:Award {name: 'Ballon d\\'Or'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the positions played by players who have received the Ballon d'Or award?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "46370df3-3e56-4d9d-9c43-3cc14cf4ef90",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'Museo del Prado'}),(n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'Baroque painting'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings that are exhibited at the Museo del Prado and are associated with the Baroque painting movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "83e2214c-5473-40bc-806c-128ce74dd62e",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'mannerism'}) WITH DISTINCT n WHERE n.creation_year < 1578 RETURN n.name",
    "nl_question": "What are the names of paintings linked to the Mannerism art movement that were created before the year 1578?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "8240054c-2be7-49e3-8126-b95927de6c61",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Félix-Joseph Barrias'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of paintings made by Félix-Joseph Barrias?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "a5853c5a-4403-47c0-92a3-7d52a7bc4240",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement)<-[r1:associatedWith]-(m1:Painting {name: 'Madonna with the Long Neck'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of paintings linked to the same art movements as Madonna with the Long Neck, and how many of those art movements are they associated with?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "f79d1722-f74e-4207-ab07-114a267548bc",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target {name: 'Dizengoff Center'}) WITH DISTINCT n RETURN n.name, n.date",
    "nl_question": "What are the names and dates of terrorist attacks that targeted Dizengoff Center?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "37a69f18-a39e-48e6-84e7-5a5a2f4e3323",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'machine gun'}),(n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'pistol'}) WITH DISTINCT n RETURN n.name, n.number_of_injuries",
    "nl_question": "What are the names and injury counts of terrorist attacks that used both a machine gun and a pistol?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "13ddb8e2-dee8-4df1-bacb-310005711392",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'Impressionism'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:hasGenre]->(m1:Genre {name: 'figure painting'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many paintings are either associated with Impressionism or belong to the figure painting genre?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "0b0580e5-eed8-4aaa-833b-86b89181628c",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'tomb of Pierre-Théodore Verhaegen'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many sculptures were created by the same person who made the tomb of Pierre-Théodore Verhaegen?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "d4fd9f2b-46b3-4d65-b422-6359bdf686b6",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Pierino Prati'}) RETURN n, m0 as m UNION MATCH (n:Club)<-[r1:playsFor]-(m1:Player {name: 'Vittorio Staccione'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of clubs that Pierino Prati or Vittorio Staccione have played for at any time?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "e218582a-91bc-43b1-bf26-b652be613740",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Painting)-[r1:hasGenre]->(m1:Genre {name: 'floral painting'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many museums have displayed paintings in the floral painting genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "1885f0f8-ff88-4866-9145-0dff28ec02b2",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target {name: 'Adolfo Suarez Madrid-Barajas Airport'}) WITH DISTINCT n RETURN n.name ORDER BY n.number_of_injuries ASC LIMIT 1",
    "nl_question": "What is the name of the terrorist attack targeting Adolfo Suarez Madrid-Barajas Airport that resulted in the fewest injuries?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "5ca2bc26-cc08-4287-b85e-ed68ad78cef6",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'portrait'}),(n:Painting)-[r1:createdBy]->(m1:Person {name: 'Rodolfo Amoedo'}) WITH DISTINCT n RETURN count(DISTINCT n.country_of_origin)",
    "nl_question": "How many different countries of origin are there for portraits painted by Rodolfo Amoedo?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "70b2dfda-88c4-4317-8aae-00c50f4f4e6e",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Saguinini'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa that are descendants of taxa which have Saguinini as an ancestor?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "e1b6ffcf-cb39-497e-982f-9edf01596f46",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Jonathan Morsay'}), (m0:Player {name: 'Roberto Carlos'}) RETURN CASE WHEN n.mass_kg > m0.mass_kg THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Who weighs more, Jonathan Morsay or Roberto Carlos?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "4c8c2239-a9bf-4c7d-b0ed-757938a46f30",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:perpetratedBy]->(m0:Terrorist {name: 'Tomomitsu Niimi'}),(n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Japan'}) WITH DISTINCT n RETURN n.name, n.locations",
    "nl_question": "What are the names and locations of terrorist attacks carried out by Tomomitsu Niimi in Japan?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  }
]
