[
  {
    "qid": "6f9206a9-1ed3-45cb-b8af-6b789a77d55c",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Joseph Chinard'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many different genres are associated with sculptures created by Joseph Chinard?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "361228f7-0903-4034-87e4-2a0fbae4ceb9",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre)<-[r1:hasGenre]-(m1:Painting {name: 'The Blue Boat'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of sculptures that share a genre with the painting The Blue Boat, and how many of these genres do they have in common?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "389253a8-27e5-4951-ac3c-46cf0397576b",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon {name: 'Balaenoptera musculus'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxonomic names of the species that are preyed upon by Balaenoptera musculus?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "b16de457-1532-416e-bf44-6990f6b15410",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Country)<-[r0:occursIn]-(m0:TerroristAttack)-[r1:targets]->(m1:Target {name: 'Danube Ship Repair'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Which countries have experienced terrorist attacks targeting Danube Ship Repair?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "4785018f-7762-4dac-a11f-e2e5bcacd2cc",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: 'Serie D'}),(n:Club)<-[r1:playsFor]-(m1:Player {name: 'Romeo Benetti'}) WITH DISTINCT n RETURN n.name ORDER BY n.inception_year ASC",
    "nl_question": "What are the names of clubs that are part of Serie D and have had Romeo Benetti as a player at some point, listed from the earliest to the most recent inception year?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "85c4b14e-fff9-4f1d-8171-25c6b4d20052",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'neoclassicism'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Who are the artists who created sculptures associated with neoclassicism, and how many such sculptures did each artist create?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "9101c9b4-9753-4166-8d2b-bb7abce52956",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'portrait miniature'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year ASC",
    "nl_question": "What are the names of paintings in the portrait miniature genre, sorted by their creation year from the earliest to the latest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "a8c99ac0-c527-4248-84f8-e90381a7275f",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Accipitriformes'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of taxa that are preyed upon by species that Accipitriformes feed on, and how many such species prey on each of them?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "57327dbd-9c5c-402a-83d1-a09fea6c08bc",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:perpetratedBy]->(m0:Terrorist {name: 'Giuseppe Graviano'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'car bomb'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks carried out by Giuseppe Graviano or involving a car bomb?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "959d0cf7-bea8-48d8-85d5-44069e011513",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon {name: 'Southern Cassowary'}) RETURN n, m0 as m UNION MATCH (n:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Sirenia'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that are either preyed upon by the Southern Cassowary or are the parents of Sirenia?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "6864cdfe-ef17-4d30-9243-4289bb251f43",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'portrait'}),(n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'High Renaissance'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC LIMIT 1",
    "nl_question": "What is the name of the most recently created portrait painting associated with the High Renaissance art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "eab98e92-0ff3-46f5-93a1-b56f134fab96",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'animal sculpture'}) WITH DISTINCT n RETURN DISTINCT n.gender",
    "nl_question": "What are the unique genders of individuals who created sculptures in the genre of animal sculpture?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "d73d2310-265d-4168-b54d-17c09b6b4810",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'class'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of taxa that have a parent with the rank of class, and how many such class-ranked taxa have them as a parent?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "fd85983c-b244-4c33-90db-1845c1be9c23",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Painting)-[r1:createdBy]->(m1:Person {name: 'Alexander Cooper'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many museums have displayed paintings created by Alexander Cooper?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "bad1fa4b-82cc-4061-8ff2-df86ea9aeec4",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'grenade launcher'}) WITH DISTINCT n RETURN n.name ORDER BY n.number_of_deaths ASC",
    "nl_question": "What are the names of terrorist attacks that used a grenade launcher, sorted by the number of deaths from the fewest to the most?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "f61c282f-e368-4913-9370-250ebd9f6de1",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon {name: 'Erinnyis ello'}) RETURN n, m0 as m UNION MATCH (n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Tetranychus tumidus'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many taxa are fed on by either Erinnyis ello or Tetranychus tumidus?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "583e53d4-0a2c-4dd9-be20-4efa9de2b087",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Birkirkara F.C.'}),(n:Player)-[r1:playsPosition]->(m1:Position {name: 'midfielder'}) WITH DISTINCT n RETURN n.name, n.mass_kg",
    "nl_question": "What are the names and weights in kilograms of players who have played as midfielders for Birkirkara F.C. at some point?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "3b85f818-bd21-45e6-ad54-344f857aa778",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Celtic +~~~'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "Who are the creators of the sculpture Celtic +~~~ and where were they born?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "9f802703-19ce-43ef-ab94-6caa05556bd1",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'Monument aux morts d\\'Auchel'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures created by the same person who made the Monument aux morts d'Auchel?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "c339cd0b-cab7-4546-9980-bfb073edaeb7",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'bullet'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'pistol'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many terrorist attacks involved either bullets or pistols?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "dbc06b6b-0dd0-4b7d-ba64-c03385650585",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Patrizio Sala'}) WITH DISTINCT n RETURN n.date_of_birth",
    "nl_question": "When was Patrizio Sala born?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "c968230a-b2e6-472c-b579-676c00d8cdd5",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:hasHomeVenue]->(m0:Venue {name: 'via Pola field'}) WITH DISTINCT n RETURN n.name, n.inception_year",
    "nl_question": "What are the names and founding years of clubs that have ever used via Pola field as their home venue?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "94ab7546-9002-4e97-9a97-cb416fdb848d",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'Impressionism'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many sculptures are linked to the Impressionism art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "c28ae04e-4b08-438f-9b7d-59b0daa0b96f",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:League)<-[r0:partOfLeague]-(m0:Club)<-[r1:playsFor]-(m1:Player {name: 'Leandro Amaral'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the leagues that include a club where Leandro Amaral has played?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "213e3e9b-0695-4529-8e74-3416cb0795fd",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Leonardo da Vinci'}),(n:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'Victoria and Albert Museum'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures created by Leonardo da Vinci and displayed at the Victoria and Albert Museum?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "8b980015-2c0e-4d87-b255-91ff9a59c501",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:ConservationStatus)<-[r0:hasConservationStatus]-(m0:Taxon {name: 'Greater short-nosed fruit bat'}) RETURN n, m0 as m UNION MATCH (n:ConservationStatus)<-[r1:hasConservationStatus]-(m1:Taxon {name: 'Petaurista philippensis'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the conservation statuses of either the Greater short-nosed fruit bat or Petaurista philippensis?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "161b1359-e0ec-45f5-bc30-1331cdab0ca4",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Luigi Muraro'}), (m0:Player {name: 'Hoda Lattaf'}) RETURN CASE WHEN n.height_cm > m0.height_cm THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Who is taller, Luigi Muraro or Hoda Lattaf?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "d5781582-93a1-4f06-a6c9-2ad9e295eeb0",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: 'Championnat National'}) WITH DISTINCT n WHERE n.head_coach = 'Laurent Bénier' RETURN n.name",
    "nl_question": "What are the names of clubs in the Championnat National league that have Laurent Bénier as their head coach?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "8a950353-36ae-40e1-8ded-10cc0e24d2df",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Untitled V'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "Who are the individuals who created the sculpture Untitled V, and what are their genders?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "af626243-21bf-4fe9-9314-11b87b626a63",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Laranda Walker, 1869'}),(n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'forest'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans in years of taxa that have Laranda Walker, 1869 as a parent and live in forests?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "cabc4abc-4d6d-4304-a253-1732533d444e",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'bomb'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:targets]->(m1:Target {name: 'Corpus Christi solemnity in Barcelona'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many terrorist attacks either used a bomb or targeted the Corpus Christi solemnity in Barcelona?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "5cb28c03-a88b-4de8-a306-55ac6e339a5e",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'Sus scrofa'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'water buffalo'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods (in days) of taxa that feed on both Sus scrofa and water buffalo?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "2ee61b0d-edd9-4a6e-9f83-dacf2ee3afad",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Claude Monet'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:hasGenre]->(m1:Genre {name: 'genre art'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many paintings were either created by Claude Monet or belong to the genre art category?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "d58ad40e-10b1-4ad1-b492-a915613326cb",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club {name: 'Sport Coopsol'}) WITH DISTINCT n RETURN n.country",
    "nl_question": "Which country is Sport Coopsol from?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "94cf527c-d271-4075-9457-680356eb1e40",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'High Renaissance'}),(n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Museo del Prado'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of paintings linked to the High Renaissance and exhibited at the Museo del Prado?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "7371ef17-6a76-4eb8-a4bc-77b065fa41d4",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Position)<-[r0:playsPosition]-(m0:Player)-[r1:playsFor]->(m1:Club {name: 'SK Slavia Prague'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of positions played by players who have been part of SK Slavia Prague, and how many such players have played each position?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "50502978-635e-4e73-b068-2fbfb7385ad9",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Weapon)<-[r0:employs]-(m0:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Germany'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many different weapons are used in terrorist attacks that take place in Germany?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "b8cccc12-81f1-4202-a8b6-b84cbc4dbbc5",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: 'HaSharon Mall suicide bombing'}), (m0:TerroristAttack {name: '2019 Kabul mosque bombing'}) RETURN n.number_of_injuries - m0.number_of_injuries AS answer",
    "nl_question": "How many more injuries were there in the HaSharon Mall suicide bombing compared to the 2019 Kabul mosque bombing?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  },
  {
    "qid": "fedee56e-2e12-4474-88ee-d5e0d4a8560b",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Homoptera'}) WITH DISTINCT n RETURN n.name ORDER BY n.longest_lifespan_years ASC",
    "nl_question": "What are the names of taxa that are preyed upon by species that feed on Homoptera, sorted by their longest lifespan from shortest to longest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "b7b35a8b-c3a0-49c3-86d0-65695915d393",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'A.S.D. Civitavecchia 1920'}) WITH DISTINCT n RETURN n.name, n.date_of_death",
    "nl_question": "What are the names and dates of death of players who have been part of A.S.D. Civitavecchia 1920 at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "bd08f276-abf8-42ea-b1e3-b4633b99568f",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'Los Angeles County Museum of Art'}) WITH DISTINCT n RETURN n.name, n.date_of_birth",
    "nl_question": "Who are the artists who created sculptures displayed at the Los Angeles County Museum of Art, and what are their birth dates?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "0b8ef3f7-ceee-44b0-a189-06e240106b4b",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'academic art'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of museums that exhibit paintings linked to the academic art movement, and how many such paintings does each museum display?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "8c3e7ba3-6cff-4e77-a14b-1f2a6f691db6",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Painting)-[r1:createdBy]->(m1:Person {name: 'Vincenzo Campi'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many distinct genres are associated with paintings created by Vincenzo Campi?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "af13b572-09b3-48a3-af56-7c5f60c158c7",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'Calopteryx'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of species that feed on Calopteryx?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "f70e0d7f-aa53-48ce-9fb0-80d1bff012b3",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club {name: 'Eskişehirspor'}), (m0:Club {name: 'Moreirense F.C.'}) RETURN CASE WHEN n.inception_year > m0.inception_year THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Which club was founded more recently, Eskişehirspor or Moreirense F.C.?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "be2c4191-4456-48d2-8b5d-c2f7bf5dcb4b",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'full-back'}) WITH DISTINCT n RETURN DISTINCT n.gender",
    "nl_question": "What are the unique genders of players who play as full-backs?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "5f4d95e6-4962-4b7e-9f4d-02799c2526f4",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Oryctolagus'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods of taxa that prey on species which, in turn, feed on Oryctolagus?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  }
]
