[
  {
    "qid": "a32a6683-4543-4065-88f4-b942dd371092",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting)-[r1:hasGenre]->(m1:Genre {name: 'mythological painting'}) WITH DISTINCT n RETURN n.name ORDER BY n.end_year DESC LIMIT 1",
    "nl_question": "Which art movement, associated with paintings in the mythological genre, ended most recently?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "fece24c9-20f2-47e2-95f0-33f1d600001b",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'centre-back'}) RETURN n, m0 as m UNION MATCH (n:Player)-[r1:receivesAward]->(m1:Award {name: 'Ballon d\\'Or'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many players either play as a centre-back or have received the Ballon d'Or?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "b5662584-9370-4917-b152-2ea7349da87b",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'rocket-propelled grenade'}) OPTIONAL MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of terrorist attacks that used a rocket-propelled grenade, and how many different types of weapons were employed in each of those attacks?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "b122ae13-d8ea-47bc-8248-bc0fa1bd157d",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'allegory'}),(n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'nude'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures that are both allegorical and nude?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "16dee2aa-63f3-4464-b325-ec090081757b",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Golden Foot'}) WITH DISTINCT n RETURN count(DISTINCT n.footedness)",
    "nl_question": "How many different types of footedness do players who have received the Golden Foot award have?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "b83ad571-d133-44e9-a4aa-611e9715bd8a",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Torso of a Young Woman'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "Who are the creators of the sculpture Torso of a Young Woman, and where were they born?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "a48bc190-2b15-4bb2-adf5-4a92035e75c6",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Least Concern'}) WITH DISTINCT n RETURN count(DISTINCT n.diel_cycle)",
    "nl_question": "How many different diel cycles are there for taxa that feed on species with a conservation status of Least Concern?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "c0b9988c-747c-4a5b-8b01-01fa7b4069dd",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target {name: 'Minsk Metro'}) WITH DISTINCT n RETURN n.name, n.locations",
    "nl_question": "What are the names and locations of terrorist attacks that targeted the Minsk Metro?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "a4d9e15c-d1bf-437b-b5aa-317c9a1a24e1",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement {name: 'High Renaissance'}), (m0:ArtMovement {name: 'Realism'}) RETURN n.start_year - m0.start_year AS answer",
    "nl_question": "What is the difference in start year between the High Renaissance and Realism art movements?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  },
  {
    "qid": "6e4bb3bd-0afe-4611-a19a-501816ee0714",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'equestrian portrait'}),(n:Painting)-[r1:hasGenre]->(m1:Genre {name: 'genre art'}) WITH DISTINCT n RETURN min(n.creation_year)",
    "nl_question": "What is the earliest creation year of paintings that are both equestrian portraits and genre art?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "5552c445-401e-41a9-ad18-4877eb54a94d",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Petworth House'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Who are the artists who have created paintings displayed at Petworth House, and how many of their paintings are exhibited there?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "23d30c6c-ee44-4d48-91bb-11267f1dcbda",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'American Impressionism'}),(n:Painting)-[r1:createdBy]->(m1:Person {name: 'Théodore Rousseau'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of paintings linked to American Impressionism and created by Théodore Rousseau?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "8705a91c-a868-4eb5-b823-77f615608a35",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: 'Uruguayan Primera División'}),(n:Club)-[r1:hasHomeVenue]->(m1:Venue {name: 'Estadio Viera'}) WITH DISTINCT n RETURN n.name, n.inception_year",
    "nl_question": "What are the names and founding years of clubs that are part of the Uruguayan Primera División and have played at Estadio Viera at some point?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "2dddbd00-715e-4b27-9dc3-530b9adf33dd",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'State of Palestine'}) OPTIONAL MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of terrorist attacks that took place in the State of Palestine, and how many different weapons were used in each?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "ae182f15-8801-40e2-b23b-d68f1a0fef61",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'Vorarlberg museum'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:createdBy]->(m1:Person {name: 'Angelica Kauffmann'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many paintings are either displayed at the Vorarlberg museum or created by Angelica Kauffmann?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "0e6a1238-344e-4d97-8746-28fade74cf19",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'order'}) RETURN n, m0 as m UNION MATCH (n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Egyptian tomb bat'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many taxa are either classified as an order or are preyed upon by the Egyptian tomb bat?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "62157045-f7a1-48e6-8676-f891536a3601",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'mannerism'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC LIMIT 1",
    "nl_question": "What is the name of the most recently created sculpture associated with the Mannerism art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "7ac11732-daa3-48e5-b198-66d8a7097321",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'Buffalo AKG Art Museum'}) WITH DISTINCT n RETURN n.name, n.date_of_birth",
    "nl_question": "Who are the artists whose sculptures are displayed at the Buffalo AKG Art Museum, and what are their birthdates?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "fc7378c2-ff6b-48f2-8dfb-1857310a50ad",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'bird'}) OPTIONAL MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of all taxa that feed on birds, and how many taxa consider each of them as a parent?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)<-[r0]-(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "966a38c6-a2e2-40d4-b247-3197c499ffc5",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Stade Rennais F.C.'}),(n:Player)-[r1:playsPosition]->(m1:Position {name: 'defensive midfielder'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of players who have played as defensive midfielders for Stade Rennais F.C. at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "ce016c3d-1964-4d4d-bfa9-03e7437cc1f0",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target {name: 'Cinnamon Grand Colombo'}) WITH DISTINCT n RETURN n.name, n.date",
    "nl_question": "What are the names and dates of terrorist attacks that targeted Cinnamon Grand Colombo?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "0ea9142c-fc72-4fa3-ac8d-625f76465f0b",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'interior view'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings that belong to the interior view genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "0fc78e54-8897-4caa-9ab1-4da11726551f",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'David Hellebuyck'}) WITH DISTINCT n RETURN n.place_of_birth",
    "nl_question": "Where was David Hellebuyck born?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "24c6a721-3e9b-4eff-a826-49d90b206abe",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'High Renaissance'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:createdBy]->(m1:Person {name: 'Leonardo da Vinci'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many paintings are either linked to the High Renaissance art movement or created by Leonardo da Vinci?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "45532f11-c806-46e9-9101-25661f26982b",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Lommel SK'}) WHERE r0.start_year IS NOT NULL AND r0.end_year IS NULL WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the players currently playing for Lommel SK?",
    "from_template": {
      "match_category": "special_time-sensitive",
      "match_cypher": "MATCH (n)-[r0<start_year,end_year^>]->(m0<name>) WHERE r0.start_year IS NOT NULL AND r0.end_year IS NULL",
      "return_pattern_id": "n_name_special",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "1b617b65-8f1a-4017-a08c-98fc019004b9",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack)-[r1:targets]->(m1:Target {name: 'Tokyo subway'}) WITH DISTINCT n RETURN n.name ORDER BY n.date_of_birth ASC",
    "nl_question": "Who are the terrorists involved in attacks targeting the Tokyo subway, listed by their birth dates from the earliest to the latest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "87796efe-c37e-4463-884f-77e1924dcb58",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target {name: 'Taj Mahal Palace Hotel'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:targets]->(m1:Target {name: 'Leopold Cafe'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many terrorist attacks targeted either the Taj Mahal Palace Hotel or the Leopold Cafe?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "47d6a1c2-e274-4bad-bf88-cda271bbbcf7",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: '2010 Kizlyar bombings'}), (m0:TerroristAttack {name: '1992 London Bridge bombing'}) RETURN n.number_of_injuries - m0.number_of_injuries AS answer",
    "nl_question": "How many more injuries were there in the 2010 Kizlyar bombings compared to the 1992 London Bridge bombing?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  },
  {
    "qid": "286c85e1-792a-4044-9ce2-2665d52a6884",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Cabbage looper'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans of the parents of taxa that are preyed upon by the Cabbage looper?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "0a0676dd-40ca-4d6a-8b8a-308a3eb21019",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'Cubism'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many genres are there for paintings associated with the Cubism art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "3e803ce3-244f-4cdb-845c-cb24bd66494c",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'Solomon R. Guggenheim Museum'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many paintings are on display at the Solomon R. Guggenheim Museum?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "b6913f70-4af4-4423-9d46-5faa989c58aa",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'analytical cubism'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of paintings linked to the analytical cubism art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "5d576f19-698a-4a32-96f2-ac650ab66ef9",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'division'}) WITH DISTINCT n WHERE n.taxon_name = 'Magnoliophyta' RETURN n.name",
    "nl_question": "What are the names of taxa with the rank of division and the taxon name Magnoliophyta?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "d2448204-7270-46e5-a4db-dcc5a7c1d88c",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'Baroque'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:createdBy]->(m1:Person {name: 'Paolo Veronese'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many paintings are either linked to the Baroque art movement or created by Paolo Veronese?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "b66a40fe-3720-40d9-8f6d-e76934cded5c",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'Palazzo Regale'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many sculptures were created by the same person who made Palazzo Regale?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "dde507af-b0e3-49c4-9c11-1c49f12ba8cd",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player)-[r1:playsFor]->(m1:Club {name: 'Southport F.C.'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of clubs that have players who have also played for Southport F.C., and how many such players are there for each club?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "046ca9ad-5e1c-46d9-a732-99dcf28458f3",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Genre)<-[r0:hasGenre]-(m0:Painting {name: 'Apparition of the Virgin to Saint Lawrence'}) RETURN n, m0 as m UNION MATCH (n:Genre)<-[r1:hasGenre]-(m1:Painting {name: 'Saint Bartholomew (Pseudo St. Paul)'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many distinct genres are associated with either the painting \"Apparition of the Virgin to Saint Lawrence\" or \"Saint Bartholomew (Pseudo St. Paul)\"?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "40740286-3f4f-4866-af8d-be7096cf93c8",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Sculpture {name: 'The Three Graces'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the genres associated with the sculpture The Three Graces?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "5e19eeb2-3c7f-4659-95a8-af17b9fbb19b",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'wing half'}),(n:Player)-[r1:playsFor]->(m1:Club {name: 'Sporting CP B'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "What are the names and birthplaces of players who have played as a wing half and have been part of Sporting CP B at some time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "0400ebf0-b715-4edd-a8ee-a5fb2e111419",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting)-[r1:createdBy]->(m1:Person {name: 'Hugo van der Goes'}) WITH DISTINCT n RETURN n.name, n.end_year",
    "nl_question": "What are the names and end years of art movements linked to paintings created by Hugo van der Goes?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "0b10bda3-e17c-4e2a-b8b2-328a9688aead",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person {name: 'Grada Hermina Marius'}) WITH DISTINCT n RETURN n.date_of_birth",
    "nl_question": "When was Grada Hermina Marius born?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "06c4afde-7f62-496a-8b95-95dbc8e30c35",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon {name: 'Mugimaki Flycatcher'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans of the taxa that the Mugimaki Flycatcher preys on?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "3e382a74-1d71-4156-a7b5-8e855df172bb",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'superphylum'}) WITH DISTINCT n RETURN count(DISTINCT n.diel_cycle)",
    "nl_question": "How many distinct diel cycles are there for taxa classified under the superphylum rank?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "ee1c502b-f88a-4278-b8aa-99d1440bbf3f",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Andrea Rocchigiani'}) WITH DISTINCT n RETURN n.mass_kg",
    "nl_question": "What is Andrea Rocchigiani's weight in kilograms?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "96146578-3959-43a0-a0aa-bdcc69c8d5ec",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Painting {name: 'A Landscape in the Auvergne'}),(n:Genre)<-[r1:hasGenre]-(m1:Painting {name: 'The Japanese Footbridge'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the genres shared by both the paintings A Landscape in the Auvergne and The Japanese Footbridge?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "5a2040b5-59f5-4dba-93c6-36562ef3ea68",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'Renaissance'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:hasGenre]->(m1:Genre {name: 'religious painting'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings linked to the Renaissance art movement or classified as religious paintings?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "1a6ef871-ace0-4bc5-8cb3-7eba77393024",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'machine gun'}),(n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'grenade launcher'}) WITH DISTINCT n RETURN n.name, n.number_of_deaths",
    "nl_question": "What are the names and death tolls of terrorist attacks that used both a machine gun and a grenade launcher?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "01a26d4b-d82c-40ec-b508-2403099e5a92",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person {name: 'Georges Lucien Guyot'}) WITH DISTINCT n RETURN n.date_of_birth",
    "nl_question": "When was Georges Lucien Guyot born?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  }
]
