[
  {
    "qid": "947a64fe-7fa4-4cff-b3a1-1ef4eaa5597d",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Odoacre Chierico'}), (m0:Player {name: 'Riccardo Taddei'}) RETURN CASE WHEN n.mass_kg > m0.mass_kg THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Who weighs more, Odoacre Chierico or Riccardo Taddei?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "d5b1b47f-37a1-43fc-aa7d-4b1afbd1635f",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'family'}) RETURN n, m0 as m UNION MATCH (n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Megaloprepus caerulatus'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many taxa are either ranked as a family or are preyed upon by Megaloprepus caerulatus?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "94a92ebc-9490-4e4e-b3f1-f103f05fd724",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Gold Medal of the Royal Order of Sports Merit'}),(n:Player)-[r1:playsPosition]->(m1:Position {name: 'midfielder'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the midfielders who have been awarded the Gold Medal of the Royal Order of Sports Merit?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "e6d903f4-3199-4bc8-83cc-e128d51bc426",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Osarimen Ebagua'}) WHERE r0.start_year <= 2008 AND (r0.end_year >= 2008 OR r0.end_year IS NULL) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of clubs that Osarimen Ebagua played for during the year 2008?",
    "from_template": {
      "match_category": "special_time-sensitive",
      "match_cypher": "MATCH (n)<-[r0<start_year,end_year?>]-(m0<name>) WHERE r0.start_year <= ${r0_start_year} AND (r0.end_year >= ${r0_start_year} OR r0.end_year IS NULL)",
      "return_pattern_id": "n_name_special",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "cc4c8b7e-05de-4666-9541-621b36cc1aab",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Attingham Park'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "Who are the artists whose paintings are displayed at Attingham Park, and what is their gender?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "76d2c618-b36b-4f9f-bd7b-6ac2907965ff",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting)-[r1:hasGenre]->(m1:Genre {name: 'nude'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of art movements linked to paintings in the nude genre, and how many such paintings are associated with each movement?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "b34a0fdd-0b3a-42d5-b528-fb554ea8fb81",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon {name: 'Balaenoptera musculus'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods, in days, of the taxa that are preyed upon by Balaenoptera musculus?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "5f6ef689-9eac-4b27-b2f5-a922f9025aa0",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'steppe'}) WITH DISTINCT n RETURN n.name ORDER BY n.longest_lifespan_years ASC LIMIT 1",
    "nl_question": "What is the name of the taxon living in the steppe that has the shortest maximum lifespan?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "f8be8e90-b9cf-4654-871c-a03081605ac0",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player)-[r1:receivesAward]->(m1:Award {name: 'Ballon d\\'Or'}) WITH DISTINCT n RETURN max(n.inception_year)",
    "nl_question": "What is the latest inception year among clubs that have had a player who received the Ballon d'Or?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "ded039a1-919b-4147-952a-9110dde674e4",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Target)<-[r0:targets]-(m0:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Burkina Faso'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of targets of terrorist attacks that took place in Burkina Faso?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "d0c2af20-25ad-4baf-9c5f-07528c8db30e",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'William Stearns'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of paintings created by William Stearns?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "219e3bfa-7bb7-4d18-81ae-ab565444d038",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r1:receivesAward]->(m1:Award {name: 'Master of Sport of the USSR, International Class'}) OPTIONAL MATCH (n:Player)-[r0:playsPosition]->(m0:Position) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of players who have received the Master of Sport of the USSR, International Class award, along with the number of positions they have played.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "805db22b-c1ec-4793-9adb-b8fa39844c53",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Mathieu Valbuena'}), (m0:Player {name: 'Ludovic Giuly'}) RETURN n.height_cm - m0.height_cm AS answer",
    "nl_question": "How much taller is Mathieu Valbuena compared to Ludovic Giuly in centimeters?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  },
  {
    "qid": "ad91e807-872a-49a5-923a-81445a4174a4",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Auguste Rodin'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of art movements linked to sculptures created by Auguste Rodin?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "d00ace7e-e41a-4b67-b200-ddaf91fa82e6",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Genre)<-[r0:hasGenre]-(m0:Painting {name: 'Portrait of a man, possibly Alonso de Herrera'}) RETURN n, m0 as m UNION MATCH (n:Genre)<-[r1:hasGenre]-(m1:Painting {name: 'Pascal-Jacques Taché'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many genres are associated with either the painting \"Portrait of a man, possibly Alonso de Herrera\" or \"Pascal-Jacques Taché\"?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "417a44e9-a5f8-454b-bed6-70654e8a05d4",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting)-[r1:displayedAt]->(m1:Museum {name: 'National Museum of Capodimonte'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of art movements linked to paintings exhibited at the National Museum of Capodimonte, and how many such paintings are associated with each movement?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "ac9105e7-cacd-4014-b589-602b73c84704",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Kenneth Zohore'}) WHERE r0.start_year <= 2010 AND (r0.end_year >= 2010 OR r0.end_year IS NULL) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of clubs Kenneth Zohore played for during the year 2010?",
    "from_template": {
      "match_category": "special_time-sensitive",
      "match_cypher": "MATCH (n)<-[r0<start_year,end_year?>]-(m0<name>) WHERE r0.start_year <= ${r0_start_year} AND (r0.end_year >= ${r0_start_year} OR r0.end_year IS NULL)",
      "return_pattern_id": "n_name_special",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "b0850326-7ccb-448c-9e60-ad0424a2d70f",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'The Best FIFA Men\\'s Player'}) WITH DISTINCT n RETURN n.name, n.height_cm",
    "nl_question": "What are the names and heights in centimeters of players who have received The Best FIFA Men's Player award?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "dc961052-5470-420d-994c-eab4aa76cdd5",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Joseph Chinard'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the genres of sculptures created by Joseph Chinard?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "fef9a217-e635-4a90-a301-a858c7dfeb55",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Bravo Award'}) WITH DISTINCT n RETURN count(DISTINCT n.gender)",
    "nl_question": "How many different genders are represented among players who have received the Bravo Award?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "cc945f4b-0d46-4e14-90c4-1c1b3913ef6f",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Pichichi Trophy'}),(n:Player)-[r1:playsPosition]->(m1:Position {name: 'forward'}) WITH DISTINCT n RETURN max(n.mass_kg)",
    "nl_question": "What is the maximum weight, in kilograms, of players who have won the Pichichi Trophy and play as forwards?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "d484ed7d-4afd-4aae-bf06-f5842a683c6c",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Cacophis squamulosus'}) WITH DISTINCT n RETURN count(DISTINCT n.diel_cycle)",
    "nl_question": "How many unique diel cycles are there for taxa that share a parent with Cacophis squamulosus?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "e319cdf4-cd30-4e72-94d7-3a7dd53a9dd3",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award)<-[r1:receivesAward]-(m1:Player {name: 'Salvatore Schillaci'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Who are the players who have received the same awards as Salvatore Schillaci, and how many of those awards has each player received?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "afb997d4-0948-4641-9fea-cb0e9ca8c4ce",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'grassland'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Asilidae'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxonomic names of taxa that live in grasslands and feed on Asilidae?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "24c4a9ba-ebd1-48a0-bf10-771ad43a9c6d",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon {name: 'mule deer'}), (m0:Taxon {name: 'Asian elephant'}) RETURN CASE WHEN n.longest_lifespan_years > m0.longest_lifespan_years THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Which has a longer lifespan: the mule deer or the Asian elephant?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "ec11e0eb-04c9-4818-ace7-689156da9713",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'group portrait'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC LIMIT 1",
    "nl_question": "What is the name of the most recently created painting in the genre of group portrait?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "67aa1801-1863-4c4b-a181-b8aec29ee898",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist {name: 'Amedy Coulibaly'}) WITH DISTINCT n RETURN n.place_of_birth",
    "nl_question": "Where was Amedy Coulibaly born?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "97d852d3-6725-435c-ad63-2e97d0cf0193",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'AS Monaco FC'}) WITH DISTINCT n RETURN n.name ORDER BY n.mass_kg DESC LIMIT 1",
    "nl_question": "Who is the heaviest player to have ever played for AS Monaco FC?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "9b907018-fce1-437b-baa7-f80dc6c2a802",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack)-[r1:perpetratedBy]->(m1:Terrorist {name: 'Bilal Abdullah'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "What are the names and birthplaces of terrorists involved in the same attack as Bilal Abdullah?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "3ec38b2b-e01f-42c1-8994-cc2dccdd7bb3",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'cave'}) OPTIONAL MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of all taxa that live in caves, along with the number of different habitats each one occupies.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "6b255433-c43a-44cd-93de-277681074fd8",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Princeton University Art Museum'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures displayed at the Princeton University Art Museum?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "1a3a0be7-82ba-47f3-b19c-028d39769f2b",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'Canada'}) WITH DISTINCT n RETURN n.name ORDER BY n.number_of_injuries DESC",
    "nl_question": "What are the names of terrorist attacks that took place in Canada, sorted by the number of injuries from highest to lowest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "ae5376f7-d297-465b-87cb-f38ab20c1962",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Untitled I'}),(n:Person)<-[r1:createdBy]-(m1:Painting {name: 'Sun and Pylon'}) WITH DISTINCT n RETURN n.name, n.date_of_death",
    "nl_question": "Who are the individuals who created both the sculpture Untitled I and the painting Sun and Pylon, and when did they pass away?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "0e97057f-9ce4-4647-b62c-9ee0e8b01a73",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r1:associatedWith]-(m1:Painting {name: 'Christ before Pilate'}) OPTIONAL MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of art movements associated with the painting Christ before Pilate, and how many sculptures are linked to each of them?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)<-[r1]-(m1<name>) OPTIONAL MATCH (n)<-[r0]-(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "34b59124-0b65-4fa9-af79-2d1f75d0bee4",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: '1. FC Kaiserslautern'}) WITH DISTINCT n RETURN n.name ORDER BY n.height_cm ASC LIMIT 1",
    "nl_question": "Who is the shortest player to have ever played for 1. FC Kaiserslautern?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "9f21eebb-efb6-40e1-b2f2-10733ea99f3f",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Arachnida'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many taxa have a parent that feeds on Arachnida?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "327653a4-292e-4c9e-9578-b8c1b3fb867b",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Oryctolagus'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that prey on species which, in turn, feed on Oryctolagus?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "92128d3e-4252-4fac-bf06-292be9670fbd",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Rodin Museum'}) WITH DISTINCT n RETURN count(DISTINCT n.country_of_origin)",
    "nl_question": "How many different countries of origin are there for sculptures displayed at the Rodin Museum?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "9e8d37d5-8d16-4275-9f43-d7ddfda92d16",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: '2014 Wagah border suicide attack'}), (m0:TerroristAttack {name: 'Sabadell bombing'}) RETURN n.number_of_injuries - m0.number_of_injuries AS answer",
    "nl_question": "What is the difference in the number of injuries between the 2014 Wagah border suicide attack and the Sabadell bombing?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  },
  {
    "qid": "fc8a4521-388e-4c7e-a126-c7b7432cc77c",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Habitat)<-[r0:inhabits]-(m0:Taxon {name: 'Pteris ensiformis'}),(n:Habitat)<-[r1:inhabits]-(m1:Taxon {name: 'Impatiens morsei'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of habitats where both Pteris ensiformis and Impatiens morsei are found?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "1623e845-72e2-47e7-8fc2-ed4f0a07e945",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: 'Serie A'}),(n:Club)<-[r1:playsFor]-(m1:Player {name: 'Carlo Bresciani'}) WITH DISTINCT n RETURN n.name, n.owners",
    "nl_question": "What are the names and owners of clubs that are part of Serie A and have had Carlo Bresciani as a player at some point?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "b55e023f-750c-4375-8d75-e59d2feeb80f",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Alessandro Potenza'}) WHERE r0.start_year IS NOT NULL AND r0.end_year IS NULL WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the clubs Alessandro Potenza is currently playing for?",
    "from_template": {
      "match_category": "special_time-sensitive",
      "match_cypher": "MATCH (n)<-[r0<start_year,end_year^>]-(m0<name>) WHERE r0.start_year IS NOT NULL AND r0.end_year IS NULL",
      "return_pattern_id": "n_name_special",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "3d45958a-c74a-40d3-8b9c-6ae6dad9fd59",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'mannerism'}) WITH DISTINCT n RETURN n.name ORDER BY n.date_of_birth DESC",
    "nl_question": "Who are the artists who created paintings associated with the Mannerism art movement, listed from the youngest to the oldest based on their date of birth?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "7d489b22-5163-4c8f-ba83-3209e6f9d761",
    "graph": "biology",
    "gold_cypher": "MATCH (n:ConservationStatus)<-[r0:hasConservationStatus]-(m0:Taxon {name: 'Savi\\'s Pipistrelle'}),(n:ConservationStatus)<-[r1:hasConservationStatus]-(m1:Taxon {name: 'Anourosorex squamipes'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the conservation statuses shared by Savi's Pipistrelle and Anourosorex squamipes?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "12a2782c-85a2-436f-90bb-d37b281912bd",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'small arms'}) WITH DISTINCT n RETURN n.name, n.country_of_citizenship",
    "nl_question": "What are the names and countries of citizenship of terrorists who have carried out attacks using small arms?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "b4e83d89-edab-4b61-afb6-f85d7801ed4e",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Jean-Claude Yacoubian'}) WITH DISTINCT n RETURN n.name ORDER BY n.inception_year DESC LIMIT 1",
    "nl_question": "What is the name of the club with the most recent founding year that Jean-Claude Yacoubian has played for?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "bb381828-07d8-48d3-ba2f-226981bbd62d",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person) WITH DISTINCT n RETURN n.name ORDER BY n.date_of_death DESC LIMIT 1",
    "nl_question": "Who is the most recently deceased person?",
    "from_template": {
      "match_category": "basic_(n)",
      "match_cypher": "MATCH (n)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "7c7f1f68-00d8-4e34-b81b-70fe18890f19",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Painting)-[r1:createdBy]->(m1:Person {name: 'Jane Hammond'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of museums that have displayed paintings by Jane Hammond, and how many of her paintings have been exhibited at each of these museums?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  }
]
