[
  {
    "qid": "b57f3e99-6843-469f-b7cd-77018d0d65bc",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'Ladies in Flowers'}),(n:Person)<-[r1:createdBy]-(m1:Painting {name: 'Le repos dans le jardin, Argenteuil'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "Who are the artists who created both \"Ladies in Flowers\" and \"Le repos dans le jardin, Argenteuil,\" and what is their gender?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "9ca9d789-d63b-454b-9e60-bcddedb13396",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'public art'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'Hirshhorn Museum and Sculpture Garden'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many sculptures are either classified as public art or exhibited at the Hirshhorn Museum and Sculpture Garden?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "8faa4d0b-c096-45bb-a8c5-77754a77eccb",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'Neoclassical sculpture'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "Who are the artists who created sculptures associated with the Neoclassical sculpture movement, and what are their genders?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "ccba4301-e006-49cc-bd2d-1551ff4546da",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture {name: 'Fugitive Love-M.73.139'}), (m0:Sculpture {name: 'The Shell of Venus'}) RETURN n.creation_year = m0.creation_year AS answer",
    "nl_question": "Are Fugitive Love-M.73.139 and The Shell of Venus created in the same year?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "4a32b279-f4e2-4349-994f-f757a53c8190",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'centre forward'}) WITH DISTINCT n RETURN count(DISTINCT n.gender)",
    "nl_question": "How many different genders are there among players who play as centre forwards?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "4049cd3d-9c3f-432c-8f6a-5748e0ab7b0f",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement)<-[r1:associatedWith]-(m1:Painting {name: 'Duke of Buckingham series'}) WITH DISTINCT n RETURN DISTINCT n.country_of_origin",
    "nl_question": "What are the unique countries of origin of paintings linked to the same art movement as the Duke of Buckingham series?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "0d340494-d135-4941-87d5-ea4cde64da0a",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon {name: 'wolf'}) WITH DISTINCT n RETURN max(n.avg_gestation_period_days)",
    "nl_question": "What is the longest average gestation period among the species that are preyed upon by wolves?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "9948aa97-572b-46dd-b453-eb317290a4f1",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'history painting'}),(n:Painting)-[r1:hasGenre]->(m1:Genre {name: 'portrait'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of paintings that are both history paintings and portraits?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "50c036d9-e91a-4fce-b01e-907266f5ef1b",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'equestrian portrait'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'Romanticism'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many paintings are either equestrian portraits or associated with Romanticism?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "4d673928-955d-4947-8430-024fbaaa63a0",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'Modern sculpture'}),(n:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'Musée d\\'Orsay'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures linked to the Modern sculpture movement and exhibited at the Musée d'Orsay?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "06b0ad74-0234-4aff-88e9-a91b1692791e",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Jan Daemen Cool'}),(n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'Dutch Golden Age painting'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of paintings created by Jan Daemen Cool and associated with the Dutch Golden Age painting movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "f68db644-37e7-4420-b980-d0cb4ace6611",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Auguste Rodin'}) WITH DISTINCT n RETURN n.name ORDER BY n.start_year ASC",
    "nl_question": "What are the names of art movements linked to sculptures created by Auguste Rodin, sorted by their starting year from earliest to latest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "1609f78a-5db8-471d-af0d-638921b80b35",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Antigone vipio'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days DESC LIMIT 1",
    "nl_question": "What is the name of the parent taxon, among those whose offspring are fed on by Antigone vipio, that has the longest average gestation period?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "a6d871c9-7d03-43d2-8c10-ddf567ce6364",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Giuseppe Signori'}) WITH DISTINCT n RETURN n.date_of_birth",
    "nl_question": "When was Giuseppe Signori born?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "6d6f85e4-312d-4cfb-a189-9960cbf12ea2",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'Early Renaissance'}) WITH DISTINCT n RETURN n.name, n.end_year",
    "nl_question": "What are the names and end years of art movements associated with paintings linked to the Early Renaissance?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "6cefa49a-0a15-42c6-8f28-4cd63d953d42",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'mirorder'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa with the rank of mirorder?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "7e14f128-fbae-4f3b-a910-3f7d97dc1a92",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'species'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Cervidae'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods (in days) of species that feed on Cervidae?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "1fe38327-7e9a-46bb-b3e0-c633216b67ac",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Valencia CF Mestalla'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "What are the names and genders of players who have been part of Valencia CF Mestalla at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "c315f728-d3a6-4249-84e0-5a96a0515ed7",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Legion of Honor'}),(n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'nude'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of sculptures that are displayed at the Legion of Honor and belong to the nude genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "2d50e1dd-6516-45ab-883a-0330bb761d57",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'Path in the forest'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "Who are the individuals who created the painting \"Path in the forest,\" and what are their genders?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "375891de-5168-474f-900e-66a0bf94d39d",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Habitat) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many distinct habitats are there?",
    "from_template": {
      "match_category": "basic_(n)",
      "match_cypher": "MATCH (n)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "80e9715e-2232-4f04-8866-f806ce899082",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:TaxonRank)<-[r0:hasRank]-(m0:Taxon {name: 'Nomascus hainus'}) RETURN n, m0 as m UNION MATCH (n:TaxonRank)<-[r1:hasRank]-(m1:Taxon {name: 'Tylonycteris pygmaea'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many taxonomic ranks are associated with either Nomascus hainus or Tylonycteris pygmaea?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "5c0a919d-7b2f-46b9-ade1-a1a828631699",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Psammophiinae'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the grandparents of the taxon Psammophiinae?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "6db1025b-075d-44d1-99ba-efafc9f4e135",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target)<-[r1:targets]-(m1:TerroristAttack {name: '1993 World Trade Center bombing'}) WITH DISTINCT n RETURN n.name, n.number_of_deaths",
    "nl_question": "What are the names and death tolls of terrorist attacks that targeted the same location as the 1993 World Trade Center bombing?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "22b0876e-3aa0-44cb-851e-7b684673191e",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'wing half'}) WITH DISTINCT n RETURN max(n.date_of_birth.year)",
    "nl_question": "What is the latest birth year among players who play as wing halves?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "a65a9acc-51a4-480e-aeb1-0791759efb3d",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:hasHomeVenue]->(m0:Venue {name: 'NAC stadion Heuvelstraat'}) WHERE r0.start_year <= 1931 AND (r0.end_year >= 1931 OR r0.end_year IS NULL) WITH DISTINCT n RETURN n.name",
    "nl_question": "Which clubs used NAC stadion Heuvelstraat as their home venue in the year 1931?",
    "from_template": {
      "match_category": "special_time-sensitive",
      "match_cypher": "MATCH (n)-[r0<start_year,end_year?>]->(m0<name>) WHERE r0.start_year <= ${r0_start_year} AND (r0.end_year >= ${r0_start_year} OR r0.end_year IS NULL)",
      "return_pattern_id": "n_name_special",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "e23e8b0b-5eff-4671-9e93-8a0b9e6136a1",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Duje Ćaleta-Car'}), (m0:Player {name: 'Carlos Sánchez'}) RETURN CASE WHEN n.mass_kg > m0.mass_kg THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Who weighs more, Duje Ćaleta-Car or Carlos Sánchez?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "b376960d-9bde-4c34-8c22-a183d6ad66e5",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club {name: 'Perth Glory FC'}) WITH DISTINCT n RETURN n.inception_year",
    "nl_question": "When was Perth Glory FC founded?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "6fd07fbe-3240-4813-bda6-d0d28b7dd85c",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Genre)<-[r0:hasGenre]-(m0:Sculpture {name: 'Les Fusillés lillois'}) RETURN n, m0 as m UNION MATCH (n:Genre)<-[r1:hasGenre]-(m1:Sculpture {name: 'Fontaine de Neptune de Ghisoni'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many genres are associated with either Les Fusillés lillois or Fontaine de Neptune de Ghisoni?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "30d09370-ac97-46fb-982a-6dff24f13704",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: 'Lega Pro Prima Divisione'}) RETURN n, m0 as m UNION MATCH (n:Club)<-[r1:playsFor]-(m1:Player {name: 'Luigi Della Rocca'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many clubs are either part of the Lega Pro Prima Divisione or have had Luigi Della Rocca as a player at some point?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "8e77ec12-ce71-45e9-8d33-8471b522757c",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'Canada'}) WITH DISTINCT n RETURN n.name, n.date",
    "nl_question": "What are the names and dates of terrorist attacks that took place in Canada?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "5ec2e6d7-cd2d-4f08-ade6-facbd7858e14",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Stade Brestois 29'}) WHERE r0.start_year IS NOT NULL AND r0.end_year IS NULL WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the players currently playing for Stade Brestois 29?",
    "from_template": {
      "match_category": "special_time-sensitive",
      "match_cypher": "MATCH (n)-[r0<start_year,end_year^>]->(m0<name>) WHERE r0.start_year IS NOT NULL AND r0.end_year IS NULL",
      "return_pattern_id": "n_name_special",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "ec3a027f-a7ba-4903-a075-566796307a56",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: 'National Premier Leagues NSW'}) WITH DISTINCT n WHERE n.inception_year = 1954 RETURN n.name",
    "nl_question": "What are the names of clubs in the National Premier Leagues NSW that were founded in 1954?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "8e9e9392-f921-41d4-a7e2-eb430e0900aa",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'France'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:perpetratedBy]->(m1:Terrorist {name: 'Armand Rajabpour-Miyandoab'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks that either took place in France or were carried out by Armand Rajabpour-Miyandoab?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "ddf180e6-6404-4391-9f2c-8205976cea62",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'nude'}),(n:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'Ricardo Brennand Institute'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of nude sculptures that are displayed at the Ricardo Brennand Institute?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "f79e652a-4f2b-4ec2-a682-20525b46730d",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting {name: 'Edward George Villiers Stanley, 17th Earl of Derby'}), (m0:Painting {name: 'Tulip Field in Holland'}) RETURN n.creation_year - m0.creation_year AS answer",
    "nl_question": "What is the difference in the creation years between the paintings Edward George Villiers Stanley, 17th Earl of Derby and Tulip Field in Holland?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  },
  {
    "qid": "09f61106-e668-4258-b7b5-064c677f6861",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target {name: 'White House'}),(n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'United States of America'}) WITH DISTINCT n RETURN min(n.number_of_deaths)",
    "nl_question": "What is the lowest number of deaths in terrorist attacks that targeted the White House and took place in the United States of America?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "b9a28e22-a2e2-4b99-a6e2-41cf49654218",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Museum)<-[r0:displayedAt]-(m0:Painting {name: 'Christ Among the Doctors'}) RETURN n, m0 as m UNION MATCH (n:Museum)<-[r1:displayedAt]-(m1:Sculpture {name: 'Epimetheus and Pandora'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many museums have displayed either the painting Christ Among the Doctors or the sculpture Epimetheus and Pandora?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "2df2fc49-0a27-4e02-9c7e-b3846a8b47e8",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'religious art'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of art movements linked to sculptures in the genre of religious art?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "12741227-df33-4179-bc88-2ac05ae334da",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Helicoverpa armigera'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that have Helicoverpa armigera as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "b528e5e1-6e7e-4b88-a893-158d027a4885",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'portrait'}),(n:Painting)-[r1:createdBy]->(m1:Person {name: 'Rodolfo Amoedo'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of portrait paintings created by Rodolfo Amoedo?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "eab23cc7-f183-4ba7-ad45-dc53c6d72d7f",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League)<-[r1:partOfLeague]-(m1:Club {name: 'Paykan F.C.'}) WITH DISTINCT n WHERE n.head_coach = 'Masoud Shojaei' RETURN n.name",
    "nl_question": "What are the names of clubs in the same league as Paykan F.C. that have Masoud Shojaei as their head coach?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "8b48b633-450b-4cec-8f0f-12affc28456f",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'species'}),(n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Rhectocraspeda periusalis'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods of species that are preyed upon by Rhectocraspeda periusalis?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "592f4aa7-2f29-4e94-853c-f2a47b0ad4ce",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum)<-[r1:displayedAt]-(m1:Painting {name: 'Sofia Albertina av Sverige'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures displayed at the same museum as the painting Sofia Albertina av Sverige?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "2102a1f3-3a7e-4df3-930e-65e8890a83cd",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Illigera'}) WITH DISTINCT n RETURN n.name ORDER BY n.longest_lifespan_years ASC",
    "nl_question": "What are the names of taxa that have Illigera as a parent, sorted by their longest lifespan from shortest to longest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "14194b26-ae80-467b-91bb-de3c20fc21e8",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'mountain forest'}) OPTIONAL MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of all taxa that live in mountain forests, and how many different taxa does each of them feed on?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "ed00a746-67e9-453f-b6af-b282cef3e9fe",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'shotgun'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Germany'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many terrorist attacks either involved a shotgun or took place in Germany?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  }
]
