[
  {
    "qid": "e92578a4-e99d-443c-b560-3292e0c3d366",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Habitat)<-[r0:inhabits]-(m0:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'canyon'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of habitats that are home to species also found in canyons, and how many such species inhabit each of these habitats?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "c719052b-1729-4e11-ac3a-1c9c3738ca08",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement)<-[r1:associatedWith]-(m1:Sculpture {name: 'Bust of Victor Hugo'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year ASC LIMIT 1",
    "nl_question": "What is the name of the earliest created sculpture that shares an art movement with the Bust of Victor Hugo?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "86f9df5c-f8aa-4947-8f39-2ac4ab3a1ffc",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Least Concern'}) WITH DISTINCT n RETURN count(DISTINCT n.diel_cycle)",
    "nl_question": "How many different diel cycles are there for taxa that are preyed upon by species with a conservation status of Least Concern?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "ae3cf54d-5fdc-4ed9-922d-648f8b5fdf32",
    "graph": "biology",
    "gold_cypher": "MATCH (n:ConservationStatus)<-[r0:hasConservationStatus]-(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Cervidae'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of conservation statuses for taxa that feed on Cervidae, and how many such taxa exist for each status?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "abd103dd-8b0c-4c45-946b-6efeca97ac59",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Giraffini'}),(n:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'subtribe'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods (in days) of taxa that belong to the subtribe rank and have Giraffini as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "20f1a397-8f4d-41ec-8d09-64e9ca8a7403",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: '2014 Wagah border suicide attack'}), (m0:TerroristAttack {name: 'Sabadell bombing'}) RETURN CASE WHEN n.number_of_injuries > m0.number_of_injuries THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Which had more injuries: the 2014 Wagah border suicide attack or the Sabadell bombing?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "659f056c-d406-4705-aecc-a4fe0bc1cee9",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Villa Nova Atlético Clube'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many players have been associated with Villa Nova Atlético Clube at any time, either currently or in the past?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "019841f1-db5f-4456-8ca7-497a60ff60f5",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'pipe bomb'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:targets]->(m1:Target {name: 'Jolo Cathedral'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks that used a pipe bomb or targeted Jolo Cathedral?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "234cf43a-e7f0-4b7f-a206-fc3f9993a59c",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Villa Nova Atlético Clube'}) WITH DISTINCT n UNWIND n.nicknames AS prop RETURN DISTINCT prop",
    "nl_question": "What are the unique nicknames of players who have been part of Villa Nova Atlético Clube at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_prop_array_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n UNWIND n.${prop} AS prop RETURN DISTINCT prop"
    }
  },
  {
    "qid": "bf783737-2eab-4859-a28e-5bdc1024cdb2",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'bomb'}) WITH DISTINCT n RETURN n.name ORDER BY n.number_of_injuries ASC",
    "nl_question": "What are the names of terrorist attacks that used a bomb, sorted by the number of injuries from the fewest to the most?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "c2dbe85d-9e3f-4a12-873c-02052488ae41",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country)<-[r1:occursIn]-(m1:TerroristAttack {name: 'Via dei Georgofili bombing'}) WITH DISTINCT n RETURN n.name ORDER BY n.date DESC",
    "nl_question": "What are the names of terrorist attacks that happened in the same country as the Via dei Georgofili bombing, listed from the most recent to the oldest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "8c13a5bf-2f40-4b73-beb9-35c07b376ea4",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'still life'}),(n:Painting)-[r1:createdBy]->(m1:Person {name: 'Diego Velázquez'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many paintings did Diego Velázquez create that are classified as still life?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "c5bd1b43-6226-434e-8669-f9e1d89fdd15",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Israel'}) WITH DISTINCT n WHERE n.date_of_birth > date('1975-02-11') RETURN n.name",
    "nl_question": "What are the names of terrorists born after February 11, 1975, who have carried out attacks in Israel?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "bdc08a35-4ee2-4061-ac3e-db3dde3e4681",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Painting)-[r1:hasGenre]->(m1:Genre {name: 'group portrait'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of museums that exhibit group portrait paintings, and how many such paintings does each museum display?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "0b551673-5ed6-40a0-a386-7703480230fe",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement)<-[r1:associatedWith]-(m1:Painting {name: 'The Tears of St. Peter'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many sculptures are linked to the same art movement as the painting The Tears of St. Peter?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "094ab1fc-4b04-49a3-b2f8-61689c35c4be",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'The Shade'}),(n:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'Balzac in the Robe of a Dominican Monk'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "Who are the individuals who created both The Shade and Balzac in the Robe of a Dominican Monk, and where were they born?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "242360ae-5abc-4a1c-a9fd-28a8d6309150",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'mannerism'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of sculptures linked to the Mannerism art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "85a107a9-3587-4325-8975-4a2baaecd0a3",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'commemorative statue'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures that are classified as commemorative statues?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "3cf5b49f-d580-4bd8-984a-415044d6d43d",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Cybele'}) RETURN n, m0 as m UNION MATCH (n:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'Damned women'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the artists that created either the sculpture Cybele or Damned Women?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "f1e722bd-a5c6-41ff-a003-637176bce1d1",
    "graph": "biology",
    "gold_cypher": "MATCH (n:ConservationStatus)<-[r0:hasConservationStatus]-(m0:Taxon {name: 'Crested Partridge'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What is the conservation status of the Crested Partridge?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "1a09dfc3-e58e-43b1-8804-8eae0d649ec9",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'allegory'}) WITH DISTINCT n RETURN n.name, n.end_year",
    "nl_question": "What are the names and end years of art movements linked to sculptures in the allegory genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "440ae6ee-1963-4226-9383-82e16e7a40e1",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack {name: '1984 Montreal bombing'}) WITH DISTINCT n RETURN n.name, n.country_of_citizenship",
    "nl_question": "Who are the terrorists responsible for the 1984 Montreal bombing, and what are their countries of citizenship?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "675e7be1-3117-4cbb-a421-294930b13dca",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'Fabre museum'}),(n:Painting)-[r1:createdBy]->(m1:Person {name: 'Théodore Géricault'}) WITH DISTINCT n RETURN count(DISTINCT n.country_of_origin)",
    "nl_question": "How many different countries of origin are there for paintings by Théodore Géricault that are displayed at the Fabre museum?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "c3b6cf92-d4e5-4e25-a59c-caf9cb5ee187",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'FK Rudar Pljevlja'}) WITH DISTINCT n RETURN n.name, n.country_of_citizenship",
    "nl_question": "What are the names and countries of citizenship of players who have been part of FK Rudar Pljevlja?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "f9ca19b0-e5b2-48f0-bc00-766650f5db11",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award)<-[r1:receivesAward]-(m1:Player {name: 'Luca Toni'}) WITH DISTINCT n RETURN max(n.mass_kg)",
    "nl_question": "What is the maximum weight in kilograms of players who have received the same award as Luca Toni?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "092cd3a4-4cdd-4f18-92f1-184616a16cae",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'mannerism'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'religious art'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures linked to the Mannerism art movement or classified under the genre of religious art?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "6c4a5462-ab3b-4e34-b4dd-72c5b1d480b6",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Tragedy in the Desert'}) RETURN n, m0 as m UNION MATCH (n:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'The Triumph of the Republic'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many individuals created either Tragedy in the Desert or The Triumph of the Republic?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "764a9747-84ca-442f-b57e-4c6a8aa4e9ae",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:hasHomeVenue]->(m0:Venue {name: 'via Pola field'}) WITH DISTINCT n RETURN n.name, n.owners",
    "nl_question": "What are the names and owners of clubs that have used via Pola field as their home venue at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "d283d8cf-4977-4a61-b0bf-bcf5bc3ad304",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'César Pinares'}) WHERE r0.start_year IS NOT NULL AND r0.end_year IS NULL WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the clubs that César Pinares is currently playing for?",
    "from_template": {
      "match_category": "special_time-sensitive",
      "match_cypher": "MATCH (n)<-[r0<start_year,end_year^>]-(m0<name>) WHERE r0.start_year IS NOT NULL AND r0.end_year IS NULL",
      "return_pattern_id": "n_name_special",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "a408c0a8-5cb3-4c4d-bee1-00d4871fe010",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: '2004 Sinai bombings'}), (m0:TerroristAttack {name: '2005 Kuşadası minibus bombing'}) RETURN n.number_of_injuries - m0.number_of_injuries AS answer",
    "nl_question": "How many more injuries were there in the 2004 Sinai bombings compared to the 2005 Kuşadası minibus bombing?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  },
  {
    "qid": "5a5acfae-636f-4aa1-9423-838a31ff0d21",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'floodplain'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that live in a floodplain?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "65ac6f9e-1cc8-4a0d-8245-e907b3a6e9d4",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'grenade launcher'}) WITH DISTINCT n RETURN n.name ORDER BY n.date DESC LIMIT 1",
    "nl_question": "What is the name of the most recent terrorist attack that used a grenade launcher?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "66386c0c-1feb-418c-9916-ad7e50755796",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasConservationStatus]->(m0:ConservationStatus {name: 'Least Concern'}),(n:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Ardea'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that are classified as Least Concern and have Ardea as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "bb2ab370-193c-42f9-b2cd-86014d303366",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Museum of Fine Arts, Houston'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures displayed at the Museum of Fine Arts, Houston?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "32c11aec-3f9e-4632-aa1e-72d4108daaca",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Target)<-[r0:targets]-(m0:TerroristAttack)-[r1:targets]->(m1:Target {name: 'St. Anthony\\'s Shrine, Kochchikade'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of targets that were also attacked in the same incident as St. Anthony's Shrine, Kochchikade?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "ec3d4d4a-3d30-4202-856d-ced8c5251f23",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'landscape art'}),(n:Painting)-[r1:hasGenre]->(m1:Genre {name: 'marine art'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year ASC",
    "nl_question": "What are the names of paintings that belong to both the landscape art and marine art genres, sorted by their creation year from the earliest to the latest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "065b994e-d9b4-406e-8208-9dc8317853fd",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'land art'}),(n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'land art'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures that are linked to the land art movement and belong to the land art genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "dc9a5485-a03c-4631-8878-292e409eca60",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Gerbillinae'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days DESC LIMIT 1",
    "nl_question": "What is the name of the taxon, which is a grandchild of Gerbillinae, with the longest average gestation period?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "7d97c0af-59dc-42f0-bdd4-e37dd58ab4a4",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture {name: 'Revolving Torsion'}) RETURN n, m0 as m UNION MATCH (n:ArtMovement)<-[r1:associatedWith]-(m1:Sculpture {name: 'Untitled'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of art movements linked to either the sculpture Revolving Torsion or Untitled?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "61f0427f-9a0c-4f0a-b3ac-597cb3d0be43",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'old-growth forest'}) WITH DISTINCT n RETURN n.name ORDER BY n.longest_lifespan_years ASC",
    "nl_question": "What are the names of taxa that are preyed upon by species living in old-growth forests, sorted by their longest lifespan from shortest to longest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "857d9518-e9ee-47aa-8449-c13356fa2067",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'William Orpen'}),(n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Walker Art Gallery'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of paintings created by William Orpen and displayed at the Walker Art Gallery?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "607ed179-c8f4-4abe-8a3e-0278abbb304d",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'avant-garde'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of genres that include sculptures associated with the avant-garde movement, and how many such sculptures are there for each genre?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "60df36c7-24aa-4c9d-b30d-413981058ae1",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Alte Nationalgalerie'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'Modern sculpture'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many sculptures are either displayed at the Alte Nationalgalerie or associated with the Modern sculpture movement?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "1a9f9d98-a97f-46a3-927a-56f6e2efdf97",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: 'December 2013 Mansoura bombing'}), (m0:TerroristAttack {name: 'Netzarim Junction bicycle bombing'}) RETURN CASE WHEN n.number_of_deaths > m0.number_of_deaths THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Which attack had more fatalities: the December 2013 Mansoura bombing or the Netzarim Junction bicycle bombing?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "66e8191f-3e7d-425e-8937-5d92f794317e",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'self-portrait'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Neue Pinakothek'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings that are either self-portraits or displayed at the Neue Pinakothek?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "13f8764e-4636-45d1-9020-23c7a2fced76",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'lowland forest'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names of taxa that live in lowland forests, along with their average gestation periods in days?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  }
]
