[
  {
    "qid": "01f0e124-af9c-4916-aac5-8be7144e34f3",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: 'North American Soccer League'}) RETURN n, m0 as m UNION MATCH (n:Club)-[r1:hasHomeVenue]->(m1:Venue {name: 'Municipal Stadium'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many clubs have either been part of the North American Soccer League or have had the Municipal Stadium as their home venue at some point?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "7da338ef-7335-4535-9a1f-49d28a338b94",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: '8 August 2013 Quetta bombing'}) WITH DISTINCT n RETURN n.date",
    "nl_question": "When did the 8 August 2013 Quetta bombing occur?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "6807bff2-0229-48b8-8560-cf6e9251e5c6",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'playmaker'}) WITH DISTINCT n RETURN n.name, n.country_of_citizenship",
    "nl_question": "What are the names and countries of citizenship of players who play as playmakers?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "1570e18a-b554-4659-8763-3a73bc9f1f70",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture {name: 'Fame'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of art movements associated with the sculpture Fame?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "3250741d-3200-4b28-bcf3-87deffc762be",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'car bomb'}) OPTIONAL MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of all terrorist attacks that used a car bomb, along with the number of targets each attack aimed at.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "9b10e6c1-6ceb-4b27-96a1-12b2d210de96",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'cold weapon'}) WITH DISTINCT n WHERE n.number_of_injuries <> 9 RETURN n.name",
    "nl_question": "What are the names of terrorist attacks that used cold weapons and resulted in a number of injuries different from nine?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "26d5543d-e2bb-43e8-ae11-1fb28c46ef2b",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement)<-[r1:associatedWith]-(m1:Painting {name: 'Rouen Cathedral'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many sculptures are linked to the same art movement as the painting Rouen Cathedral?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "c3adcde2-bc12-4508-a1ec-cbae63da9e11",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Cacophis squamulosus'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days DESC",
    "nl_question": "What are the names of taxa that share a parent with Cacophis squamulosus, sorted by their average gestation period from longest to shortest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "55be006a-b858-4259-bc92-ae69b5b5285a",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Position)<-[r0:playsPosition]-(m0:Player {name: 'Francesco Patino'}) RETURN n, m0 as m UNION MATCH (n:Position)<-[r1:playsPosition]-(m1:Player {name: 'Marco Benassi'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many positions are played by either Francesco Patino or Marco Benassi?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "e3ae3a6a-e860-4d8f-aeec-84cc8624d99c",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack {name: 'Via dei Georgofili bombing'}) WITH DISTINCT n RETURN n.name ORDER BY n.date_of_birth ASC",
    "nl_question": "Who are the terrorists involved in the Via dei Georgofili bombing, listed from the oldest to the youngest based on their date of birth?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "e4d2cdd5-e27d-4f72-a455-7541b6ebea21",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'grenade launcher'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many terrorist attacks involved the use of a grenade launcher?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "2cfabfa9-e917-42bd-9eeb-b584078d1f90",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture {name: 'Object'}), (m0:Sculpture {name: 'Bird Mask (Masque d\\'oiseau)'}) RETURN n.creation_year = m0.creation_year AS answer",
    "nl_question": "Are the creation years of the sculptures Object and Bird Mask (Masque d'oiseau) the same?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "8f07ab7e-a28d-436e-8e85-5d66193b7300",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'lemming'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods of the parents of taxa that feed on lemmings?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "823d7db7-7492-4c79-9e84-094d5caa1a04",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'bust'}),(n:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'modernism'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of sculptures that are busts and associated with modernism?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "818dba49-9799-4ad4-9470-bb141a00207a",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award)<-[r1:receivesAward]-(m1:Player {name: 'Matías Fernandez'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Identify the players who have received the same awards as Matías Fernandez, and specify how many of those awards each player has received.",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "ed2e7048-b3f0-4fc6-9cb7-d952c9a2b564",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Musée Rodin'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'neoclassicism'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many sculptures are either displayed at the Musée Rodin or associated with neoclassicism?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "499c87e3-a3b8-47ad-a886-73cd1bee1306",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Taphozous'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Orthoptera'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa that have Taphozous as a parent and feed on Orthoptera?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "31afa3d5-6b03-48a6-bbb6-dddcf85ff4de",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'temperate forest'}) RETURN n, m0 as m UNION MATCH (n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Actias luna'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that either live in temperate forests or are preyed upon by Actias luna?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "7c212f48-f60e-4e45-aa16-8b401422a525",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement {name: 'mannerism'}), (m0:ArtMovement {name: 'Early Renaissance'}) RETURN n.end_year = m0.end_year AS answer",
    "nl_question": "Do the art movements Mannerism and Early Renaissance share the same end year?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "57ce1535-faf3-4bea-9b17-2acbbaf7ad71",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Sauveur Rodriguez'}), (m0:Player {name: 'Alessandro Agostini'}) RETURN CASE WHEN n.height_cm > m0.height_cm THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Who is taller, Sauveur Rodriguez or Alessandro Agostini?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "e9a09600-8cf9-4e50-beb6-06ad83d682a2",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'U.S. Città di Pontedera S.S.D.'}) WITH DISTINCT n RETURN n.name ORDER BY n.date_of_death DESC LIMIT 1",
    "nl_question": "Who is the player associated with U.S. Città di Pontedera S.S.D. who passed away most recently?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "f5c198ad-5b7b-4e1c-a585-a62dc131f1a3",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:hasHomeVenue]->(m0:Venue {name: 'via Pola field'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of clubs that have used via Pola field as their home venue at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "add3fceb-b2d4-4266-8604-2a4d7f64821e",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Gopherus'}),(n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Ceratophaga vicinella'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of taxa that are children of Gopherus and are fed on by Ceratophaga vicinella?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "07c9b1d4-9a7e-4007-bee4-78198769910d",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'interior view'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year ASC LIMIT 1",
    "nl_question": "What is the name of the earliest painting in the interior view genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "be9c07c8-8dcc-451d-9b3d-7e7e60f363f5",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'James Surls'}) WITH DISTINCT n WHERE n.creation_year = 1982 RETURN n.name",
    "nl_question": "What are the names of sculptures created by James Surls in the year 1982?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "842232b6-0dfc-4a20-aa88-da31831a1414",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Gaston Veuvenot Leroux'}) OPTIONAL MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of sculptures created by Gaston Veuvenot Leroux, and how many different genres does each sculpture belong to?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "ed680342-93e0-45df-a0a8-748e3a54cb0f",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Ballon d\\'Or'}),(n:Player)-[r1:receivesAward]->(m1:Award {name: 'European Golden Shoe'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the players who have won both the Ballon d'Or and the European Golden Shoe?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "d2f97837-6ae1-4ddb-bc73-572a0a90c4fe",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:TaxonRank)<-[r0:hasRank]-(m0:Taxon {name: 'Microsorum'}) RETURN n, m0 as m UNION MATCH (n:TaxonRank)<-[r1:hasRank]-(m1:Taxon {name: 'Clamator'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many taxonomic ranks are associated with either Microsorum or Clamator?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "bb6ed341-3beb-493f-a833-687e5b8a8bb0",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'Buffalo AKG Art Museum'}) WITH DISTINCT n RETURN n.name, n.date_of_death",
    "nl_question": "Who are the artists who created sculptures displayed at the Buffalo AKG Art Museum, and when did they pass away?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "da314016-44da-41be-a0c1-7672ac1e3f45",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Club)-[r0:hasHomeVenue]->(m0:Venue {name: 'Stadio Olimpico Grande Torino'}) RETURN n, m0 as m UNION MATCH (n:Club)<-[r1:playsFor]-(m1:Player {name: 'Marcello Mihalich'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of clubs that have either used Stadio Olimpico Grande Torino as their home venue or have had Marcello Mihalich as a player at some point?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "b500466d-0392-4f77-ac6c-44548544f0a1",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting {name: 'Portrait of Procurator Jacopo Soranzo'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many art movements are associated with the painting Portrait of Procurator Jacopo Soranzo?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "5ce16927-adf8-4358-b413-82a130f71c03",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Venturia'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa that have Venturia as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "da03be1c-3a41-4ea3-9ce8-d27af41c786d",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'forward'}),(n:Player)-[r1:playsPosition]->(m1:Position {name: 'inside forward'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of players who play both as a forward and an inside forward?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "66463017-8ad5-4273-ab87-0357e8bf7b4f",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement)<-[r1:associatedWith]-(m1:Painting {name: 'Portrait of a Lady with a Flower'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year ASC",
    "nl_question": "What are the names of sculptures linked to the same art movement as the painting Portrait of a Lady with a Flower, sorted by their creation year from oldest to newest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "0d0247fe-5d81-4bdc-b25c-aeecedf47a6d",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Matteo Giordano'}) RETURN n, m0 as m UNION MATCH (n:Club)<-[r1:playsFor]-(m1:Player {name: 'Marcus Thuram'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of clubs that have had either Matteo Giordano or Marcus Thuram as players at some point?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "da55160d-3f11-480c-9da8-156f7d8c9371",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Malayan tiger'}) OPTIONAL MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of all the species that the Malayan tiger preys on, and how many different habitats does each of these species inhabit?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)<-[r1]-(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "66a73ad5-117c-4d68-bb00-de028a7d3d1b",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'lemming'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of the parents of taxa that feed on lemmings?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "592bdafc-b207-4ead-9120-704635a869d9",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'pasture'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names of taxa that live in pastures, along with their average gestation periods in days?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "8d2561d0-826e-4a01-9d9f-ea93f7b6409d",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon {name: 'kiang'}), (m0:Taxon {name: 'Brandt\\'s vole'}) RETURN CASE WHEN n.longest_lifespan_years > m0.longest_lifespan_years THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Between the kiang and Brandt's vole, which one has the longer lifespan?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "8e73c35e-3a6e-4e9b-ac3b-18a385081eb4",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Ballon d\\'Or'}),(n:Player)-[r1:receivesAward]->(m1:Award {name: 'Pichichi Trophy'}) WITH DISTINCT n RETURN n.name, n.mass_kg",
    "nl_question": "Who are the players who have won both the Ballon d'Or and the Pichichi Trophy, and what are their weights in kilograms?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "7fc4d566-6b51-4b21-b2f7-d82741a97656",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'portrait'}),(n:Painting)-[r1:createdBy]->(m1:Person {name: 'Rodolfo Amoedo'}) WITH DISTINCT n RETURN min(n.creation_year)",
    "nl_question": "What is the earliest creation year of paintings that are portraits and were created by Rodolfo Amoedo?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "273dee3e-6b32-4aca-85fb-74b359732572",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'Art Deco'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures linked to the Art Deco movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "14a42d97-b76d-4709-9ed1-f8bc66b51a07",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: '2002 Immanuel bus attack'}), (m0:TerroristAttack {name: 'Droppin Well bombing'}) RETURN n.number_of_deaths - m0.number_of_deaths AS answer",
    "nl_question": "How many more deaths occurred in the 2002 Immanuel bus attack compared to the Droppin Well bombing?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  },
  {
    "qid": "083b5246-7d5a-463b-90bf-e9c0fef6a6a0",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Scalopinae'}) WITH DISTINCT n RETURN n.name ORDER BY n.longest_lifespan_years ASC LIMIT 1",
    "nl_question": "What is the name of the taxon under Scalopinae that has the shortest maximum lifespan?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "6ec30a63-ba05-4f5f-a2d5-bb041e245e37",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'defender'}),(n:Player)-[r1:playsFor]->(m1:Club {name: 'Derthona F.B.C. 1908'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "What are the names and genders of players who have played as defenders for Derthona F.B.C. 1908 at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "9b4ef753-cefb-46ad-83a3-56be02c4b21d",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Saguinini'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of taxa that are descendants of a taxon which is a descendant of Saguinini?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "f7bb49ba-5b82-4318-a932-d08fb5cf1267",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'India'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:targets]->(m1:Target {name: 'Oberoi Trident'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many terrorist attacks either took place in India or targeted the Oberoi Trident?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "13a819f4-17e1-488c-8987-cc785ad6b8a3",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Valencia CF Mestalla'}) WITH DISTINCT n RETURN n.name, n.height_cm",
    "nl_question": "What are the names and heights in centimeters of players who have been part of Valencia CF Mestalla?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  }
]
