[
  {
    "qid": "6de28534-4c80-4c04-a753-414d9b955518",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'avant-garde'}),(n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'Italian design'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of sculptures linked to the avant-garde art movement and categorized under the Italian design genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "5f3e916b-91cf-468b-acf4-5bf3837e39ab",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:League)<-[r0:partOfLeague]-(m0:Club {name: '1. FC Union Berlin'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the leagues that include 1. FC Union Berlin as a member?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "9794b3f5-51f6-4876-b5ab-4530644eb22d",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Auguste Rodin'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'Modern sculpture'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many sculptures were either created by Auguste Rodin or are linked to the Modern sculpture movement?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "7ea4cf6b-5c6c-4248-a441-6018d29daf8c",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club {name: 'U.S. Avellino 1912'}), (m0:Club {name: 'Chiapas F.C.'}) RETURN n.country = m0.country AS answer",
    "nl_question": "Are U.S. Avellino 1912 and Chiapas F.C. located in the same country?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "b66ee2d1-506f-453d-8f76-eeb5c752ab7d",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre)<-[r1:hasGenre]-(m1:Sculpture {name: 'The Kiss'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year ASC LIMIT 1",
    "nl_question": "What is the name of the earliest painting that shares a genre with the sculpture The Kiss?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "f1a6ff48-6817-4180-a36d-7fde23767ac3",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:perpetratedBy]->(m0:Terrorist {name: 'Ikuo Hayashi'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:targets]->(m1:Target {name: 'Tokyo subway'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks either carried out by Ikuo Hayashi or aimed at the Tokyo subway?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "b8b191b1-c1cc-4492-958f-81d2e6d3c85b",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Venia Demetrakopoulou'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures created by Venia Demetrakopoulou?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "7e78aa54-a2af-45f4-bc50-9757f11d10e8",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'tomato'}) OPTIONAL MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of all taxa that feed on tomatoes, and how many other taxa feed on each of them?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)<-[r0]-(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "2d657246-561e-40eb-98ce-04eadbf5e570",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Luigi Miconi'}), (m0:Player {name: 'Emiliano Macchi'}) RETURN CASE WHEN n.date_of_death > m0.date_of_death THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Who passed away later, Luigi Miconi or Emiliano Macchi?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "30b8dec3-507e-4698-94d8-e11eda37b301",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Painting {name: 'Madonna and Child with the Blessing Christ, and Saints Mary Magdalene and Catherine of Alexandria with Angels [entire triptych]'}),(n:Genre)<-[r1:hasGenre]-(m1:Sculpture {name: 'Christus in de Mijnstreek'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the genres shared by the painting \"Madonna and Child with the Blessing Christ, and Saints Mary Magdalene and Catherine of Alexandria with Angels [entire triptych]\" and the sculpture \"Christus in de Mijnstreek\"?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "462361d2-363d-4187-a556-769e9b699105",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon {name: 'Roborovski hamster'}), (m0:Taxon {name: 'red panda'}) RETURN CASE WHEN n.avg_gestation_period_days > m0.avg_gestation_period_days THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Which has a longer average gestation period, the Roborovski hamster or the red panda?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "599ca170-7480-46b0-84fd-ccc212e57fdb",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon)<-[r1:employs]-(m1:TerroristAttack {name: 'Beersheva bus station shooting'}) WITH DISTINCT n RETURN max(n.number_of_deaths)",
    "nl_question": "What is the highest number of deaths in terrorist attacks that used the same weapon as the Beersheva bus station shooting?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "80baecdd-505c-42e4-b742-2b689b6ecdcc",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'ACF Fiorentina'}) RETURN n, m0 as m UNION MATCH (n:Player)-[r1:playsPosition]->(m1:Position {name: 'sweeper'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of players who have either been part of ACF Fiorentina or have played as a sweeper?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "66bc6799-d6fa-4c5d-b588-64a75f84ce84",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Genre)<-[r0:hasGenre]-(m0:Sculpture {name: 'Berger des Nuages'}) RETURN n, m0 as m UNION MATCH (n:Genre)<-[r1:hasGenre]-(m1:Sculpture {name: 'Blaise Pascal'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many genres are associated with either the sculpture Berger des Nuages or Blaise Pascal?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "e2de9a28-cf58-495e-b022-098748267e58",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon {name: 'Antigone vipio'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods, in days, of the taxa that are preyed upon by Antigone vipio?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "50b447fc-d68f-4c68-9bb9-dafb7bafc302",
    "graph": "biology",
    "gold_cypher": "MATCH (n:TaxonRank)<-[r0:hasRank]-(m0:Taxon {name: 'Murina gracilis'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the taxonomic ranks assigned to Murina gracilis?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "45c292d2-8fec-4e0c-a826-19a670ab49b8",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award)<-[r1:receivesAward]-(m1:Player {name: 'Marko Marin'}) WITH DISTINCT n RETURN n.name ORDER BY n.date_of_death DESC LIMIT 1",
    "nl_question": "Who is the player, among those who have received the same award as Marko Marin, with the most recent date of death?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "82326544-d18d-4cfe-a183-9f9d5af03337",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Near Threatened'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans of taxa that are preyed upon by species with a conservation status of Near Threatened?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "d3c84beb-b6a0-4521-9680-33a06fdf8218",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Georges Gardet'}) WITH DISTINCT n RETURN count(DISTINCT n.country_of_origin)",
    "nl_question": "How many different countries of origin are there for sculptures created by Georges Gardet?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "31cba336-2da1-48d4-b784-2c516e93948e",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'neoclassicism'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of genres of sculptures associated with the neoclassicism art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "70c40573-9d90-4f7f-91a3-b9a8aa50e6c5",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Odonata'}) OPTIONAL MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of all taxa that feed on Odonata, and how many different habitats does each of them inhabit?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "97607b6b-38b1-4db1-9879-28466abd3359",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'conceptual art'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures linked to the conceptual art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "18244ee8-6ddc-4965-80fa-5f673ded685f",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum)<-[r1:displayedAt]-(m1:Sculpture {name: 'The Walking Man (L\\'Homme qui marche)'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings exhibited in the same museum as the sculpture The Walking Man (L'Homme qui marche)?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "bd01e737-2023-4e38-b17c-fdcca2b554bb",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist {name: 'Herman Frank Cash'}) WITH DISTINCT n RETURN n.gender",
    "nl_question": "What is Herman Frank Cash's gender?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "9636a74b-5614-4b09-882c-be3c2dada16f",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'wetland'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days DESC LIMIT 1",
    "nl_question": "What is the name of the taxon that lives in wetlands and has the longest average gestation period?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "26c6584c-a005-482b-a7e8-8fa691ee7bf5",
    "graph": "biology",
    "gold_cypher": "MATCH (n:TaxonRank)<-[r0:hasRank]-(m0:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Near Threatened'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of taxonomic ranks that include taxa with a conservation status of Near Threatened, and how many such taxa are there for each rank?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "ae794972-310d-4d23-b93a-e38c75cb8ea3",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'A.S.D. Gallipoli Football 1909'}) RETURN n, m0 as m UNION MATCH (n:Player)-[r1:playsFor]->(m1:Club {name: 'Cavese 1919'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of players who have been part of either A.S.D. Gallipoli Football 1909 or Cavese 1919 at any time?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "cba20a0d-fbc1-4494-9a4c-b29cd8a82f40",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon) WITH DISTINCT n RETURN min(n.avg_gestation_period_days)",
    "nl_question": "What is the shortest average gestation period among taxa that are preyed upon by other taxa?",
    "from_template": {
      "match_category": "basic_(n)-(m0)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "7781a00c-4948-42e8-b10c-a36d3ecd873d",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack {name: 'Collierville Kroger shooting'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the terrorists responsible for the Collierville Kroger shooting?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "e70fd7e9-8ce8-46c9-a03c-c4d9f7c6b022",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist {name: 'Michael Townley'}) WITH DISTINCT n RETURN n.place_of_birth",
    "nl_question": "Where was Michael Townley born?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "7aa8773d-dcc7-446d-be77-5c6abb1d79b1",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r1:playsPosition]->(m1:Position {name: 'defensive midfielder'}) OPTIONAL MATCH (n:Player)-[r0:playsFor]->(m0:Club) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of all players who have played as defensive midfielders, and how many clubs have they been associated with, either currently or in the past?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "3e9a2ceb-147a-419b-bee6-604b9c9c0260",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Claude Monet'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Serlachius Museum Gösta'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many paintings were either created by Claude Monet or displayed at the Serlachius Museum Gösta?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "dbf48cd8-ddb9-4ad8-8d61-a741de9b08b7",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Rodin Museum'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures that are displayed at the Rodin Museum?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "8d7a333f-4212-47c7-ad17-587c08982366",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r1:associatedWith]-(m1:Sculpture {name: 'Bust of Victor Hugo'}) OPTIONAL MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of art movements associated with the Bust of Victor Hugo, and how many paintings are linked to each of them?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)<-[r1]-(m1<name>) OPTIONAL MATCH (n)<-[r0]-(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "e6a60768-bf1e-473d-b8ba-92fa463f9409",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'defender'}) WITH DISTINCT n RETURN n.name ORDER BY n.date_of_birth DESC LIMIT 1",
    "nl_question": "Who is the youngest player in the defender position?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "1d384041-725f-49aa-a8cf-42dec6aefc1d",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target {name: 'Georgia Guidestones'}),(n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'United States of America'}) WITH DISTINCT n RETURN n.name, n.number_of_injuries",
    "nl_question": "What are the names and injury counts of terrorist attacks that targeted the Georgia Guidestones and took place in the United States of America?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "7993d5ba-1982-422b-863d-3d97955cf011",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r1:playsFor]->(m1:Club {name: 'VfL Bochum'}) OPTIONAL MATCH (n:Player)-[r0:playsPosition]->(m0:Position) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of all players who have been part of VfL Bochum at any time, along with the number of positions each player has played.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "fec7eb6f-2d12-4460-806e-7cf8c9827392",
    "graph": "biology",
    "gold_cypher": "MATCH (n:ConservationStatus)<-[r0:hasConservationStatus]-(m0:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'subspecies'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many distinct conservation statuses are there for taxa ranked as subspecies?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "dae95bda-e6b9-4a88-a37e-e5c0e61aa5fe",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'Israel'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'bullet'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many terrorist attacks either took place in Israel or involved the use of bullets?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "b2384483-bb1f-473e-8807-27e5ffdcc8b5",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'El Greco'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'High Renaissance'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings either created by El Greco or linked to the High Renaissance art movement?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "67a2bad7-323f-44af-867d-969c244d4090",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'Musée d\\'art moderne (Saint-Étienne)'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of paintings displayed at the Musée d'art moderne in Saint-Étienne?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "a13f4cdd-1015-4962-afb7-cfd17c32e167",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'The Nelson-Atkins Museum of Art'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings exhibited at The Nelson-Atkins Museum of Art?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "b231c9d6-539d-4371-a4b1-d2369f178ed1",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'Uganda'}) WITH DISTINCT n RETURN n.name, n.locations",
    "nl_question": "What are the names and locations of terrorist attacks that took place in Uganda?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "4be62da8-cab1-45b3-83cf-de4dce5245c1",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement)<-[r1:associatedWith]-(m1:Painting {name: 'Christ Washing the Disciples\\' Feet'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC",
    "nl_question": "What are the names of sculptures linked to the same art movement as the painting Christ Washing the Disciples' Feet, listed from the most recently created to the oldest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "a4f8d74c-17b8-421f-bbe8-ec0e54874717",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'bust'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'Neoclassical sculpture'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many sculptures are either in the genre of bust or associated with the Neoclassical sculpture movement?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "49487c62-f783-41f2-9f55-14a419f2a2bb",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack {name: 'Collierville Kroger shooting'}) WITH DISTINCT n RETURN n.name, n.country_of_citizenship",
    "nl_question": "Who are the terrorists responsible for the Collierville Kroger shooting, and what are their countries of citizenship?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "bc9fef0b-d6d1-4e32-8c78-fc64c2a5858d",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Le Crucifié'}) RETURN n, m0 as m UNION MATCH (n:Person)<-[r1:createdBy]-(m1:Painting {name: 'Man at a Window'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many individuals created either the sculpture Le Crucifié or the painting Man at a Window?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  }
]
