[
  {
    "qid": "88dd71e2-2bb2-4914-bb57-7fee635f6b6e",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Metapterygota'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of taxa that feed on the offspring of Metapterygota?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "f6df4afe-65a8-4bd0-affe-3e3b691ad169",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club {name: 'Club Deportivo Municipal'}), (m0:Club {name: 'Chelsea F.C.'}) RETURN n.country = m0.country AS answer",
    "nl_question": "Are Club Deportivo Municipal and Chelsea F.C. based in the same country?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "d410d3de-75d1-4eb9-ab84-f46dfaff81bb",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement {name: 'Spanish Golden Age'}), (m0:ArtMovement {name: 'Flemish Baroque painting'}) RETURN n.end_year = m0.end_year AS answer",
    "nl_question": "Do the Spanish Golden Age and Flemish Baroque painting share the same end year?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "2875f4a4-a8bc-4c76-83ea-99580b20e035",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting {name: 'Christ Bearing the Cross'}), (m0:Painting {name: 'Christ and the Centurion'}) RETURN n.creation_year - m0.creation_year AS answer",
    "nl_question": "What is the difference in the creation years between the paintings Christ Bearing the Cross and Christ and the Centurion?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  },
  {
    "qid": "ce2a6cc9-03a8-4dae-b169-9b30e3f4e08c",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'Kathrin'}) RETURN n, m0 as m UNION MATCH (n:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'Knitting'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many individuals created either the painting Kathrin or the sculpture Knitting?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "09351e8f-b14e-4fd2-a724-a880239f710f",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Museum)<-[r0:displayedAt]-(m0:Painting {name: 'Portrait of Charles III as Infante'}) RETURN n, m0 as m UNION MATCH (n:Museum)<-[r1:displayedAt]-(m1:Sculpture {name: 'Epimetheus and Pandora'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of museums where either the painting Portrait of Charles III as Infante or the sculpture Epimetheus and Pandora is displayed?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "60a09006-4e2d-4561-a1a1-17b2e95febc6",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'François-Raoul Larche'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures created by François-Raoul Larche?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "af8bf409-3d1b-4e6b-9ad9-61bc06cd1a11",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'Asilidae'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Neuroptera'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of taxa that feed on both Asilidae and Neuroptera?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "2b887ece-4469-47c3-ac89-7cabbe618622",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Angelica Kauffmann'}),(n:Painting)-[r1:hasGenre]->(m1:Genre {name: 'group portrait'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of paintings created by Angelica Kauffmann that are group portraits?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "b66a6fa5-a667-4ca3-a0f2-1dce5fee19dc",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Museum of Modern Art'}) OPTIONAL MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of paintings displayed at the Museum of Modern Art, and how many different genres does each painting belong to?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "dd4edd84-9cd5-44dd-986d-e14c822494ea",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'Tate'}) WITH DISTINCT n RETURN count(DISTINCT n.country_of_origin)",
    "nl_question": "How many different countries of origin are there for paintings displayed at the Tate?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "17bef996-4433-48d0-a98e-2f1d567e6805",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'funerary art'}),(n:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Gabriel-Vital Dubray'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures that are funerary art pieces created by Gabriel-Vital Dubray?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "daa240a9-b7a2-4b1f-8d8d-1fa27b55cf41",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person {name: 'Frédéric Régamey'}), (m0:Person {name: 'Jules-Alexis Muenier'}) RETURN CASE WHEN n.date_of_death > m0.date_of_death THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Who died later, Frédéric Régamey or Jules-Alexis Muenier?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "bef3c246-2ba7-4078-bb2a-483e9950a512",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'The Thinker'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many paintings were created by the same person who sculpted The Thinker?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "e1c473f3-295d-4d6d-92c1-93b74487b9e9",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days DESC LIMIT 1",
    "nl_question": "What is the name of the taxon that is preyed upon by another taxon and has the longest average gestation period?",
    "from_template": {
      "match_category": "basic_(n)-(m0)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "c5c166f1-217c-462b-b329-e98883ec9c40",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Illigera'}) WITH DISTINCT n RETURN count(DISTINCT n.diel_cycle)",
    "nl_question": "How many different diel cycles are there for taxa that have Illigera as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "7c68268d-1a38-42b2-8b3d-8a6fd04e28b3",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'mythological painting'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'Baroque painting'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings that are either mythological or associated with the Baroque art movement?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "b2ed998b-b12d-49b2-b0e7-139892ce7ee7",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture {name: 'The Burghers of Calais'}),(n:ArtMovement)<-[r1:associatedWith]-(m1:Sculpture {name: 'The Kiss'}) WITH DISTINCT n RETURN n.name, n.start_year",
    "nl_question": "What are the names and starting years of art movements associated with both The Burghers of Calais and The Kiss?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "8cb61328-4dba-41bf-a840-bcbab331b102",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:hasHomeVenue]->(m0:Venue {name: 'Peristeri Stadium'}) WITH DISTINCT n RETURN n.name, n.country",
    "nl_question": "What are the names and countries of clubs that have used Peristeri Stadium as their home venue at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "2ae503b8-f581-417c-a032-beed14eea472",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:hasHomeVenue]->(m0:Venue {name: 'Mapei Stadium - Città del Tricolore'}) WITH DISTINCT n RETURN max(n.inception_year)",
    "nl_question": "What is the latest inception year of clubs that have ever had Mapei Stadium - Città del Tricolore as their home venue?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "341dda09-3b4c-42e9-81dc-06ec07ba0d1e",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Genre)<-[r0:hasGenre]-(m0:Sculpture {name: 'Baigneuse'}) RETURN n, m0 as m UNION MATCH (n:Genre)<-[r1:hasGenre]-(m1:Sculpture {name: 'The Three Graces'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of genres associated with either Baigneuse or The Three Graces?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "ad8b8ec2-2727-40e2-98eb-518733f8e5b2",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'FK Mogren'}) RETURN n, m0 as m UNION MATCH (n:Player)-[r1:playsPosition]->(m1:Position {name: 'midfielder'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many players have either played for FK Mogren at some point or have been midfielders?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "1b902c31-5fb7-4728-9b2b-ce1e77d2a6cf",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Hexapoda'}) OPTIONAL MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of all taxa that have Hexapoda as a parent, and how many taxa feed on each of them?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)<-[r0]-(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "f283a6a6-e3a3-435f-974f-fa207a605332",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club {name: 'FC Liefering'}) WITH DISTINCT n RETURN n.owners",
    "nl_question": "Who owns FC Liefering?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "4b627936-cb73-459e-8461-18ddff035723",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'found object'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures that belong to the found object genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "9cf0be18-6396-446f-8053-d547b0d44b3b",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Venue)<-[r0:hasHomeVenue]-(m0:Club)<-[r1:playsFor]-(m1:Player {name: 'Laurent Blanc'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many venues have served as the home ground for clubs that Laurent Blanc has played for at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "7d5bcdec-63ac-4a2b-9f98-23a6b30848a8",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon {name: 'Malayan tiger'}),(n:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Capreolinae'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa that are preyed upon by the Malayan tiger and have Capreolinae as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "6da296bc-186f-4b21-96a0-13a80c30d619",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'Danube school'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of paintings linked to the Danube school art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "981582a2-8de3-4c7f-8c22-79ade64be88c",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Least Concern'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of taxa that feed on species with a conservation status of Least Concern, and how many such species does each taxon feed on?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "96470c92-3bd8-4c33-8cda-a0caf63df3e1",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'Denmark'}) WITH DISTINCT n RETURN n.name ORDER BY n.date DESC LIMIT 1",
    "nl_question": "What is the name of the most recent terrorist attack that took place in Denmark?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "56a90e82-748b-4bf8-9268-a27cfc7d03ff",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:perpetratedBy]->(m0:Terrorist {name: 'Khālid El Bakraoui'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'nail bomb'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks either carried out by Khālid El Bakraoui or involving a nail bomb?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "fa614a99-c3f2-4e9b-956c-138db3855ad8",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'genus'}),(n:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Lepus'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans in years of taxa that are classified as a genus and have Lepus as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "516741de-32c4-4e13-8b54-81b28dd97d74",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Maclura'}),(n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'solutional cave'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of taxa that have Maclura as a parent and inhabit solutional caves?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "7fbb74e0-b427-44ab-b92e-a2ecad7ec370",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Princeton University Art Museum'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Auguste Rodin'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures either displayed at the Princeton University Art Museum or created by Auguste Rodin?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "58d65e33-dd46-43c9-baa6-39b075f13549",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasConservationStatus]->(m0:ConservationStatus)<-[r1:hasConservationStatus]-(m1:Taxon {name: 'Sulawesi Scops Owl'}) WITH DISTINCT n WHERE n.avg_gestation_period_days <= 35 RETURN n.name",
    "nl_question": "What are the names of taxa with the same conservation status as the Sulawesi Scops Owl and an average gestation period of 35 days or less?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "1d1970a9-0824-4a77-9e84-a91cee4d5b90",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'order'}) OPTIONAL MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of all taxa classified at the order rank, along with the count of different taxa they feed on.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "c9bb8c26-3a78-494c-bdb8-7b8391a19e44",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Habitat)<-[r0:inhabits]-(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Ducula'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of habitats where taxa that have Ducula as a parent live?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "d83785d6-e40d-4c59-83d0-c946c7dff235",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasConservationStatus]->(m0:ConservationStatus {name: 'Least Concern'}),(n:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Muntiacus muntjak nigripes'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans of taxa that are classified as Least Concern and have Muntiacus muntjak nigripes as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "e18f4974-b758-47cf-ad52-0c59d30b6620",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target {name: 'Chaplyne'}),(n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Ukraine'}) WITH DISTINCT n RETURN n.name, n.number_of_deaths",
    "nl_question": "What are the names and death tolls of terrorist attacks targeting Chaplyne and occurring in Ukraine?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "ce3a3013-b155-4e91-899e-f871d0571a48",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Italian Football Hall of Fame'}),(n:Player)-[r1:receivesAward]->(m1:Award {name: 'European Golden Shoe'}) WITH DISTINCT n RETURN n.name, n.nicknames",
    "nl_question": "Provide the names and nicknames of players who have received both the Italian Football Hall of Fame and the European Golden Shoe awards.",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "cffe4006-0845-4de0-9a84-1921cacdcd7a",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'United States of America'}),(n:TerroristAttack)-[r1:targets]->(m1:Target {name: 'Port Authority Bus Terminal'}) WITH DISTINCT n RETURN n.name, n.locations",
    "nl_question": "What are the names and locations of terrorist attacks that happened in the United States of America and targeted the Port Authority Bus Terminal?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "76ff3b1a-2437-4eb6-ad15-1b86f5f555a9",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person {name: 'Gualtiero Galmanini'}) WITH DISTINCT n RETURN n.date_of_birth",
    "nl_question": "When was Gualtiero Galmanini born?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "e48b247f-4fe1-4e36-a399-4da6baa7f8b9",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target)<-[r1:targets]-(m1:TerroristAttack {name: 'United Airlines Flight 93'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks that targeted the same target as United Airlines Flight 93?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "291f38c7-799f-4e60-ae65-e969d41a4740",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'public art'}),(n:Sculpture)-[r1:createdBy]->(m1:Person {name: 'François Lanno'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC LIMIT 1",
    "nl_question": "What is the name of the most recently created public art sculpture by François Lanno?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "1c613a91-1f21-4e69-a937-fa694adb3e8a",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person {name: 'William Orpen'}) WITH DISTINCT n RETURN n.place_of_birth",
    "nl_question": "Where was William Orpen born?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "811f7a0c-9d32-41a8-ab7c-4d5b73432237",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'modern art'}),(n:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Auguste Rodin'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures linked to modern art and created by Auguste Rodin?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "11ce130b-f183-4682-8ab4-61ad69e6847a",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Dicaeum'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'insect'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that have Dicaeum as a parent and feed on insects?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "e7715129-264e-47c3-85c8-db3d5dd88b50",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club)-[r1:partOfLeague]->(m1:League {name: 'Serbian First League'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of players who have been part of a club in the Serbian First League?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  }
]
