[
  {
    "qid": "c8ca1a22-7fdc-41c9-afc6-f33e146eabd6",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r1:createdBy]->(m1:Person {name: 'Jan Maurits Quinkhard'}) OPTIONAL MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of all paintings created by Jan Maurits Quinkhard, and how many different genres does each painting belong to?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "0726a6c0-49f2-43a1-bbbe-ed6269ab388a",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: 'Meenambakkam bomb blast'}), (m0:TerroristAttack {name: 'Jaffa Road bus bombings'}) RETURN n.number_of_deaths = m0.number_of_deaths AS answer",
    "nl_question": "Did the Meenambakkam bomb blast and the Jaffa Road bus bombings result in the same number of deaths?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "255815a3-70ce-43c8-a5d9-0029719491b2",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'bazooka'}),(n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Israel'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks that used a bazooka and took place in Israel?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "1c028871-7d1c-4a2f-a378-c6982cb91109",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'land'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Soricidae'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa that live on land and feed on Soricidae?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "11943a37-d1b5-485f-b5f6-644392810194",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Award)<-[r0:receivesAward]-(m0:Player {name: 'Roberto Baggio'}) RETURN n, m0 as m UNION MATCH (n:Award)<-[r1:receivesAward]-(m1:Player {name: 'Matthias Sammer'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of awards received by either Roberto Baggio or Matthias Sammer?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "7dd90993-c958-4df4-80cc-45ce27749285",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Auguste Rodin'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures created by Auguste Rodin?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "1dff88e9-f5da-424d-9241-37d4f0cf2452",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'art of sculpture'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of sculptures that belong to the art of sculpture genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "a3f2adff-93d4-44e3-b15c-6c852ce8139c",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Gerrit Lundens'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of paintings made by Gerrit Lundens?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "1589bdb7-85ce-4cfe-b1a9-0a7e61f8a966",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person {name: 'Ōtagaki Rengetsu'}) WITH DISTINCT n RETURN n.place_of_birth",
    "nl_question": "Where was Ōtagaki Rengetsu born?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "3af83a0b-1fac-41cc-a900-9b991b1fddee",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:League)<-[r0:partOfLeague]-(m0:Club)<-[r1:playsFor]-(m1:Player {name: 'Marcel Nowak'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the leagues that include a club where Marcel Nowak has played?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "21499ec7-b7ef-4f67-b114-781aca7cfe89",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture)-[r1:createdBy]->(m1:Person {name: 'El Greco'}) WITH DISTINCT n RETURN n.name, n.end_year",
    "nl_question": "What are the names and end years of art movements linked to sculptures created by El Greco?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "27af9398-3699-441d-83b0-976ede863237",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'centre forward'}) WITH DISTINCT n RETURN n.name ORDER BY n.height_cm DESC LIMIT 1",
    "nl_question": "Who is the tallest player in the centre forward position?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "bca2c9aa-2bb5-4dd9-901a-5c7de7153980",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon {name: 'Uvaroviella cavicola'}) WITH DISTINCT n RETURN n.diel_cycle",
    "nl_question": "What is the diel cycle of Uvaroviella cavicola?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "197e6df0-7b13-4761-9dc5-f12723238665",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon {name: 'Green Pheasant'}) WITH DISTINCT n WHERE n.taxon_name <> 'Insecta' RETURN n.name",
    "nl_question": "What are the names of taxa that the Green Pheasant feeds on, excluding those with the taxon name Insecta?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "9116b51c-4966-4472-92c4-beecaae2da49",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:ConservationStatus)<-[r0:hasConservationStatus]-(m0:Taxon {name: 'Brahma white-bellied rat'}) RETURN n, m0 as m UNION MATCH (n:ConservationStatus)<-[r1:hasConservationStatus]-(m1:Taxon {name: 'spotted seal'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many distinct conservation statuses are associated with either the Brahma white-bellied rat or the spotted seal?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "f751472e-5b90-4c20-a21c-ee2b2ff0c9df",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'subspecies'}),(n:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Endangered species'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods (in days) of subspecies that are classified as endangered?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "df9baf1e-0a6b-41d9-9973-a9be9e3c58f0",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Goal of the Month'}),(n:Player)-[r1:playsPosition]->(m1:Position {name: 'forward'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the forwards who have received the Goal of the Month award?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "dd3f7b9f-9228-4b13-98c5-13827764c818",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'UCL Art Museum'}),(n:Painting)-[r1:hasGenre]->(m1:Genre {name: 'portrait'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of portrait paintings displayed at the UCL Art Museum?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "fb4962ce-06e9-48b3-9100-86d39d74a7d5",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'shrubland'}) WITH DISTINCT n WHERE n.taxon_name <> 'Panthera tigris jacksoni' RETURN n.name",
    "nl_question": "What are the names of taxa that feed on species living in shrubland, excluding those named Panthera tigris jacksoni?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "53a201d3-96c1-4b22-9563-dc949bdae04f",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Italian Football Hall of Fame'}) WITH DISTINCT n UNWIND n.schools_attended AS prop RETURN DISTINCT prop",
    "nl_question": "Which unique schools have been attended by players who have received the Italian Football Hall of Fame award?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_prop_array_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n UNWIND n.${prop} AS prop RETURN DISTINCT prop"
    }
  },
  {
    "qid": "6747fed0-0c29-4041-83d6-3e6ff2c1a961",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture {name: 'Object'}), (m0:Sculpture {name: 'Bird Mask (Masque d\\'oiseau)'}) RETURN CASE WHEN n.creation_year > m0.creation_year THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Which sculpture, Object or Bird Mask (Masque d'oiseau), was created more recently?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "283a35f4-0088-40c6-9afb-3ae106b07637",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Piłka nożna magazine plebiscite'}),(n:Player)-[r1:playsFor]->(m1:Club {name: 'Borussia Dortmund'}) WITH DISTINCT n RETURN n.name, n.date_of_death",
    "nl_question": "Who are the players who have received the Piłka nożna magazine plebiscite award and have played for Borussia Dortmund, and what are their dates of death?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "ab0df0e9-6b17-4aa3-99f9-263c8f87908f",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'machine gun'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'explosive belt'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many terrorist attacks involved either a machine gun or an explosive belt?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "76019d9a-c7e2-4610-a326-c32cbbf92b11",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:perpetratedBy]->(m0:Terrorist {name: 'Shamsidin Fariduni'}) WITH DISTINCT n RETURN n.name, n.number_of_deaths",
    "nl_question": "What are the names and death tolls of terrorist attacks carried out by Shamsidin Fariduni?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "28991cc9-0807-40ca-95d3-9f8518270200",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Painting)-[r1:createdBy]->(m1:Person {name: 'Vincenzo Campi'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the genres of paintings created by Vincenzo Campi?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "8dc3e70b-6e3b-4fde-ae76-76d7538356ac",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'Portrait of Hendrik van der Zande, Jurist and Dramatic Poet in Amsterdam'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "Who is the artist of the painting titled Portrait of Hendrik van der Zande, Jurist and Dramatic Poet in Amsterdam, and where were they born?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "00ce0e8b-69bc-40d9-aa80-00a7726f4371",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Japan'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "What are the names and birthplaces of terrorists involved in attacks that took place in Japan?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "9057c171-8319-4e77-b570-06141c086f45",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:Target)<-[r0:targets]-(m0:TerroristAttack {name: '1993 World Trade Center bombing'}) RETURN n, m0 as m UNION MATCH (n:Target)<-[r1:targets]-(m1:TerroristAttack {name: 'September 11 attacks'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many targets were involved in either the 1993 World Trade Center bombing or the September 11 attacks?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "0a0fb363-d2e7-41b6-b594-4f71ebccf58b",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'VfL Wolfsburg'}),(n:Player)-[r1:receivesAward]->(m1:Award {name: 'Goal of the Month'}) WITH DISTINCT n RETURN n.name, n.height_cm",
    "nl_question": "What are the names and heights of players who have been part of VfL Wolfsburg and have received the Goal of the Month award?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "713fb688-d378-41de-ac67-c102c409d0a5",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'insect'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days DESC LIMIT 1",
    "nl_question": "Which taxon, that preys on another taxon that feeds on insects, has the longest average gestation period?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "45588afc-c8f0-4c30-b93a-10e5009b652a",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'Leporidae'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days ASC LIMIT 1",
    "nl_question": "What is the name of the taxon that preys on Leporidae and has the shortest average gestation period?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "017808f8-8d0c-418f-9acf-d0280a817a30",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'desert'}) RETURN n, m0 as m UNION MATCH (n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Efferia'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many taxa either live in the desert or are preyed upon by Efferia?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "5b096897-78a6-421a-ba78-95cc9012d678",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture {name: 'Fugitive Love by Auguste Rodin-RF 2241'}), (m0:Sculpture {name: 'doors of market church'}) RETURN CASE WHEN n.creation_year > m0.creation_year THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Which sculpture was created more recently, Fugitive Love by Auguste Rodin-RF 2241 or doors of market church?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "24595069-31d0-41fb-8432-c4442e6aa9a7",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'mannerism'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of genres that include paintings associated with the mannerism art movement, and how many such paintings are there for each genre?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "d5b20dc6-1e94-49c3-a1f5-26effc24a7c2",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:hasHomeVenue]->(m0:Venue {name: 'Mineirão'}),(n:Club)<-[r1:playsFor]-(m1:Player {name: 'José Marcelo Ferreira'}) WITH DISTINCT n RETURN n.name, n.head_coach",
    "nl_question": "What are the names of clubs that have Mineirão as their home venue and have had José Marcelo Ferreira as a player, along with their head coaches?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "0da22937-4648-49a8-87e4-92954272566e",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Neuroptera'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Tetranychidae'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of taxa that are part of Neuroptera and feed on Tetranychidae?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "91a0ea67-07a1-4ef3-83a5-9eb32585157b",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)-[r0:hasConservationStatus]->(m0:ConservationStatus {name: 'Vulnerable'}) RETURN n, m0 as m UNION MATCH (n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'tropical forest'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many taxa are either classified as Vulnerable or live in tropical forests?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "4b504e2e-74f4-46a0-ab2a-48cffffd0bd4",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'public art'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of museums that exhibit sculptures in the public art genre, and how many such sculptures does each museum display?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "c336d73a-51c5-4b45-97af-d9f2c2c7bf1f",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Fruit Torso (Torse fruit)'}),(n:Person)<-[r1:createdBy]-(m1:Painting {name: 'Untitled Project (for a rug or tapestry)'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the artists that created both the sculpture Fruit Torso (Torse fruit) and the painting Untitled Project (for a rug or tapestry)?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "36be58bd-58b7-4617-96db-bdd8ad1fff30",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'family'}) WITH DISTINCT n WHERE n.taxon_name = 'Proteles cristata' RETURN n.name",
    "nl_question": "What are the names of taxa, specifically Proteles cristata, that feed on taxa ranked at the family level?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "b2ece782-ce07-4515-9789-9cd4e591e24b",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon {name: 'Anthophora urbana'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of the taxa that are preyed upon by Anthophora urbana?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "b1b0d9c5-10a1-4d6c-afde-b630b37761ee",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'Pakistan'}) WITH DISTINCT n WHERE n.number_of_injuries < 43 RETURN n.name",
    "nl_question": "What are the names of terrorist attacks that happened in Pakistan with fewer than 43 injuries?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "9ae7ddc5-f4a4-448d-8c86-bb96d52612c7",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League)<-[r1:partOfLeague]-(m1:Club {name: 'Hamburger SV'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of clubs that are in the same league as Hamburger SV?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "9db27990-3558-44be-a022-d5d4d93972e0",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting {name: 'Edward George Villiers Stanley, 17th Earl of Derby'}), (m0:Painting {name: 'Tulip Field in Holland'}) RETURN CASE WHEN n.creation_year > m0.creation_year THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Which painting was created later, Edward George Villiers Stanley, 17th Earl of Derby or Tulip Field in Holland?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "12330fe5-3c16-46d4-9db1-62dca8aed591",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person) WITH DISTINCT n RETURN DISTINCT n.gender",
    "nl_question": "What are the unique genders of individuals?",
    "from_template": {
      "match_category": "basic_(n)",
      "match_cypher": "MATCH (n)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "c0dd03eb-165e-4154-bda0-dc7031aaba6a",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'defender'}) WITH DISTINCT n UNWIND n.nicknames AS prop RETURN DISTINCT prop",
    "nl_question": "What are the unique nicknames of players who play as defenders?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_prop_array_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n UNWIND n.${prop} AS prop RETURN DISTINCT prop"
    }
  },
  {
    "qid": "3c7d4622-6463-4ab4-9969-0aa000577ac8",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Riccardo Monguzzi'}) WHERE r0.start_year <= 1986 AND (r0.end_year >= 1986 OR r0.end_year IS NULL) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of clubs Riccardo Monguzzi played for during the year 1986?",
    "from_template": {
      "match_category": "special_time-sensitive",
      "match_cypher": "MATCH (n)<-[r0<start_year,end_year?>]-(m0<name>) WHERE r0.start_year <= ${r0_start_year} AND (r0.end_year >= ${r0_start_year} OR r0.end_year IS NULL)",
      "return_pattern_id": "n_name_special",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "8cd9cb7a-e287-419b-87ef-e436e1f568ed",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'group portrait'}) WITH DISTINCT n RETURN min(n.creation_year)",
    "nl_question": "What is the earliest creation year of paintings that belong to the group portrait genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  }
]
