[
  {
    "qid": "700c7006-b3e2-45b1-868f-3ad21c0c7fb5",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum)<-[r1:displayedAt]-(m1:Sculpture {name: 'The Old Tree'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many sculptures are displayed at the same museum as The Old Tree?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "183a1dd5-c57f-4e80-bd99-acc6bd1beaac",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Torso of a Young Woman'}) WITH DISTINCT n RETURN n.name, n.date_of_birth",
    "nl_question": "Who are the creators of the sculpture Torso of a Young Woman, and what are their birth dates?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "6bda6351-5769-450d-9be3-25f4a391c5d6",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'wing half'}) RETURN n, m0 as m UNION MATCH (n:Player)-[r1:playsFor]->(m1:Club {name: 'Paris Saint-Germain F.C.'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many players have either played as a wing half or have been part of Paris Saint-Germain F.C. at some point?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "85466522-da35-489c-a543-8e9925765bcb",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Weapon)<-[r0:employs]-(m0:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'India'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of weapons used in terrorist attacks in India, and how many such attacks employed each weapon?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "7f671676-c8ca-4765-b857-126d88231a95",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'J. Paul Getty Museum'}) OPTIONAL MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of paintings displayed at the J. Paul Getty Museum, and how many different genres does each painting belong to?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "e1a4deb8-11ae-4dfe-a2d5-dfcb969d589f",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Landon Donovan MVP Award'}) WITH DISTINCT n RETURN n.name, n.date_of_death",
    "nl_question": "What are the names and dates of death of players who have received the Landon Donovan MVP Award?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "f3f1c8e6-25d8-4e08-ac21-ae274369a275",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist {name: 'Petter Kristian Kyvik'}) WITH DISTINCT n RETURN n.country_of_citizenship",
    "nl_question": "Which country is Petter Kristian Kyvik a citizen of?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "d1106df0-0d8d-463a-bb9a-cf95f73d606f",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r1:partOfLeague]->(m1:League {name: 'Lega Pro Seconda Divisione'}) OPTIONAL MATCH (n:Club)-[r0:hasHomeVenue]->(m0:Venue) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of all clubs that are part of the Lega Pro Seconda Divisione, and how many venues have served as their home, either currently or in the past?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "70963aff-a4e4-42ae-850a-97032515ce0e",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person {name: 'Parmigianino'}), (m0:Person {name: 'El Greco'}) RETURN n.gender = m0.gender AS answer",
    "nl_question": "Do Parmigianino and El Greco share the same gender?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "c275e3a9-7bac-4e81-9e33-b5a61e3bc9d6",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'analytical cubism'}) WITH DISTINCT n WHERE n.creation_year = 1910 RETURN n.name",
    "nl_question": "What are the names of paintings linked to the analytical cubism movement that were created in the year 1910?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "fc48554c-904b-4e67-a583-e7dda732a478",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'The Earth and Moon'}),(n:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'The Fall of the Angels'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "Who are the individuals who created both The Earth and Moon and The Fall of the Angels, and what is their gender?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "dbeb3cbc-fbe6-45ac-9a04-9da870186464",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'Euphausiacea'}),(n:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Balaenoptera'}) WITH DISTINCT n WHERE n.taxon_name <> 'Balaenoptera musculus' RETURN n.name",
    "nl_question": "What are the names of taxa that feed on Euphausiacea and have Balaenoptera as a parent, excluding those named Balaenoptera musculus?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "0570550b-8b39-4228-83d8-d19663ccc332",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'Neptune (Sète)'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many sculptures were created by the same person who made Neptune (Sète)?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "083b028d-f096-4031-b3a1-0fa2c7298045",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'Ohara Museum of Art'}),(n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'mannerism'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of paintings that are displayed at the Ohara Museum of Art and are associated with the Mannerism art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "3efb1b66-4bd9-4a76-af3c-d8ad2fc36a42",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'self-portrait'}),(n:Painting)-[r1:createdBy]->(m1:Person {name: 'Parmigianino'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC",
    "nl_question": "What are the names of self-portraits painted by Parmigianino, sorted from the most recent to the oldest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "1181084f-4869-4d3c-90b8-2470e4ef4fc5",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'Recostada'}) WITH DISTINCT n RETURN n.name, n.date_of_death",
    "nl_question": "Who are the individuals who created the painting Recostada, and when did they pass away?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "8f02e9af-63d4-4cab-a779-96cd8e091c3a",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: 'Championnat National'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of clubs that are part of the Championnat National league?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "122b340f-3d2f-4a0d-b98c-87b81f27171b",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Dicaeum'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Araneae'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxonomic names of taxa that have Dicaeum as a parent and feed on Araneae?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "d509d986-9e24-4e99-be2a-fdf81883555b",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'hand grenade'}),(n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Spain'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks in Spain that involved the use of a hand grenade?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "ab1fa534-06ff-497f-b765-6665f22a1e46",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Target)<-[r0:targets]-(m0:TerroristAttack)-[r1:targets]->(m1:Target {name: 'United States Capitol'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of targets that have been attacked by the same terrorist attacks targeting the United States Capitol, and how many such attacks have targeted each of them?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "d35a332b-74ea-4d9f-9e8c-a5ca67a778a8",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Award)<-[r0:receivesAward]-(m0:Player {name: 'Luís Figo'}),(n:Award)<-[r1:receivesAward]-(m1:Player {name: 'Fabio Cannavaro'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of awards received by both Luís Figo and Fabio Cannavaro?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "26a3b2e8-b614-478c-9c4e-d94419ba2cd0",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'Russia'}),(n:TerroristAttack)-[r1:perpetratedBy]->(m1:Terrorist {name: 'Shamsidin Fariduni'}) WITH DISTINCT n RETURN n.name, n.number_of_deaths",
    "nl_question": "What are the names and death tolls of terrorist attacks that took place in Russia and were carried out by Shamsidin Fariduni?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "ac60b36d-36b3-419a-af04-68e8ce8446f6",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'aphid'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Horntail'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that feed on both aphids and Horntails?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "bdcecf31-c83f-4b03-866b-bf44531b9cb6",
    "graph": "biology",
    "gold_cypher": "MATCH (n:TaxonRank)<-[r0:hasRank]-(m0:Taxon {name: 'Scrobipalpa'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the taxonomic ranks assigned to Scrobipalpa?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "5aff1868-fe8a-419c-945c-80d424c27009",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: 'National Premier Leagues NSW'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many clubs are part of the National Premier Leagues NSW?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "93f38b01-86d4-40e4-9cf9-a463efe494f6",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Gnetum'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans of taxa that feed on species whose parent is Gnetum?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "cbe70c98-4bfd-49a3-b58d-71bcbf4af530",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'group of sculptures'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'Impressionism'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many sculptures are either classified as a group of sculptures or linked to the Impressionism art movement?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "fba47623-42a7-4303-a616-43fa7aba3f96",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'OGC Nice'}) WHERE r0.start_year <= 1948 AND (r0.end_year >= 1948 OR r0.end_year IS NULL) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the players who were part of OGC Nice in the year 1948?",
    "from_template": {
      "match_category": "special_time-sensitive",
      "match_cypher": "MATCH (n)-[r0<start_year,end_year?>]->(m0<name>) WHERE r0.start_year <= ${r0_start_year} AND (r0.end_year >= ${r0_start_year} OR r0.end_year IS NULL)",
      "return_pattern_id": "n_name_special",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "2edface4-05ff-4d5f-9857-170211cb9b1f",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Least Concern'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days ASC LIMIT 1",
    "nl_question": "What is the name of the taxon, fed on by a species with a conservation status of Least Concern, that has the shortest average gestation period?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "e2a8abdd-6b1d-4d32-be4d-ce206ede636a",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Joseph Beuys'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of art movements linked to sculptures created by Joseph Beuys?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "53f9b998-c78a-4de5-93f6-b2dbe9b106c6",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Sculpture {name: 'The Shade'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of museums where The Shade is displayed?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "7492eb40-e9b7-402b-bc51-098482ccf694",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Habitat)<-[r0:inhabits]-(m0:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Efferia'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of habitats occupied by species that are preyed upon by Efferia?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "489c5d5b-4c74-4b5b-9d86-52d24345ef84",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Jan Mandijn'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year ASC LIMIT 1",
    "nl_question": "What is the name of the earliest painting created by Jan Mandijn?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "63790fd5-c4cd-4a84-863c-64feea80d450",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'defender'}) WITH DISTINCT n UNWIND n.schools_attended AS prop RETURN DISTINCT prop",
    "nl_question": "What are the unique schools attended by players who play as defenders?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_prop_array_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n UNWIND n.${prop} AS prop RETURN DISTINCT prop"
    }
  },
  {
    "qid": "5b535ac7-5372-46e0-a6fc-3cd58e0add3c",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack {name: '2019 El Paso shooting'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "Who are the terrorists responsible for the 2019 El Paso shooting, and what are their genders?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "1daa08e6-92cd-4109-b858-dfce01eef899",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'steppe'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names of taxa that live in the steppe, along with their average gestation periods in days?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "7d7c3e83-cf75-450f-a742-4738703ef0f5",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'Naturalism'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of art movements linked to paintings that are associated with Naturalism?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "70456545-2bc7-468c-a9d4-ee3a3ffdc526",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'Baroque'}),(n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'mannerism'}) WITH DISTINCT n RETURN DISTINCT n.country_of_origin",
    "nl_question": "Which countries are the origin of paintings that are linked to both the Baroque and Mannerism art movements?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "dbe689cc-8ae7-4351-8bfc-bf56e72cec8a",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person {name: 'Ōtagaki Rengetsu'}) WITH DISTINCT n RETURN n.gender",
    "nl_question": "What is Ōtagaki Rengetsu's gender?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "6d077e1d-beae-4e84-a858-82ef95367b0d",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'grassland'}) RETURN n, m0 as m UNION MATCH (n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'Chaparral'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that live in either grassland or Chaparral habitats?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "de871e87-e35d-4059-8834-f4cb9ccdeda6",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Sculpture {name: 'The Triumph of the Republic'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the genres associated with the sculpture The Triumph of the Republic?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "9fee6a44-2d8d-42d6-bb52-05f1d61c8317",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: '1981 Iranian Prime Minister\\'s office bombing'}), (m0:TerroristAttack {name: 'Huanggutun Incident'}) RETURN n.number_of_deaths = m0.number_of_deaths AS answer",
    "nl_question": "Do the 1981 Iranian Prime Minister's office bombing and the Huanggutun Incident result in the same number of deaths?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "12f8ba56-76ef-430b-bb60-f8a54a470a9b",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'Romantic painting'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year ASC LIMIT 1",
    "nl_question": "What is the name of the earliest painting associated with the Romantic painting movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "e5e5fa1c-bdad-4d76-8b63-4f3c14118446",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'attacking midfielder'}),(n:Player)-[r1:playsPosition]->(m1:Position {name: 'inside forward'}) WITH DISTINCT n RETURN n.name, n.date_of_death",
    "nl_question": "What are the names and dates of death of players who have played both as an attacking midfielder and an inside forward?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "cb7747d4-b2bc-4635-a677-e492f648a373",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'order'}) WITH DISTINCT n RETURN count(DISTINCT n.diel_cycle)",
    "nl_question": "How many unique diel cycles are there for taxa that feed on organisms ranked at the order level?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "a5cdaee0-0320-431f-9748-772ae21ba3e3",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Position)<-[r0:playsPosition]-(m0:Player)-[r1:playsPosition]->(m1:Position {name: 'inside forward'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of positions played by players who also play as inside forwards, and how many such players are there for each position?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "6f496558-34e9-47bc-ae73-701e2f69b736",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Museum)<-[r0:displayedAt]-(m0:Painting {name: 'Study for \"Negro Boy Dancing\": The Boy'}) RETURN n, m0 as m UNION MATCH (n:Museum)<-[r1:displayedAt]-(m1:Sculpture {name: 'Summer'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many museums have displayed either the painting \"Study for Negro Boy Dancing: The Boy\" or the sculpture \"Summer\"?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "a2d0a2e9-5aae-4a41-8e14-934e2d68eac1",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre)<-[r1:hasGenre]-(m1:Painting {name: 'Portrait of Anna Constantia de Beijwegh'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of sculptures that share a genre with the painting Portrait of Anna Constantia de Beijwegh, and how many such genres do they share?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "60f0a085-9bb4-49ee-bdba-8078d3f7d878",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture {name: 'Premier Artiste'}), (m0:Sculpture {name: 'Three Faunesses'}) RETURN n.creation_year = m0.creation_year AS answer",
    "nl_question": "Were Premier Artiste and Three Faunesses created in the same year?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  }
]
