[
  {
    "qid": "83795d2c-ebd0-4761-9673-3830a5b3b65c",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Habitat)<-[r0:inhabits]-(m0:Taxon {name: 'Murina gracilis'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the habitats where Murina gracilis lives?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "cd96968a-fa6f-48ef-8d00-57f8213e9fed",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'temperate coniferous forest'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names of taxa that live in temperate coniferous forests, along with their longest lifespan in years?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "4a5923c6-ba6b-454c-96c9-39cf5eb07af3",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Gerrit Lundens'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year ASC LIMIT 1",
    "nl_question": "What is the name of the earliest painting created by Gerrit Lundens?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "510a60c9-27a0-4398-9530-41b5701a6cd3",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Bravo Award'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the players that have received the Bravo Award?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "c0ec130f-dd56-407c-8ae0-efd4bd6e4ce7",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Target)<-[r0:targets]-(m0:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Egypt'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of targets of terrorist attacks that took place in Egypt, and how many such attacks targeted each of them?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "9ecea2a5-2940-474a-8060-9de42bc72086",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'L\\'Été'}) RETURN n, m0 as m UNION MATCH (n:Person)<-[r1:createdBy]-(m1:Painting {name: 'Woman study'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the artists who created either the sculpture L'Été or the painting Woman study?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "21796c1f-393d-44ec-b67c-f1ddf2fdc2d7",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'cave'}),(n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'shrubland'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans in years of taxa that live in both caves and shrublands?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "d8958e3b-b71c-4af5-974d-22fe36a79bd0",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'Pakistan'}) WITH DISTINCT n UNWIND n.locations AS prop RETURN DISTINCT prop",
    "nl_question": "What are the unique locations of terrorist attacks that have taken place in Pakistan?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_prop_array_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n UNWIND n.${prop} AS prop RETURN DISTINCT prop"
    }
  },
  {
    "qid": "c370db0a-29cd-4124-ba21-64af3b62828b",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Target)<-[r0:targets]-(m0:TerroristAttack)-[r1:perpetratedBy]->(m1:Terrorist {name: 'Kiyotaka Tonozaki'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of targets of terrorist attacks carried out by Kiyotaka Tonozaki?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "1c39a246-fe19-4901-ac3f-325d59bd0374",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'United States of America'}) WITH DISTINCT n WHERE n.number_of_injuries < 270 RETURN n.name",
    "nl_question": "What are the names of terrorist attacks that happened in the United States of America with fewer than 270 injuries?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "88cdfe99-0ac7-4e4e-beb3-292b0fd5297a",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'centre forward'}) WITH DISTINCT n UNWIND n.country_of_citizenship AS prop RETURN DISTINCT prop",
    "nl_question": "What are the unique countries of citizenship of players who play as centre forwards?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_prop_array_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n UNWIND n.${prop} AS prop RETURN DISTINCT prop"
    }
  },
  {
    "qid": "bd1922dc-245e-4c56-97ea-980fd35bc15f",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: '2. Liga Interregional'}) WITH DISTINCT n RETURN n.name, n.head_coach",
    "nl_question": "What are the names of clubs in the 2. Liga Interregional and who are their head coaches?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "a031901f-5d0e-4a07-9239-b944490f5806",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'Art Deco'}),(n:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Félix Févola'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures linked to the Art Deco movement and created by Félix Févola?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "8c8f53e3-c07d-402d-9655-71703b8be391",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'bust'}) OPTIONAL MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of sculptures classified as busts, and how many different genres does each of them belong to?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "0e162f85-a6a7-477e-a39e-bfb4904f9264",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Théodore Rousseau'}),(n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Philadelphia Museum of Art'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC",
    "nl_question": "What are the names of paintings created by Théodore Rousseau and displayed at the Philadelphia Museum of Art, listed from the most recent to the oldest based on their creation year?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "1f5ee8ff-b6b6-426c-ae6a-31ff99dd6101",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'subcohort'}) WITH DISTINCT n RETURN count(DISTINCT n.diel_cycle)",
    "nl_question": "How many unique diel cycles are there among taxa with the rank of subcohort?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "dafcaf4b-d25a-4087-8e1d-d4968b332f2d",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Claude Monet'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Columbia Museum of Art'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many paintings were either created by Claude Monet or displayed at the Columbia Museum of Art?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "15fca613-4a59-4d26-a7fe-40c24fdecfe8",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'car bomb'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "What are the names and genders of terrorists who carried out attacks using a car bomb?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "09520126-dfec-4099-9120-3a48d0f1d58f",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'bolt-action rifle'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:targets]->(m1:Target {name: 'Al Noor Mosque'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks that used a bolt-action rifle or targeted the Al Noor Mosque?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "2f17d4bc-1f27-4399-b194-05521ab8a65a",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)-[r0:hasConservationStatus]->(m0:ConservationStatus {name: 'Endangered species'}) RETURN n, m0 as m UNION MATCH (n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'mountain forest'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many taxa are either classified as endangered species or live in mountain forests?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "2b688e99-dfb3-4547-a4cd-7127b740a8e9",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Weapon)<-[r0:employs]-(m0:TerroristAttack {name: 'Bærum mosque shooting'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many different weapons were used in the Bærum mosque shooting?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "3414b571-3109-4678-9f9e-075de86052f1",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat)<-[r1:inhabits]-(m1:Taxon {name: 'Tanimbar Starling'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days ASC LIMIT 1",
    "nl_question": "Which taxon, sharing a habitat with the Tanimbar Starling, has the shortest average gestation period?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "280811fe-e66a-4655-b732-9e5cfb7d0944",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Weapon) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many distinct weapons are there?",
    "from_template": {
      "match_category": "basic_(n)",
      "match_cypher": "MATCH (n)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "82471faf-3d4f-4d41-b104-3a64b9a2a1d0",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'mannerism'}),(n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'Baroque'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of paintings linked to both the Mannerism and Baroque art movements?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "7af2ddd8-7596-4dfa-81f8-ab0aa1f12ca2",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'Portrait of Edward Taylor Snow'}),(n:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'Arcadia'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "Who are the individuals who created both the painting Portrait of Edward Taylor Snow and the sculpture Arcadia, and what is their gender?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "914dde0f-e9e6-4d89-bcce-71e2b89325cc",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r1:createdBy]->(m1:Person {name: 'Jacopo Tintoretto'}) OPTIONAL MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of paintings created by Jacopo Tintoretto, and how many art movements is each associated with?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "f2390894-9fbc-44f2-a360-b8d5192df768",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Ballon d\\'Or'}),(n:Player)-[r1:receivesAward]->(m1:Award {name: 'Pichichi Trophy'}) WITH DISTINCT n RETURN n.name, n.nicknames",
    "nl_question": "Who are the players who have won both the Ballon d'Or and the Pichichi Trophy, and what are their nicknames?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "9c678307-1e5c-4bd7-a6f5-8aff576f6b2f",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person)<-[r1:createdBy]-(m1:Painting {name: 'Portrait of Professor W. D. Marks'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC",
    "nl_question": "What are the names of paintings created by the same artist who painted Portrait of Professor W. D. Marks, listed from the most recent to the oldest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "fae81202-bfb9-4210-a295-d9eb1ffae868",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'portrait miniature'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many paintings are classified under the genre of portrait miniature?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "3e3b28ba-4ee8-42f6-ace1-54f79013d678",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'animal sculpture'}) WITH DISTINCT n RETURN n.name, n.date_of_birth",
    "nl_question": "Who are the artists who created animal sculptures, and what are their birth dates?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "e62f3d5a-c9da-47ea-90e3-0b926973d964",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'beetles'}),(n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'grassland'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and maximum lifespan in years of taxa that feed on beetles and live in grasslands?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "839cff0b-c8df-4933-a4ab-03b6caca42a6",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting {name: 'Belle-Île Rocks'}),(n:ArtMovement)<-[r1:associatedWith]-(m1:Painting {name: 'Rouen Cathedral Series'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of art movements linked to both the Belle-Île Rocks and the Rouen Cathedral Series paintings?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "d3fca728-9d4a-42f3-b22e-19127d765542",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'Landscape with Cattle'}) WITH DISTINCT n RETURN n.name, n.date_of_birth",
    "nl_question": "Who are the creators of the painting Landscape with Cattle, and what are their birth dates?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "ee70ba66-2b6a-4527-a426-edf68e4835c5",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Emanuele Berrettoni'}), (m0:Player {name: 'Simone Cavalli'}) RETURN CASE WHEN n.height_cm > m0.height_cm THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Who is taller, Emanuele Berrettoni or Simone Cavalli?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "cdb1e5f6-1b61-40ef-a536-08756d88b49b",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Giulio Romano'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'High Renaissance'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings either created by Giulio Romano or linked to the High Renaissance art movement?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "54d9268c-6979-4ea2-9533-91392eed50f8",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'insect'}) OPTIONAL MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of all taxa that feed on insects, along with the number of habitats each one inhabits.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "6c1eae94-c4fe-4448-a7d7-41375ebe9599",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Diego Velázquez'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Philadelphia Museum of Art'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many paintings were either created by Diego Velázquez or are displayed at the Philadelphia Museum of Art?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "47456e17-5015-43a2-9da9-2e7443fff59e",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'self-portrait'}),(n:Painting)-[r1:createdBy]->(m1:Person {name: 'Parmigianino'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of self-portraits created by Parmigianino?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "af3300dd-fe56-4f0c-8a9e-f36259e36b7b",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Iberian lynx'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of the species that are preyed upon by the prey of the Iberian lynx, and how many of the Iberian lynx's prey feed on each of them?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "7a7cab65-dc7c-482f-ad66-53e6b320cdf4",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Near Threatened'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of taxa that are preyed upon by taxa with a conservation status of Near Threatened, and how many Near Threatened taxa feed on each of them?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "3a3bdf1b-946d-42c8-903d-7b85974982ea",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'group of sculptures'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'Luxembourg Museum'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many sculptures are either classified as a group of sculptures or exhibited at the Luxembourg Museum?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "4f6ed283-241c-4255-b3d0-4b3a903e6894",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'James Rosati'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC",
    "nl_question": "What are the names of sculptures made by James Rosati, listed from the most recent to the oldest based on their creation year?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "33ffa859-7ec3-4748-8179-f79b8740c7ca",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: '2. Liga Interregional'}) WITH DISTINCT n RETURN n.name, n.owners",
    "nl_question": "What are the names and owners of clubs that are part of the 2. Liga Interregional?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "14d7634f-4aaf-4f69-a9d8-20472eeb9721",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'portrait'}),(n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'High Renaissance'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of portrait paintings associated with the High Renaissance?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "e91ae293-f772-49d1-a049-a8dd57d616bf",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'French Player of the Year'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "Provide the names and birthplaces of players who have received the French Player of the Year award.",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "b5871539-3eff-4472-8a7b-03966f4d024b",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'Early Netherlandish painting'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:createdBy]->(m1:Person {name: 'Master of the Bruges Legend of St. Ursula'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings linked to the Early Netherlandish painting movement or created by the Master of the Bruges Legend of St. Ursula?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "ce7772ee-f4b7-48b7-8e61-94b6c37c0819",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Silbernes Lorbeerblatt'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the players that have received the Silbernes Lorbeerblatt award?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  }
]
