[
  {
    "qid": "1211737e-e43a-4eb8-90c5-0f1a0efc7b9a",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'shrubland'}),(n:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Oreostruthus'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that live in shrubland and have Oreostruthus as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "893cfe8f-9b5a-4b78-ab39-c7553720ddc9",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club)-[r1:partOfLeague]->(m1:League {name: 'Slovenian Third League'}) WITH DISTINCT n RETURN n.name ORDER BY n.mass_kg ASC LIMIT 1",
    "nl_question": "Who is the lightest player to have ever played for a club in the Slovenian Third League?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "ccfcf5b0-7ee5-4faa-9ef4-e65ace3dcb77",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Gaston Veuvenot Leroux'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC LIMIT 1",
    "nl_question": "What is the name of the most recently created sculpture by Gaston Veuvenot Leroux?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "630d2d19-5df3-4bc3-aefb-a38926075f9a",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Weapon)<-[r0:employs]-(m0:TerroristAttack {name: '2013 Sana\\'a attack'}),(n:Weapon)<-[r1:employs]-(m1:TerroristAttack {name: '1987 Zaragoza Military Bus bombing'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of weapons used in both the 2013 Sana'a attack and the 1987 Zaragoza Military Bus bombing?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "9834bc19-9fd2-4302-b561-e7945de2852e",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Psammophiinae'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of the grandparents of the taxon Psammophiinae?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "969405a1-063a-4c12-938d-f44bf0a2f56f",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Habitat)<-[r0:inhabits]-(m0:Taxon {name: 'Daurian hedgehog'}),(n:Habitat)<-[r1:inhabits]-(m1:Taxon {name: 'argali'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of habitats shared by both the Daurian hedgehog and the argali?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "18cdaafc-23b6-4d12-be7a-fcca22bf1dba",
    "graph": "biology",
    "gold_cypher": "MATCH (n:ConservationStatus)<-[r0:hasConservationStatus]-(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'European rabbit'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many different conservation statuses are there for taxa that feed on the European rabbit?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "3accb5a9-027f-4ea3-874b-811fea45f4bd",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'midfielder'}),(n:Player)-[r1:playsPosition]->(m1:Position {name: 'forward'}) WITH DISTINCT n RETURN n.name ORDER BY n.date_of_death DESC",
    "nl_question": "What are the names of players who play both as a midfielder and a forward, sorted by their date of death from the most recent to the oldest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "58c06e3c-fc76-4a1a-9cf5-821411ccda0d",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club)-[r1:partOfLeague]->(m1:League {name: 'Indonesian Premier League'}) WITH DISTINCT n RETURN DISTINCT n.gender",
    "nl_question": "What are the different genders of players who have been part of a club in the Indonesian Premier League?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "9f62be9c-b09c-40c4-9af6-0186d49e258a",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:perpetratedBy]->(m0:Terrorist {name: 'Alessio Casimirri'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Italy'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks either carried out by Alessio Casimirri or that took place in Italy?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "94885aef-4af3-4345-bf18-6f9b9027d2fb",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Franco Selvaggi'}) WITH DISTINCT n RETURN DISTINCT n.country",
    "nl_question": "Which countries have clubs that Franco Selvaggi has played for at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "912dc985-90a6-4285-b1df-df2e59dd73ac",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting)-[r1:hasGenre]->(m1:Genre {name: 'genre art'}) WITH DISTINCT n RETURN n.name ORDER BY n.start_year DESC LIMIT 1",
    "nl_question": "What is the name of the art movement most recently associated with paintings in the genre art style?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "12c6616f-066f-495c-92c6-d2ff36e7eae5",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'Impressionism'}),(n:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'modern art'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures linked to both Impressionism and modern art?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "84b22cb5-a77d-48d1-bbe6-5352aec4d78b",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position)<-[r1:playsPosition]-(m1:Player {name: 'Oliver Christensen'}) WITH DISTINCT n UNWIND n.schools_attended AS prop RETURN DISTINCT prop",
    "nl_question": "What are the unique schools attended by players who play the same position as Oliver Christensen?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_prop_array_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n UNWIND n.${prop} AS prop RETURN DISTINCT prop"
    }
  },
  {
    "qid": "219e4c02-f9fc-4807-8954-b5964dc2ddd7",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Weapon)<-[r0:employs]-(m0:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Turkey'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many distinct weapons are used in terrorist attacks that take place in Turkey?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "92fcfd30-1ac7-4c65-a10f-6cef414fb5ce",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'estuary'}),(n:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'species'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods of species that live in estuaries?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "982276cb-7a45-4418-bf8c-670afd6f44af",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Award)<-[r0:receivesAward]-(m0:Player)-[r1:playsFor]->(m1:Club {name: 'Atlético Madrid'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many awards have been received by players who have played for Atlético Madrid at some point?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "a95267ca-57a5-4f0b-b660-f7ab98dadb93",
    "graph": "biology",
    "gold_cypher": "MATCH (n:ConservationStatus)<-[r0:hasConservationStatus]-(m0:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Humpback Whale'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the conservation statuses of the species that are preyed upon by the Humpback Whale?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "d3644e8d-e4e9-4ac5-a2b5-bf5393e3145e",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'Leporidae'}) WITH DISTINCT n RETURN count(DISTINCT n.diel_cycle)",
    "nl_question": "How many different diel cycles are there for taxa that feed on Leporidae?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "83389ebb-c4a9-4ea3-a68e-e4a0539f0ba6",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Angelica Kauffmann'}),(n:Painting)-[r1:hasGenre]->(m1:Genre {name: 'group portrait'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of paintings made by Angelica Kauffmann that are group portraits?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "1f2e3727-e8f7-4a4f-b486-355eace073d0",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre)<-[r1:hasGenre]-(m1:Painting {name: 'The lamentation over the dead Christ'}) WITH DISTINCT n RETURN count(DISTINCT n.country_of_origin)",
    "nl_question": "How many countries of origin are there for sculptures that share the same genre as the painting The Lamentation Over the Dead Christ?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "e56870a7-497a-46ba-9807-34765eb8a6d1",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum)<-[r1:displayedAt]-(m1:Sculpture {name: 'The Old Tree'}) WITH DISTINCT n RETURN count(DISTINCT n.country_of_origin)",
    "nl_question": "How many different countries of origin are there for sculptures displayed at the same museum as The Old Tree?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "d616b940-0ad1-4e2c-9933-328fe5187a69",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: 'Dolphinarium discotheque suicide bombing'}), (m0:TerroristAttack {name: '2014 Dijon attack'}) RETURN n.number_of_injuries = m0.number_of_injuries AS answer",
    "nl_question": "Do the Dolphinarium discotheque suicide bombing and the 2014 Dijon attack result in the same number of injuries?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "fb83a96c-ee0d-4204-8686-2f727187239c",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'wolf'}) WITH DISTINCT n RETURN n.name ORDER BY n.longest_lifespan_years ASC",
    "nl_question": "What are the names of taxa that are preyed upon by animals that wolves feed on, sorted by their longest lifespan from shortest to longest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "0c16079a-ca40-4885-b98c-4e2daa855b2c",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Gerrit Lundens'}),(n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Amsterdam Museum'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings created by Gerrit Lundens and displayed at the Amsterdam Museum?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "f8404902-007e-4b1c-9d35-54789bf7a8fb",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player)-[r1:playsFor]->(m1:Club {name: 'Al-Ahli'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of clubs that have players who have also played for Al-Ahli at some point?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "a415821d-8d00-4829-a55d-cb086c8b4398",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'nude'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of museums that exhibit nude sculptures, and how many such sculptures are displayed at each museum?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "acf7ed1f-a346-45ee-9d3b-a53ca6ae3b90",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: '2. Liga Interregional'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of clubs that are part of the 2. Liga Interregional?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "2893b30e-f21a-4e51-b8d9-1b7b5bc471d1",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club {name: 'Unione Sportiva Peloro'}), (m0:Club {name: 'Oldham Athletic A.F.C.'}) RETURN n.country = m0.country AS answer",
    "nl_question": "Are Unione Sportiva Peloro and Oldham Athletic A.F.C. based in the same country?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "f6c6bbaf-8dda-4f12-87e1-7aa4eee957c4",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'attacking midfielder'}),(n:Player)-[r1:playsPosition]->(m1:Position {name: 'inside forward'}) WITH DISTINCT n RETURN n.name, n.date_of_birth",
    "nl_question": "Who are the players who play both as attacking midfielders and inside forwards, and what are their dates of birth?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "7f0035fe-f30c-4882-9490-4f93c56ca286",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'centre forward'}) WITH DISTINCT n RETURN n.name, n.mass_kg",
    "nl_question": "What are the names and weights in kilograms of players who play as centre forwards?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "3a69f990-b9cd-4bdb-b3b9-5250e5cc8292",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack) WITH DISTINCT n UNWIND n.locations AS prop RETURN DISTINCT prop",
    "nl_question": "What are the unique locations where terrorist attacks have occurred?",
    "from_template": {
      "match_category": "basic_(n)",
      "match_cypher": "MATCH (n)",
      "return_pattern_id": "n_prop_array_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n UNWIND n.${prop} AS prop RETURN DISTINCT prop"
    }
  },
  {
    "qid": "2da909ed-851c-4484-8413-1401d897596d",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'trompe-l\\'œil'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of paintings that belong to the trompe-l'œil genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "6349d502-ee86-4396-99c3-376da3bcb830",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon {name: 'Green Pheasant'}) WITH DISTINCT n RETURN count(DISTINCT n.diel_cycle)",
    "nl_question": "How many different diel cycles are there for the taxa that the Green Pheasant preys on?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "17f79a07-7590-4e67-b24e-8204e379c870",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Frédéric Montenard'}) WITH DISTINCT n RETURN max(n.creation_year)",
    "nl_question": "What is the latest creation year of paintings made by Frédéric Montenard?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "b3cfac5a-8bc6-41b7-bb53-9befcdb86d79",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'conceptual art'}),(n:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'avant-garde'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures that belong to the conceptual art genre and are associated with the avant-garde movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "0288f04f-fbe5-4cf3-b437-1a460a3b2354",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'The Pond, Snow Effect'}),(n:Person)<-[r1:createdBy]-(m1:Painting {name: 'Valley of the Petite Creuse'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the artists that created both The Pond, Snow Effect and Valley of the Petite Creuse?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "5ebfe5de-ffb1-4cf2-9322-53329387ce9c",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club {name: 'ACR Siena 1904'}) WITH DISTINCT n RETURN n.country",
    "nl_question": "Which country is ACR Siena 1904 based in?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "8302df48-9361-4ebf-ba6f-9a6e457ddff5",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'VfL Wolfsburg'}) WITH DISTINCT n RETURN DISTINCT n.footedness",
    "nl_question": "What are the different footedness types of players who have played for VfL Wolfsburg at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "6d7e9d71-384a-4d1e-8b3c-00d472565ee3",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:perpetratedBy]->(m0:Terrorist {name: 'Khairi Alqam'}),(n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Israel'}) WITH DISTINCT n RETURN n.name, n.number_of_deaths",
    "nl_question": "What are the names and death tolls of terrorist attacks carried out by Khairi Alqam in Israel?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "f88b46ae-2bcf-4ecd-a69e-9e0176b5ea7e",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Mustela'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans of the parents of taxa that feed on Mustela?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "3983ba91-0988-4ae1-9681-1989c323de5e",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'superphylum'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa that have the rank of superphylum?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "00094325-35a9-42c8-bd1e-6b49fc8c2e98",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'Denmark'}) WITH DISTINCT n RETURN n.name, n.locations",
    "nl_question": "What are the names and locations of terrorist attacks that took place in Denmark?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "ee4bb590-13ce-4947-aeff-19cd8314bf09",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'French Player of the Year'}) WITH DISTINCT n RETURN n.name, n.footedness",
    "nl_question": "Who are the players who have received the French Player of the Year award, and what is their footedness?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "d63de3f0-5de1-4116-b4c0-f083bf419226",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Sebastián Leto'}) WITH DISTINCT n RETURN n.height_cm",
    "nl_question": "What is Sebastián Leto's height in centimeters?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "d7163f79-2ebd-465b-9e23-3684f36d2248",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Bravo Award'}) WITH DISTINCT n RETURN n.name ORDER BY n.mass_kg DESC",
    "nl_question": "Who are the players who have received the Bravo Award, listed from the heaviest to the lightest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "81a77f98-d7f5-4279-b249-78a44b4fd015",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'FIFA World Player of the Year'}) WITH DISTINCT n RETURN n.name, n.nicknames",
    "nl_question": "Who are the players who have received the FIFA World Player of the Year award, and what are their nicknames?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "1e8e4690-0f07-46f5-bfa0-e39902b76657",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'subspecies'}),(n:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Critically Endangered'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans in years of subspecies that are critically endangered?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "c3503799-ce84-49a2-a399-7373a4c10691",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:perpetratedBy]->(m0:Terrorist {name: 'Santiago Salvador Franch'}) WITH DISTINCT n RETURN n.name, n.number_of_deaths",
    "nl_question": "What are the names and death tolls of terrorist attacks carried out by Santiago Salvador Franch?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "f71b0d78-10c4-4ffc-b696-33271d87f3ca",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Harvard Art Museums'}) WITH DISTINCT n RETURN n.name ORDER BY n.date_of_birth DESC LIMIT 1",
    "nl_question": "Who is the youngest artist whose painting is displayed at the Harvard Art Museums?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  }
]
