[
  {
    "qid": "f162c5a4-8598-497f-9612-5a1bfd5c5865",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'species'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Carya'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of species that feed on Carya?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "371c30cb-6bf7-46de-8f7d-a925d84bb702",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'gopher tortoise'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of the parents of taxa that feed on the gopher tortoise?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "630083d6-5af8-4e62-a7d8-566463ad528b",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player)-[r1:receivesAward]->(m1:Award {name: 'Master of Sport of the USSR, International Class'}) WITH DISTINCT n RETURN n.name, n.owners",
    "nl_question": "What are the names and owners of clubs that have had players who received the Master of Sport of the USSR, International Class award?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "8e2c20ba-dd4a-4177-9ea7-991c0f20bf7b",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Untitled I'}),(n:Person)<-[r1:createdBy]-(m1:Painting {name: 'Sun and Pylon'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of individuals who created both the sculpture Untitled I and the painting Sun and Pylon?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "1ca6d355-f213-46dc-9e79-0ce2abd1b021",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Félix Lacuesta'}), (m0:Player {name: 'Valerio Majo'}) RETURN n.gender = m0.gender AS answer",
    "nl_question": "Do Félix Lacuesta and Valerio Majo share the same gender?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "ccf48b06-3303-4167-a7ef-264f036fc634",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'subphylum'}) WITH DISTINCT n WHERE n.longest_lifespan_years >= 9 RETURN n.name",
    "nl_question": "What are the names of taxa that feed on subphylum-ranked taxa and have a lifespan of at least nine years?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "219abaf3-bbca-4857-84e8-c1648a121555",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'shrubland'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods (in days) of taxa whose parents live in shrubland?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "9e830056-eda5-47c1-b313-2dcb1ef3627f",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Award)<-[r0:receivesAward]-(m0:Player)-[r1:receivesAward]->(m1:Award {name: 'UEFA Team of the Year'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of awards received by players who have also been named in the UEFA Team of the Year, and how many such players have received each award?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "a9f73b90-ee98-4e4d-bc04-0212a8323c47",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Alethinophidia'}),(n:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'family'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of taxa that belong to the family rank and have Alethinophidia as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "e43a375a-72fa-466f-a876-f8d9458b0c05",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Marcos Miranda'}),(n:Club)<-[r1:playsFor]-(m1:Player {name: 'Giuliano Bertarelli'}) WITH DISTINCT n RETURN n.name, n.owners",
    "nl_question": "What are the names and owners of clubs where both Marcos Miranda and Giuliano Bertarelli have played?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "558a79b7-712d-47b2-83f8-469e3bdc045f",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Museum of Modern Art'}) OPTIONAL MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of paintings displayed at the Museum of Modern Art, and how many art movements is each associated with?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "e479c30d-507d-4e18-9be1-85eca0f42de6",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Psammophiinae'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of the grandparents of the taxon Psammophiinae?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "ca46d831-bb59-463c-a8c6-f408512a1385",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Museum of Grenoble'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many sculptures are on display at the Museum of Grenoble?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "f8a28658-970c-4415-aae9-cbcba339494e",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:hasHomeVenue]->(m0:Venue {name: 'Estadio Mansiche'}) WITH DISTINCT n RETURN n.name, n.inception_year",
    "nl_question": "What are the names and founding years of clubs that have used Estadio Mansiche as their home venue?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "55ba5ab1-72db-40d6-834e-16adc89a1d5e",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'Romanticism'}) WITH DISTINCT n RETURN min(n.creation_year)",
    "nl_question": "What is the earliest creation year of paintings associated with the Romanticism art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "59388afd-f8c4-4421-a057-f96c1f5602bf",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Samia'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans of taxa that are preyed upon by taxa with a parent named Samia?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "80a82b15-4c95-4cd1-bf10-378f96bb209b",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Musée Rodin'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'Modern sculpture'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many sculptures are either displayed at the Musée Rodin or associated with Modern sculpture?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "e0185ff8-b3e5-4d3c-83d4-3dd796fe4974",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon) WITH DISTINCT n RETURN min(n.avg_gestation_period_days)",
    "nl_question": "What is the shortest average gestation period, in days, among taxa that feed on other taxa?",
    "from_template": {
      "match_category": "basic_(n)-(m0)",
      "match_cypher": "MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "9e1b630a-edd7-4199-8995-fb7322a232f8",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon)<-[r1:employs]-(m1:TerroristAttack {name: '2013 Sana\\'a attack'}) WITH DISTINCT n RETURN min(n.number_of_deaths)",
    "nl_question": "What is the lowest number of deaths in terrorist attacks that used the same weapon as the 2013 Sana'a attack?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "36ad759d-04ec-4481-b34f-fae052391e58",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'High Renaissance'}),(n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Museo del Prado'}) WITH DISTINCT n RETURN DISTINCT n.country_of_origin",
    "nl_question": "Which countries are the origin of paintings that are linked to the High Renaissance and exhibited at the Museo del Prado?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "75321b82-d5d9-4fc8-b1fd-83e3b6fe7c94",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'Ulex'}),(n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Accipitriformes'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa that feed on Ulex and are preyed upon by Accipitriformes?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "1e8ecf4f-8f62-4133-b4f4-57d5cfc37100",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'portrait'}),(n:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'Alte Nationalgalerie'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of portrait sculptures displayed at the Alte Nationalgalerie?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "f589db75-66d5-4879-83c4-b56edf250bf4",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r1:playsFor]->(m1:Club {name: 'FC Metalurh Donetsk'}) OPTIONAL MATCH (n:Player)-[r0:playsFor]->(m0:Club) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of all players who have played for FC Metalurh Donetsk at any time, along with the number of different clubs each player has been associated with throughout their career.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "e59ffc8d-a81a-4788-94f7-fdaa8f6ab85b",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'Venetian school'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Shipley Art Gallery'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many paintings are either linked to the Venetian school or exhibited at the Shipley Art Gallery?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "26d9be06-1e41-4c6e-8dc8-d8ce42d247f3",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Centaurea maculosa'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans of the grandparents of Centaurea maculosa?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "134deb1f-161b-40c0-915a-6c8f9db451c0",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting)-[r1:createdBy]->(m1:Person {name: 'Filippo Lauri'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of art movements linked to paintings created by Filippo Lauri?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "1e1fb47d-9b85-4a8d-8817-bf3782d22883",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'BBC African Footballer of the Year'}),(n:Player)-[r1:playsFor]->(m1:Club {name: 'Al Mokawloon Al Arab SC'}) WITH DISTINCT n RETURN n.name, n.date_of_death",
    "nl_question": "Who are the players who have been awarded the BBC African Footballer of the Year and have played for Al Mokawloon Al Arab SC, and what are their dates of death?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "8b49a3c4-51fb-4846-8af6-9cddfba3911d",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack) WITH DISTINCT n RETURN n.name ORDER BY n.date ASC LIMIT 1",
    "nl_question": "What is the name of the earliest terrorist attack?",
    "from_template": {
      "match_category": "basic_(n)",
      "match_cypher": "MATCH (n)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "7082c07f-ff5e-40b6-a36e-3e3eba1e717e",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement)<-[r1:associatedWith]-(m1:Painting {name: 'Ecce Homo'}) WITH DISTINCT n WHERE n.creation_year = 1603 RETURN n.name",
    "nl_question": "What are the names of paintings from 1603 that are linked to the same art movement as Ecce Homo?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "0a99cd4f-634f-4195-851c-df95217daa3c",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target {name: 'White House'}),(n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'United States of America'}) WITH DISTINCT n RETURN n.name ORDER BY n.number_of_injuries ASC",
    "nl_question": "What are the names of terrorist attacks targeting the White House and occurring in the United States of America, sorted by the number of injuries from least to most?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "bb907d76-bbc5-4529-bc92-b460abe658c1",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club {name: 'Olympique de Marseille'}), (m0:Club {name: 'U.S. Gavorrano'}) RETURN n.inception_year - m0.inception_year AS answer",
    "nl_question": "What is the difference in founding years between Olympique de Marseille and U.S. Gavorrano?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  },
  {
    "qid": "8f85c06f-f7ed-44c4-882e-18380956d9d0",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:League)<-[r0:partOfLeague]-(m0:Club {name: 'A.S.D. Riccione 1929'}),(n:League)<-[r1:partOfLeague]-(m1:Club {name: 'Vis Pesaro dal 1898'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of leagues that include both A.S.D. Riccione 1929 and Vis Pesaro dal 1898 as members?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "83a65a34-e708-4137-b7c7-1eb457775c51",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Alexandre Cabanel'}),(n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'academic art'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC",
    "nl_question": "What are the names of paintings created by Alexandre Cabanel and associated with academic art, listed from the most recent to the oldest by their year of creation?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "680a7fe0-899a-4661-b294-613ab53f1e6a",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Vulnerable'}) WITH DISTINCT n RETURN DISTINCT n.diel_cycle",
    "nl_question": "What are the unique diel cycles of the parents of taxa with a conservation status of Vulnerable?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "3c1a263d-239d-428a-9a76-c572044e3c6f",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Habitat)<-[r0:inhabits]-(m0:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'species'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of habitats where species-level taxa reside?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "253405ca-d1d1-4622-b39c-e9802d9f77bd",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Joseph Chinard'}),(n:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'mannerism'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures created by Joseph Chinard and associated with the mannerism art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "2c4e4f69-36b1-44fc-ba83-2621e03d91e3",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:Country)<-[r0:occursIn]-(m0:TerroristAttack {name: '2009 Burgos bombing'}) RETURN n, m0 as m UNION MATCH (n:Country)<-[r1:occursIn]-(m1:TerroristAttack {name: '2002 Torrevieja bombing'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many countries experienced either the 2009 Burgos bombing or the 2002 Torrevieja bombing?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "9e097c10-6310-4338-81ca-a0a5444a1d21",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting {name: 'Portrait of Jan de Mey'}), (m0:Painting {name: 'Christ Bearing the Cross'}) RETURN n.creation_year - m0.creation_year AS answer",
    "nl_question": "What is the difference in the creation year between Portrait of Jan de Mey and Christ Bearing the Cross?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  },
  {
    "qid": "f38978d0-8238-4b8c-adc4-379ce612c102",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon {name: 'Agromyza'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods in days of the offspring of Agromyza?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "bad8a8f7-5ce8-43b0-8e28-556ce521cefd",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'avant-garde'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures linked to the avant-garde art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "5c9cb70c-e9bf-4b4a-8742-7eee437d4f5b",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Target)<-[r0:targets]-(m0:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Portugal'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of targets of terrorist attacks that took place in Portugal?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "cbc2d396-f7f7-45fa-9b85-a28cb02d45ee",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award)<-[r1:receivesAward]-(m1:Player {name: 'Marko Marin'}) WITH DISTINCT n RETURN DISTINCT n.gender",
    "nl_question": "What are the different genders of players who have received the same awards as Marko Marin?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "d947384c-8df0-4f42-9729-5e7ae1cf7b0d",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Position)<-[r0:playsPosition]-(m0:Player)-[r1:receivesAward]->(m1:Award {name: 'Pichichi Trophy'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the positions played by players who have received the Pichichi Trophy?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "89f477df-68f8-4c84-922b-06d1569bc7f1",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Naum Gabo'}) WITH DISTINCT n RETURN n.name, n.end_year",
    "nl_question": "What are the names and end years of art movements linked to sculptures created by Naum Gabo?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "e21a61e3-bce7-4fad-8cb2-4cc4cf370d26",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasConservationStatus]->(m0:ConservationStatus {name: 'Vulnerable'}),(n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'wolf'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of species that are classified as Vulnerable and are preyed upon by wolves?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "9375e9fb-4c56-4db5-95f7-e673b0926295",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Weapon)<-[r0:employs]-(m0:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'military-style semi-automatic'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of weapons used in terrorist attacks that also involve military-style semi-automatics?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "ac12a30b-15bd-4ae5-8549-b04183488102",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Georges Récipon'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of sculptures made by Georges Récipon?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "55f92ac3-3d3a-4f0a-bed0-95b557042bfd",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Mamba'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days DESC",
    "nl_question": "What are the names of taxa whose parent shares a parent with Mamba, sorted by their average gestation period from longest to shortest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  }
]
