[
  {
    "qid": "d1096f75-3182-4bf8-bb17-834a5177724a",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: 'Tunisian Ligue Professionnelle 1'}) RETURN n, m0 as m UNION MATCH (n:Club)<-[r1:playsFor]-(m1:Player {name: 'Khaled Lemmouchia'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many clubs are either part of the Tunisian Ligue Professionnelle 1 or have had Khaled Lemmouchia as a player at some point?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "e43a7ca4-ddd5-467d-98b2-f92dc80c9d94",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack)-[r1:perpetratedBy]->(m1:Terrorist {name: 'Terry Nichols'}) WITH DISTINCT n RETURN n.name, n.country_of_citizenship",
    "nl_question": "What are the names and countries of citizenship of terrorists involved in the same attacks as Terry Nichols?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "d2a5a93b-ebcd-4159-894f-28f9b6669a5a",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'forward'}),(n:Player)-[r1:playsPosition]->(m1:Position {name: 'inside forward'}) WITH DISTINCT n RETURN n.name, n.nicknames",
    "nl_question": "What are the names and nicknames of players who play both as a forward and an inside forward?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "da11d00b-7241-4b18-a146-89229bb0a59d",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'Tokyo National Museum'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings exhibited at the Tokyo National Museum?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "7320a54e-cf07-4b70-b1ce-1db0f04315f0",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Sculpture)-[r1:createdBy]->(m1:Person {name: 'James Surls'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of museums where sculptures by James Surls are displayed?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "6a2caef6-258e-4aa8-8574-accdbc8877be",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'constructivism'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC LIMIT 1",
    "nl_question": "What is the name of the most recently created sculpture associated with constructivism?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "3ba8fcf3-7a6d-4a62-94d0-0a6452da026a",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'surrealism'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures linked to the surrealism art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "39431b34-d76b-4690-ba72-021a2e321073",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement)<-[r1:associatedWith]-(m1:Sculpture {name: 'The Kiss'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures linked to the same art movement as The Kiss?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "cf5e00fe-2606-4a32-89ab-99ec9ce5f9b9",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Painting {name: 'Portrait of Petrus Schaak, Clergyman and Scholar in Amsterdam'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the genres of the painting titled Portrait of Petrus Schaak, Clergyman and Scholar in Amsterdam?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "c5e62aef-7fe4-46db-a963-a29dc6c52112",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'desert'}),(n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Efferia'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods (in days) of taxa that live in deserts and are preyed upon by Efferia?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "49d37960-a793-4710-a07a-864587e82190",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:Country)<-[r0:occursIn]-(m0:TerroristAttack {name: 'Brooklyn Bridge shooting'}) RETURN n, m0 as m UNION MATCH (n:Country)<-[r1:occursIn]-(m1:TerroristAttack {name: 'Lexington Avenue bombing'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many countries experienced either the Brooklyn Bridge shooting or the Lexington Avenue bombing?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "0fbded3b-af5b-46b9-8386-3da8d06dfebf",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'The Consecration of Saint Nicholas'}) RETURN n, m0 as m UNION MATCH (n:Person)<-[r1:createdBy]-(m1:Painting {name: 'Good Samaritan'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the artists of either The Consecration of Saint Nicholas or Good Samaritan?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "54483680-c704-47eb-9e0f-6dc33a1742d3",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Painting)-[r1:createdBy]->(m1:Person {name: 'Paolo Veronese'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of museums that exhibit paintings by Paolo Veronese, and how many of his paintings are displayed at each museum?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "6734f48e-02e5-46e4-9e4f-2d0f2bbd8560",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'religious art'}),(n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Herzog Anton Ulrich Museum'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of paintings that are religious art and are displayed at the Herzog Anton Ulrich Museum?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "15e2fd67-86cf-42e8-9927-8f8411ae002b",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'The Pond, Snow Effect'}),(n:Person)<-[r1:createdBy]-(m1:Painting {name: 'Valley of the Petite Creuse'}) WITH DISTINCT n RETURN n.name, n.date_of_birth",
    "nl_question": "Who are the artists who created both The Pond, Snow Effect and Valley of the Petite Creuse, and what are their birth dates?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "f010d391-b686-4d72-8613-fcde1a003642",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'centre-back'}) RETURN n, m0 as m UNION MATCH (n:Player)-[r1:playsPosition]->(m1:Position {name: 'defender'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many players are there who play as either a centre-back or a defender?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "d6ba43e5-88eb-456e-bd76-3a979e183b87",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Sculpture {name: 'The Triumph of the Republic'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many genres is \"The Triumph of the Republic\" associated with?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "89e904fe-972e-4fd1-bf45-60d6ed6f63f5",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'stream'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods (in days) of taxa that are preyed upon by species living in streams?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "c6a3748c-d894-4b63-b25f-ceb7810e2dd0",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Target)<-[r0:targets]-(m0:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Ukraine'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of targets of terrorist attacks in Ukraine, and how many such attacks target each of them?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "b96cb52e-b587-4b57-bf52-55a9680478ab",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'Los Angeles County Museum of Art'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "Who are the artists who created sculptures displayed at the Los Angeles County Museum of Art, and where were they born?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "d466f501-c5da-4afa-9220-16ccad7b01a0",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Target)<-[r0:targets]-(m0:TerroristAttack {name: '2017 Palm Sunday church bombings'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the targets of the 2017 Palm Sunday church bombings?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "e50aeefb-c31e-4cc9-bb47-2fbe0a30ff98",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'Romantic painting'}) OPTIONAL MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of all paintings associated with the Romantic painting movement, along with the number of genres each painting belongs to.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "e1ba4f43-5952-4c0c-a670-287f9a4fa26a",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'National Army Museum'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:createdBy]->(m1:Person {name: 'George Chinnery'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings either displayed at the National Army Museum or created by George Chinnery?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "c20dca7f-3d3a-4c99-92c1-7e4ea7eb9476",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'bamboo grove'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names of taxa that live in bamboo groves, along with their longest lifespan in years?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "bac2973b-b8f7-4521-af4c-dec463dc25ca",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Marco Marchi'}) WITH DISTINCT n WHERE 'Fluorsid Group' IN n.owners RETURN n.name",
    "nl_question": "What are the names of clubs that Marco Marchi has played for, which are owned by the Fluorsid Group?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "02f9cca7-2d79-4a1e-9954-5c6636160a6c",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that feed on other taxa?",
    "from_template": {
      "match_category": "basic_(n)-(m0)",
      "match_cypher": "MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "b19ab88f-cfc3-40ad-89ff-da25eead234f",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon {name: 'Martes zibellina'}), (m0:Taxon {name: 'Homo sapiens'}) RETURN CASE WHEN n.avg_gestation_period_days > m0.avg_gestation_period_days THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Which has a longer average gestation period, Martes zibellina or Homo sapiens?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "af62193f-e3c3-430a-87c6-d27cf8d8b9eb",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Goal of the Month'}) RETURN n, m0 as m UNION MATCH (n:Player)-[r1:playsFor]->(m1:Club {name: 'FC Metz'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many players have either received the Goal of the Month award or have played for FC Metz at some point?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "f21c8507-4350-42b0-9538-ec86528d5bc4",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon {name: 'gray whale'}), (m0:Taxon {name: 'Uvaroviella babyas'}) RETURN n.diel_cycle = m0.diel_cycle AS answer",
    "nl_question": "Do the gray whale and Uvaroviella babyas share the same diel cycle?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "b6815a02-f07b-4ef9-91fa-922b04c9c8be",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack {name: 'murder of Jo Cox'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the terrorists responsible for the murder of Jo Cox?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "7de47481-e48e-4687-b22c-17034c4d2523",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'High Renaissance'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'mannerism'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings linked to either the High Renaissance or Mannerism art movements?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "14ebb427-a21d-42b2-9d33-b4c0d17043b4",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Erinaceidae'}) OPTIONAL MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of all taxa that Erinaceidae preys on, and how many other taxa feed on each of them?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)<-[r1]-(m1<name>) OPTIONAL MATCH (n)<-[r0]-(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "1e991952-a645-41b4-8b07-059b731741da",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'supertribe'}) OPTIONAL MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of all taxa with the rank of supertribe, along with the count of taxa that consider each as a parent.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)<-[r0]-(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "0d3dcce5-5f9a-484d-b020-a48b2ad8742d",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target {name: 'Taj Mahal Palace Hotel'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:targets]->(m1:Target {name: 'Leopold Cafe'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks that targeted either the Taj Mahal Palace Hotel or the Leopold Cafe?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "06561952-8a83-4db5-91ea-60a1ddbb7eba",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'wing half'}) WITH DISTINCT n RETURN n.name, n.date_of_death",
    "nl_question": "What are the names and dates of death of players who played as wing halves?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "62f8093b-415e-4a2c-8aac-4ef6a0eb1f46",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'Impressionism'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of genres that include paintings associated with Impressionism, and how many such paintings are there for each genre?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "017b975e-ad0a-495d-aeb9-271580caa0be",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'superphylum'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names of taxa classified as superphylum and their longest lifespan in years?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "1bd4ad1b-1376-46b8-9410-f3b7cfafbddd",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Award)<-[r0:receivesAward]-(m0:Player {name: 'Matías Fernandez'}) RETURN n, m0 as m UNION MATCH (n:Award)<-[r1:receivesAward]-(m1:Player {name: 'Luís Figo'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many awards have been received by either Matías Fernandez or Luís Figo?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "9312642c-836d-40dc-8b0b-db7c7649a6aa",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'hand grenade'}),(n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Spain'}) WITH DISTINCT n RETURN n.name, n.number_of_injuries",
    "nl_question": "What are the names and injury counts of terrorist attacks in Spain that involved the use of hand grenades?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "4721c776-88f4-47ae-8faf-235755390f76",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Habitat)<-[r0:inhabits]-(m0:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'Chaparral'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of habitats that are also inhabited by species living in the Chaparral?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "3ba813da-63e8-44c1-9a86-ff91a5f6f7e5",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'public art'}),(n:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Georges Salendre'}) WITH DISTINCT n WHERE n.creation_year < 1984 RETURN n.name",
    "nl_question": "What are the names of public art sculptures created by Georges Salendre before the year 1984?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "cd51ab4b-0cf8-453c-ad69-001dc5e61f83",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Auguste Rodin'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Which museums have sculptures by Auguste Rodin on display, and how many of his sculptures are exhibited at each museum?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "c7056db3-e41e-4dd8-aeab-485ade7cc6b0",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Alexis Sánchez'}) WHERE r0.start_year IS NOT NULL AND r0.end_year IS NULL WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the clubs that Alexis Sánchez is currently playing for?",
    "from_template": {
      "match_category": "special_time-sensitive",
      "match_cypher": "MATCH (n)<-[r0<start_year,end_year^>]-(m0<name>) WHERE r0.start_year IS NOT NULL AND r0.end_year IS NULL",
      "return_pattern_id": "n_name_special",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "e40e958d-21ce-43b8-ac4d-43b3e09ff20e",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'hand grenade'}) OPTIONAL MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of terrorist attacks that used a hand grenade, along with the number of targets for each attack.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "ec90a554-fd7f-4928-a72f-77eae8e9c15c",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Erinaceidae'}) OPTIONAL MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of all taxa that Erinaceidae preys on, and how many taxa does each of them feed on?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)<-[r1]-(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "0558aa1d-76e7-43f5-a7a3-29f32381a7d8",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'tomato'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days ASC",
    "nl_question": "What are the names of the parent taxa of species that feed on tomatoes, sorted by their average gestation period from shortest to longest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "e3397f37-07d6-454c-8b6d-85c37e7e11c8",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'grassland'}),(n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Efferia'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods (in days) of taxa that live in grasslands and are preyed upon by Efferia?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  }
]
