[
  {
    "qid": "d98fb008-3274-4786-be13-0fc5f469ac19",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Biak Scops Owl'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa whose parent is preyed upon by the Biak Scops Owl?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "c24042ad-ed7a-4fb3-b19a-610dde0e560e",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'pasture'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of the parents of taxa that live in pastures?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "fa2eef86-87b0-4d4c-8573-122089c01ff4",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Endangered species'}) WITH DISTINCT n RETURN DISTINCT n.diel_cycle",
    "nl_question": "What are the unique diel cycles of taxa that prey on species classified as endangered?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "0821bfeb-1f2f-4c41-af57-4a0db88550e8",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting {name: 'Christ Bearing the Cross'}), (m0:Painting {name: 'Christ and the Centurion'}) RETURN n.creation_year = m0.creation_year AS answer",
    "nl_question": "Are the paintings Christ Bearing the Cross and Christ and the Centurion created in the same year?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "9699479c-8d67-41e0-a34e-c40d3fb6a65a",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Critically Endangered'}) WITH DISTINCT n RETURN avg(n.avg_gestation_period_days)",
    "nl_question": "What is the average gestation period, in days, for the parents of taxa classified as Critically Endangered?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "e81bb630-7f9d-4b84-ac17-0ee8216c7f8a",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement)<-[r1:associatedWith]-(m1:Painting {name: 'Lilas, Temps gris'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of sculptures linked to the same art movements as the painting Lilas, Temps gris, and how many such art movements are they connected to?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "428b192d-4e18-402a-bfff-1f9db84febd4",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many players have received an award?",
    "from_template": {
      "match_category": "basic_(n)-(m0)",
      "match_cypher": "MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "7c516f24-aaa5-4a80-8fee-d503a0a654d8",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Silbernes Lorbeerblatt'}),(n:Player)-[r1:playsFor]->(m1:Club {name: 'U.C. Sampdoria'}) WITH DISTINCT n RETURN n.name, n.footedness",
    "nl_question": "Who are the players who have received the Silbernes Lorbeerblatt award and have played for U.C. Sampdoria, and what is their footedness?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "bcc5ba99-1b50-42bd-8710-9f20aee157d2",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'highway art'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of sculptures that belong to the genre of highway art?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "b4072bd0-2a13-4e75-a934-fcd44186a204",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'subsection'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of taxa that are parents to taxa with the rank of subsection, and how many such subsection-ranked taxa are they parents to?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "54499d79-e276-49ac-9890-dc7a7a2969fd",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:League)<-[r0:partOfLeague]-(m0:Club)<-[r1:playsFor]-(m1:Player {name: 'Luciano Zauri'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of the leagues that include clubs Luciano Zauri has played for, and how many such clubs are in each league?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "2b6be8e3-95a2-4fd5-a3bd-575f67a82b0c",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'Art Deco'}),(n:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Félix Févola'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of sculptures linked to the Art Deco movement and crafted by Félix Févola?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "03d20265-5d31-4113-bd4f-e0ac8bc22317",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'Impressionism'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year ASC LIMIT 1",
    "nl_question": "What is the name of the earliest painting associated with the Impressionism art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "d31d7cf6-e141-4c53-be19-7c6a11409cde",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'monumental sculpture'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of genres that are associated with sculptures classified as monumental sculpture, and how many such sculptures belong to each genre?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "f081dcd0-b248-40b8-ad51-006d5e589d56",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Gold Medal of the Royal Order of Sports Merit'}),(n:Player)-[r1:playsPosition]->(m1:Position {name: 'midfielder'}) WITH DISTINCT n RETURN n.name, n.country_of_citizenship",
    "nl_question": "Who are the midfielders who have received the Gold Medal of the Royal Order of Sports Merit, and what are their countries of citizenship?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "3ebbf634-d70b-40fa-b021-bbce8e44dc1c",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player)-[r1:playsFor]->(m1:Club {name: 'Al-Ahli'}) WITH DISTINCT n RETURN DISTINCT n.country",
    "nl_question": "Which unique countries have clubs that have had players who also played for Al-Ahli at some point?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "f5eeed71-f4e2-4642-b73f-c9804df9606d",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Coccinella'}) RETURN n, m0 as m UNION MATCH (n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Diaphorina citri'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that either have Coccinella as a parent or feed on Diaphorina citri?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "bc3671af-168a-47a0-a6cb-ddd265b87285",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Award)<-[r0:receivesAward]-(m0:Player)-[r1:playsFor]->(m1:Club {name: 'Arsenal F.C.'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of awards received by players who have played for Arsenal F.C., and how many such players have received each award?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "3fc2dbe1-c6a3-480d-9eb7-5acbd8a76823",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'interior view'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many paintings are there that belong to the genre of interior view?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "cca38fdb-1d8c-43ef-952c-43e98b209723",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target {name: 'Dizengoff Center'}) WITH DISTINCT n RETURN n.name, n.locations",
    "nl_question": "What are the names and locations of terrorist attacks that targeted Dizengoff Center?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "a239e4de-1aa9-410f-b275-9083aa5a8c35",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Neomys'}),(n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'forest'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of taxa that have Neomys as a parent and live in forests?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "ff39da30-648f-45bf-8388-4999614bfa83",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Acorus'}),(n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'solutional cave'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods (in days) of taxa that have Acorus as a parent and live in solutional caves?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "fe70f5c0-8b69-4bca-aaad-716d9cf5d38f",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Alou Diarra'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many clubs has Alou Diarra played for, either currently or in the past?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "085bab82-1b69-4087-b28a-8ccae9f26c14",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'car bomb'}) WITH DISTINCT n WHERE n.number_of_deaths <> 17 RETURN n.name",
    "nl_question": "What are the names of terrorist attacks that used a car bomb and resulted in a number of deaths different from 17?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "0c1a0ead-755c-4746-9ca8-2cdcdea07dd9",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'mannerism'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings linked to the Mannerism art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "bbdc3d9c-5354-40b1-9a4a-ffb036d72eec",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'attacking midfielder'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of players who play as attacking midfielders?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "f20d50f8-d89e-48c9-865f-1c6a72a53259",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'temperate forest'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that feed on species living in temperate forests?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "d734a81e-e67a-4bab-9777-248ee2d9b56c",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country)<-[r1:occursIn]-(m1:TerroristAttack {name: 'Camp Chapman attack'}) WITH DISTINCT n WHERE n.number_of_injuries >= 18 RETURN n.name",
    "nl_question": "What are the names of terrorist attacks that happened in the same country as the Camp Chapman attack and resulted in at least 18 injuries?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "a8fe353e-d6cb-4ea6-a933-22a3cedc2952",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement)<-[r1:associatedWith]-(m1:Painting {name: 'Madonna with the Long Neck'}) WITH DISTINCT n RETURN max(n.creation_year)",
    "nl_question": "What is the latest creation year of paintings linked to the same art movement as Madonna with the Long Neck?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "aa5d086d-4aaf-4d4f-ab6c-e4889ffac169",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'Neptune by Gabriel-Vital Dubray'}) WITH DISTINCT n WHERE n.creation_year = 1851 RETURN n.name",
    "nl_question": "What are the names of sculptures made in 1851 by the same artist who created Neptune by Gabriel-Vital Dubray?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "edf3ce42-1c5d-42e4-8944-03b521d22e63",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:hasHomeVenue]->(m0:Venue {name: 'Plough Lane'}),(n:Club)-[r1:hasHomeVenue]->(m1:Venue {name: 'Kiyan Prince Foundation Stadium'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Which clubs have had both Plough Lane and Kiyan Prince Foundation Stadium as their home venues at some point in time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "f7c242f8-3779-4b05-a75b-c9275099a8ae",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Luigi Binda'}),(n:Club)<-[r1:playsFor]-(m1:Player {name: 'Giuseppe Unere'}) WITH DISTINCT n RETURN n.name, n.owners",
    "nl_question": "What are the names and owners of clubs where both Luigi Binda and Giuseppe Unere have played?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "7ef794d4-74ef-4dc7-8fc6-45222c179b76",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:hasHomeVenue]->(m0:Venue {name: 'Malmö stadion'}) WITH DISTINCT n RETURN n.name, n.head_coach",
    "nl_question": "What are the names and head coaches of clubs that have used Malmö stadion as their home venue at some point?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "806784b9-3196-42e9-8513-1c6db6eb5968",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'National Museum of Western Art'}) OPTIONAL MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of sculptures displayed at the National Museum of Western Art, and how many art movements is each associated with?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "c47368e0-32ed-4044-bbc2-635e6d3d30a0",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks?",
    "from_template": {
      "match_category": "basic_(n)",
      "match_cypher": "MATCH (n)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "28095032-f46a-4d3d-94f1-292bea6c5f58",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Pascal Fugier'}),(n:Club)<-[r1:playsFor]-(m1:Player {name: 'Lucas Tousart'}) WITH DISTINCT n RETURN n.name, n.owners",
    "nl_question": "What are the names and owners of clubs where both Pascal Fugier and Lucas Tousart have played?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "b6397aab-f378-4fca-8070-a7860a23e29a",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'shrubland'}) OPTIONAL MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of all taxa that live in shrubland, along with the count of other taxa that feed on each of them.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)<-[r0]-(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "9e2d0959-56b5-4535-8fec-bdc8758168d3",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Snoring Rail'}) WITH DISTINCT n RETURN n.name ORDER BY n.longest_lifespan_years DESC LIMIT 1",
    "nl_question": "What is the name of the taxon, whose parent is preyed upon by the Snoring Rail, that has the longest lifespan?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "60128034-9387-4b74-9383-8d1b5ac83992",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: 'Segunda División'}) RETURN n, m0 as m UNION MATCH (n:Club)<-[r1:playsFor]-(m1:Player {name: 'Bakary Koné'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many clubs are either part of the Segunda División or have Bakary Koné as a player at some point?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "5d95a4ed-5b25-4928-b9b4-bc2b9ade38ed",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Hermitage Museum'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of art movements linked to paintings exhibited at the Hermitage Museum, and how many such paintings are associated with each movement?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "87663c9c-4675-4bf5-b7d1-9baa0213273b",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting)-[r1:hasGenre]->(m1:Genre {name: 'battle painting'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "Who are the artists who created battle paintings, and where were they born?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "0e1b6b2a-2b77-462a-82b7-86b953794cb7",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting)-[r1:createdBy]->(m1:Person {name: 'Adam Elsheimer'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of art movements linked to paintings by Adam Elsheimer, and how many of his paintings are associated with each movement?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "fb5ab2f0-f192-4e7f-9641-6ad18b36eda4",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting {name: 'Moses Striking Water from the Rock'}) WITH DISTINCT n RETURN n.name ORDER BY n.end_year ASC",
    "nl_question": "What are the names of art movements linked to the painting Moses Striking Water from the Rock, sorted by their end year from the earliest to the latest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "48699b8a-4b55-4fe8-be06-bb16a9f28dbf",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club)<-[r1:playsFor]-(m1:Player {name: 'Giuseppe Ballerio'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Identify the players who have been part of any club that Giuseppe Ballerio has played for, and specify how many of these clubs each player has been associated with.",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "449c15f0-b335-4df8-bc8b-780b951564fa",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Riccardo Bocalon'}) WITH DISTINCT n WHERE n.head_coach <> 'Ivan Javorčić' RETURN n.name",
    "nl_question": "What are the names of clubs Riccardo Bocalon has played for, where the head coach is not Ivan Javorčić?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "b5390279-60f5-4250-934d-a5dbc4e15092",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club)<-[r1:playsFor]-(m1:Player {name: 'Attilio Demaría'}) WITH DISTINCT n RETURN n.name ORDER BY n.date_of_death ASC",
    "nl_question": "What are the names of players who have been part of the same club as Attilio Demaría, sorted by their date of death from earliest to latest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "cf2aef54-00cc-4bb1-ade7-11d5166e91d1",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Burghley House'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the artists of paintings that are displayed at Burghley House?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "5655e6b1-5b6a-4480-ba78-01105e0a6436",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist) WITH DISTINCT n RETURN DISTINCT n.gender",
    "nl_question": "What are the unique genders of terrorists?",
    "from_template": {
      "match_category": "basic_(n)",
      "match_cypher": "MATCH (n)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "7f8d1721-6b31-4e39-8fd7-d5964d9ac34a",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon {name: 'mule deer'}), (m0:Taxon {name: 'Asian elephant'}) RETURN n.longest_lifespan_years - m0.longest_lifespan_years AS answer",
    "nl_question": "What is the difference in the longest lifespan, in years, between a mule deer and an Asian elephant?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  }
]
