[
  {
    "qid": "b316d5f5-4794-4b6d-8e7a-351bfbc9fc6e",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting {name: 'Grainstack at Giverny'}),(n:ArtMovement)<-[r1:associatedWith]-(m1:Sculpture {name: 'The Kiss'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of art movements linked to both the painting Grainstack at Giverny and the sculpture The Kiss?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "1895f704-7e51-4b5e-8475-229bedd07870",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'foothills'}),(n:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'species'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans of species that live in foothills?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "6750d6b3-4b32-4291-a551-0a7f1db67fec",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'The Best FIFA Men\\'s Player'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "Provide the names and birthplaces of players who have received The Best FIFA Men's Player award.",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "fa2760e5-2ee2-4893-af15-a0d66b97dfc8",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'François-Raoul Larche'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of sculptures made by François-Raoul Larche?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "02ad2b83-f14a-4bae-afdc-150c3b3ec13e",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Habitat)<-[r0:inhabits]-(m0:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'genus'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of habitats inhabited by taxa of the genus rank, and how many such taxa inhabit each habitat?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "301a3cb1-dd8a-455f-a927-172dc5e601c5",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'James Surls'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many sculptures were created by James Surls?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "0c6c1fac-2087-4615-b21a-bbd561b09c1f",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'small arms'}) WITH DISTINCT n RETURN n.name, n.date_of_birth",
    "nl_question": "What are the names and birthdates of terrorists who carried out attacks using small arms?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "58ca91a3-7425-4d03-8df7-aae8ec534d26",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target {name: 'Linwood Islamic Centre'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'shotgun'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many terrorist attacks either targeted the Linwood Islamic Centre or involved the use of a shotgun?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "2ce4beb3-2a49-40d8-b6ff-50ce0f360ea8",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Museum of Grenoble'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures displayed at the Museum of Grenoble?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "002756be-77f3-4268-b35e-e5b854285239",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasConservationStatus]->(m0:ConservationStatus {name: 'Critically Endangered'}),(n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'river'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans in years of taxa that are critically endangered and inhabit rivers?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "0d182cc1-ef3b-46d9-bca2-6be0e4163303",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Paris Saint-Germain F.C.'}) WHERE r0.start_year <= 1992 AND (r0.end_year >= 1992 OR r0.end_year IS NULL) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the players who were part of Paris Saint-Germain F.C. during the year 1992?",
    "from_template": {
      "match_category": "special_time-sensitive",
      "match_cypher": "MATCH (n)-[r0<start_year,end_year?>]->(m0<name>) WHERE r0.start_year <= ${r0_start_year} AND (r0.end_year >= ${r0_start_year} OR r0.end_year IS NULL)",
      "return_pattern_id": "n_name_special",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "70c6bf37-e6df-4af6-8398-e9439ad316ae",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'public art'}),(n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'mythological sculpture'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures that are both public art and mythological sculptures?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "a5c3c798-bcb8-4249-86a5-1b30e2361d03",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'mountain forest'}) OPTIONAL MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of all taxa that live in mountain forests, along with the count of their direct descendants.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)<-[r0]-(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "28e25d5d-a7cb-4c90-a344-f5508af9137e",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Olympique Alès'}) RETURN n, m0 as m UNION MATCH (n:Player)-[r1:receivesAward]->(m1:Award {name: 'UEFA Team of the Year'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of players who have either played for Olympique Alès or have been awarded the UEFA Team of the Year?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "3535de6e-d73e-4716-821a-104d9a844a34",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:TaxonRank)<-[r0:hasRank]-(m0:Taxon {name: 'Acherontia'}) RETURN n, m0 as m UNION MATCH (n:TaxonRank)<-[r1:hasRank]-(m1:Taxon {name: 'Acanthaster'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many taxonomic ranks are associated with either Acherontia or Acanthaster?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "62b91351-71b4-4f22-8281-df89332d9635",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre)<-[r1:hasGenre]-(m1:Sculpture {name: 'Grenadier'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of paintings that share a genre with the sculpture Grenadier?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "3366a3de-cdb0-4b27-b416-e22bcb14348a",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Painting)-[r1:hasGenre]->(m1:Genre {name: 'nude'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of museums that exhibit nude paintings, and how many such paintings does each museum display?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "03467cda-5ed5-40fb-8789-fc1e9a97c945",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Shabab Al Ahli Club'}),(n:Player)-[r1:receivesAward]->(m1:Award {name: 'Ballon d\\'Or'}) WITH DISTINCT n RETURN n.name, n.footedness",
    "nl_question": "Who are the players who have been part of Shabab Al Ahli Club and have received the Ballon d'Or, and what is their footedness?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "67f85dba-98e6-4bc0-a349-710647190699",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Honda Sports Award for Soccer'}) WITH DISTINCT n RETURN n.name, n.height_cm",
    "nl_question": "Provide the names and heights in centimeters of players who have received the Honda Sports Award for Soccer.",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "4b6fc787-a232-4c0b-854e-9a6853b92305",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Arachnida'}) WITH DISTINCT n RETURN count(DISTINCT n.diel_cycle)",
    "nl_question": "How many different diel cycles are there for taxa that prey on organisms which, in turn, feed on Arachnida?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "bc4fbd2e-932f-409a-9b5d-89bc01855aa6",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:perpetratedBy]->(m0:Terrorist {name: 'Paolo Bellini'}),(n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Italy'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks carried out by Paolo Bellini that took place in Italy?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "92fa9b9d-0c23-4d47-9c77-711b037da5bc",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'public art'}),(n:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Georges Salendre'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year ASC",
    "nl_question": "What are the names of sculptures that are public art and were created by Georges Salendre, listed from the earliest to the latest creation year?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "ba7ea64a-2a23-4b13-a84b-6a4da820d846",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Venue)<-[r0:hasHomeVenue]-(m0:Club)-[r1:hasHomeVenue]->(m1:Venue {name: 'Montjuic Olympic Stadium'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of venues that have been home to clubs that also use Montjuic Olympic Stadium as their home venue?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "252961f9-8e00-45bd-8f5b-e1fa613bf845",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country)<-[r1:occursIn]-(m1:TerroristAttack {name: 'Eden Natan-Zada'}) WITH DISTINCT n RETURN min(n.number_of_injuries)",
    "nl_question": "What is the lowest number of injuries in terrorist attacks that happened in the same country as the Eden Natan-Zada attack?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "d97568a7-07a0-4ff2-828f-3845d922096f",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:perpetratedBy]->(m0:Terrorist {name: 'Valerio Fioravanti'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks carried out by Valerio Fioravanti?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "9b9cc17d-96eb-4a7d-a3ff-8b678b4fe9c7",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'Museo Soumaya'}) OPTIONAL MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of sculptures displayed at Museo Soumaya, and how many different genres does each sculpture belong to?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "51c066a9-9696-4a9f-a368-9bfe5fe601f6",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'Crustacea'}) RETURN n, m0 as m UNION MATCH (n:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Dendrocopos'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many taxa either feed on Crustacea or have Dendrocopos as a parent?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "11a2326c-aeee-4239-8760-babe235e6111",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person)<-[r1:createdBy]-(m1:Painting {name: 'Michetti with the painter Edoardo Dalbono in the woods of Capodimonte'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of paintings made by the same artist who created Michetti with the painter Edoardo Dalbono in the woods of Capodimonte?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "cddc52b5-f4d6-4fa5-b15c-35a9ea52d2ce",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'Kuwait'}) WITH DISTINCT n RETURN n.name, n.locations",
    "nl_question": "What are the names and locations of terrorist attacks that took place in Kuwait?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "eb62c0f7-c043-4b72-88d4-5fe093cca5f9",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'cold weapon'}) WITH DISTINCT n RETURN n.name ORDER BY n.number_of_deaths DESC",
    "nl_question": "What are the names of terrorist attacks that used cold weapons, sorted by the number of deaths from highest to lowest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "88d41ad9-c9aa-4ee9-b3f1-c5df330c08b5",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting {name: 'Portrait of Procurator Jacopo Soranzo'}) WITH DISTINCT n RETURN n.name ORDER BY n.end_year ASC LIMIT 1",
    "nl_question": "Which art movement associated with the painting Portrait of Procurator Jacopo Soranzo ended the earliest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "613da458-301a-4f87-982d-e06f7a2b4856",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club)-[r1:partOfLeague]->(m1:League {name: 'Indonesian Premier League'}) WITH DISTINCT n RETURN n.name ORDER BY n.date_of_birth DESC",
    "nl_question": "What are the names of players who have been part of a club in the Indonesian Premier League, sorted by their date of birth from the youngest to the oldest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "522b87cd-8463-4c4b-92a9-7df03a7dc71f",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'architectural view'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of paintings that belong to the architectural view genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "622d3e26-a5fa-48ea-9055-78137bc708cf",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat)<-[r1:inhabits]-(m1:Taxon {name: 'Cardamine circaeoides'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of taxa that share habitats with Cardamine circaeoides, and how many of those habitats do they inhabit?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "c09e0997-249b-440e-823f-34976e78569d",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'temperate rainforest'}),(n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'city'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of species that live in both temperate rainforests and cities?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "954673d4-56ac-48d4-879f-aa9a9d7affcf",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'wing half'}) WITH DISTINCT n UNWIND n.country_of_citizenship AS prop RETURN DISTINCT prop",
    "nl_question": "What are the unique countries of citizenship of players who play as wing halves?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_prop_array_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n UNWIND n.${prop} AS prop RETURN DISTINCT prop"
    }
  },
  {
    "qid": "4cae67dc-1de4-4344-ab11-9cc79ea1279b",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'lemming'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa whose parent feeds on lemmings?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "64215c87-2f52-44b7-b015-b82d2ff4ef40",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Neoseiulus'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that are preyed upon by taxa with a parent named Neoseiulus?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "d9f3e537-ebe8-42bd-88bf-b9b28166a3e0",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'Modern sculpture'}),(n:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'Burrell Collection'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures linked to the Modern sculpture movement and exhibited at the Burrell Collection?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "ac820b7c-86e4-43ab-a001-593a637088bd",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Panthera'}) OPTIONAL MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of all taxa that have Panthera as a parent, along with the count of different taxa they feed on.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "9abf17e0-8f95-42df-9bca-dca8d654bf31",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'François-Raoul Larche'}) WITH DISTINCT n RETURN min(n.creation_year)",
    "nl_question": "What is the earliest creation year of sculptures made by François-Raoul Larche?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "39a49e65-39df-4273-b68f-580917496da4",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player)-[r1:playsPosition]->(m1:Position {name: 'second striker'}) WITH DISTINCT n RETURN DISTINCT n.country",
    "nl_question": "Which countries have clubs that have had players in the position of second striker?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "4d5c98e7-8461-4afe-83f2-42ceaf1dd62d",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:League)<-[r0:partOfLeague]-(m0:Club)<-[r1:playsFor]-(m1:Player {name: 'Dan Ekner'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of leagues that include a club where Dan Ekner has played?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "cbd02a73-c4dc-42ad-8458-619976463062",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Museum of Fine Arts, Houston'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many sculptures are displayed at the Museum of Fine Arts, Houston?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "7aec8bf7-8b92-46ac-9a68-b19656ae083b",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Genre)<-[r0:hasGenre]-(m0:Painting {name: 'A Female Saint in Yellow'}) RETURN n, m0 as m UNION MATCH (n:Genre)<-[r1:hasGenre]-(m1:Sculpture {name: 'Saint Simeon'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many genres are associated with either the painting A Female Saint in Yellow or the sculpture Saint Simeon?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "d08ab15e-6558-4d28-98f2-02ae6d4194a9",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Jean-Baptiste Monnoyer'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:hasGenre]->(m1:Genre {name: 'floral painting'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings either created by Jean-Baptiste Monnoyer or classified as floral paintings?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "3dc63127-095d-46dd-b9a5-253290806b60",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Felice Evacuo'}) WHERE r0.start_year IS NOT NULL AND r0.end_year IS NULL WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the clubs that Felice Evacuo is currently playing for?",
    "from_template": {
      "match_category": "special_time-sensitive",
      "match_cypher": "MATCH (n)<-[r0<start_year,end_year^>]-(m0<name>) WHERE r0.start_year IS NOT NULL AND r0.end_year IS NULL",
      "return_pattern_id": "n_name_special",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  }
]
