[
  {
    "qid": "0a60aec5-0d4f-4e2d-8249-32d44147a4c8",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'division'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days DESC",
    "nl_question": "What are the names of taxa with a rank of division, sorted by their average gestation period in days from longest to shortest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "b76766af-f248-42f7-a12d-50c981bfd522",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'forward'}),(n:Player)-[r1:playsPosition]->(m1:Position {name: 'inside forward'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "What are the names and birthplaces of players who play both as a forward and an inside forward?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "d97948dc-1de6-45b4-beb3-50ff09d024aa",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'Odonata'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Symphyta'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa that feed on both Odonata and Symphyta?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "6d538f33-2604-4158-8e0f-182a86dda90b",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture) WITH DISTINCT n RETURN max(n.date_of_birth.year)",
    "nl_question": "What is the latest birth year among individuals who have created sculptures?",
    "from_template": {
      "match_category": "basic_(n)-(m0)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "eca4def4-552e-406f-b811-420e842cbd38",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'public art'}),(n:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Georges Salendre'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC LIMIT 1",
    "nl_question": "What is the name of the most recently created public art sculpture by Georges Salendre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "4a7961be-68cc-404b-8bb0-edbb06ca0549",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture {name: 'The Burghers of Calais'}),(n:ArtMovement)<-[r1:associatedWith]-(m1:Painting {name: 'Le Bassin d\\'Argenteuil'}) WITH DISTINCT n RETURN n.name, n.end_year",
    "nl_question": "What are the names and end years of art movements associated with both the sculpture The Burghers of Calais and the painting Le Bassin d'Argenteuil?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "78041955-4dda-4d3b-b90f-7e6ea16a41f9",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'The Shade'}),(n:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'Balzac in the Robe of a Dominican Monk'}) WITH DISTINCT n RETURN n.name, n.date_of_death",
    "nl_question": "Who are the individuals who created both The Shade and Balzac in the Robe of a Dominican Monk, and when did they pass away?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "80317f2d-04aa-45ef-9454-1c029fb1aaf7",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Naum Gabo'}) OPTIONAL MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of sculptures created by Naum Gabo, and how many art movements is each associated with?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "5e19db23-deec-4fbc-9ba1-58ec921a8dd3",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'species'}),(n:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Near Threatened'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days ASC LIMIT 1",
    "nl_question": "What is the name of the species classified as Near Threatened that has the shortest average gestation period?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "6a9076af-6e4d-48a5-9588-22db5f342ba7",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club)<-[r1:playsFor]-(m1:Player {name: 'Alex Teixeira'}) WITH DISTINCT n RETURN n.name ORDER BY n.date_of_birth DESC",
    "nl_question": "What are the names of players who have played for the same club as Alex Teixeira, listed from the youngest to the oldest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "117edad3-ed7a-43d9-895b-960ba556707b",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Weapon)<-[r0:employs]-(m0:TerroristAttack {name: '1975 Oñati bombing'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of weapons used in the 1975 Oñati bombing?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "b70485d0-9976-4da3-bd50-7a1680ce2fca",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person {name: 'Grada Hermina Marius'}) WITH DISTINCT n RETURN n.date_of_death",
    "nl_question": "When did Grada Hermina Marius pass away?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "f673a95a-650f-4d67-8dd0-4135cb3d94f6",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture) WITH DISTINCT n RETURN DISTINCT n.gender",
    "nl_question": "What are the unique genders of individuals who have created sculptures?",
    "from_template": {
      "match_category": "basic_(n)-(m0)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "30bbe266-154b-4646-9b9a-547dab8bc6ff",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'forest'}),(n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'polar bear'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans of taxa that live in forests and are preyed upon by polar bears?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "5fa8eb67-76c2-4676-a2d6-93bc2a5bc7e0",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: '1981 Antwerp bombing'}), (m0:TerroristAttack {name: '2010 Chechen Parliament attack'}) RETURN n.number_of_deaths - m0.number_of_deaths AS answer",
    "nl_question": "How many more deaths were there in the 1981 Antwerp bombing compared to the 2010 Chechen Parliament attack?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  },
  {
    "qid": "74912262-3028-41e2-9385-e58cc295e114",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'FK Rudar Pljevlja'}) WITH DISTINCT n RETURN n.name, n.place_of_birth",
    "nl_question": "What are the names and birthplaces of players who have been part of FK Rudar Pljevlja at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "71f897be-767b-4faf-97be-9397c07b61ce",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'lowland forest'}),(n:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'species'}) WITH DISTINCT n RETURN DISTINCT n.diel_cycle",
    "nl_question": "What are the unique diel cycles of species that live in lowland forests?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "9d5fee26-b6d8-4167-90bd-e4f8bc90626a",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player)-[r1:receivesAward]->(m1:Award {name: 'Landon Donovan MVP Award'}) WITH DISTINCT n WHERE n.head_coach = 'Daniel Farke' RETURN n.name",
    "nl_question": "What are the names of clubs coached by Daniel Farke that have had a player win the Landon Donovan MVP Award?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "68d2b9c9-b1e0-41c5-9c85-194c093de613",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'Italian Renaissance painting'}),(n:Painting)-[r1:createdBy]->(m1:Person {name: 'Leonardo da Vinci'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings linked to the Italian Renaissance movement and created by Leonardo da Vinci?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "3ef7269e-cd47-49bb-bba4-2747c2324c2b",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting {name: 'Grainstack at Giverny'}) RETURN n, m0 as m UNION MATCH (n:ArtMovement)<-[r1:associatedWith]-(m1:Sculpture {name: 'Bust of Victor Hugo'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many art movements are associated with either the painting Grainstack at Giverny or the sculpture Bust of Victor Hugo?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "35d2fae9-0e52-42c8-99e5-2c035a61ac2f",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Galerie nationale du Jeu de Paume'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'nude'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many sculptures are either displayed at the Galerie nationale du Jeu de Paume or belong to the nude genre?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "c8b7bea4-ac0b-4223-b917-67461e08d944",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'Landscape with Cattle'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "Who are the individuals who created the painting Landscape with Cattle, and what are their genders?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "7128303b-7fac-49fc-8595-bebfca98eb8d",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Laranda Walker, 1869'}),(n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'forest'}) WITH DISTINCT n RETURN n.name ORDER BY n.longest_lifespan_years DESC",
    "nl_question": "What are the names of taxa that have Laranda Walker, 1869 as a parent and live in forests, sorted by their longest lifespan from the longest to the shortest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "dc387a2a-b182-4263-80f1-c9fc3fed4109",
    "graph": "biology",
    "gold_cypher": "MATCH (n:TaxonRank)<-[r0:hasRank]-(m0:Taxon {name: 'Antennarius avalonis'}),(n:TaxonRank)<-[r1:hasRank]-(m1:Taxon {name: 'Gobi Altai mountain vole'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxonomic ranks shared by both Antennarius avalonis and the Gobi Altai mountain vole?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "f59ca9cb-e34c-4daa-afeb-b4a30f24b53f",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Osvaldo Biancardi'}) WITH DISTINCT n RETURN n.country_of_citizenship",
    "nl_question": "What is the country where Osvaldo Biancardi holds citizenship?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "e603528b-0ea6-4c3b-828f-6cee2c3873c9",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Nisaetus'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that are preyed upon by taxa with a parent named Nisaetus?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "b88f7bdc-30ab-40ce-a9db-e32d40cc0568",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: 'Serie A'}),(n:Club)<-[r1:playsFor]-(m1:Player {name: 'Carlo Bresciani'}) WITH DISTINCT n WHERE n.inception_year > 1908 RETURN n.name",
    "nl_question": "What are the names of clubs in Serie A that Carlo Bresciani has played for, which were founded after 1908?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "2cc89987-bb1f-4f6e-b411-545b37ebab86",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'comics'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of paintings that belong to the comics genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "96845db5-a0ef-4cdf-b820-1c7b5527d867",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Ephemeroptera'}) OPTIONAL MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of all taxa that feed on Ephemeroptera, and how many different habitats does each of them inhabit?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "1ded33d9-8734-4da5-9860-c21935f46e50",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack {name: 'Dolphinarium discotheque suicide bombing'}), (m0:TerroristAttack {name: '2014 Dijon attack'}) RETURN n.number_of_injuries - m0.number_of_injuries AS answer",
    "nl_question": "How many more injuries were there in the Dolphinarium discotheque suicide bombing compared to the 2014 Dijon attack?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  },
  {
    "qid": "2b35cc4e-ba8b-4cdc-9dbd-90201fee3901",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player)-[r1:receivesAward]->(m1:Award {name: 'Ballon d\\'Or'}) WITH DISTINCT n RETURN DISTINCT n.country",
    "nl_question": "Which countries have clubs that have had players who received the Ballon d'Or at some point?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "2a855521-2203-434f-b635-e95733881d89",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'Sardina pilchardus'}) RETURN n, m0 as m UNION MATCH (n:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Near Threatened'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many taxa either feed on Sardina pilchardus or have a conservation status of Near Threatened?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "93c8d5e8-c979-4c00-a811-f54a524048c2",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'Le Thé - La Paisible Journée'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who is the artist behind the painting Le Thé - La Paisible Journée?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "f70ac20a-b1c0-493e-af7f-064d018443bc",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Georges Saulterre'}),(n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'public art'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of sculptures made by Georges Saulterre that belong to the public art genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "2ee62e9c-3d35-45e3-be19-d29b32dc3844",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Common Starling'}) WITH DISTINCT n WHERE n.taxon_name <> 'Aphidoidea' RETURN n.name",
    "nl_question": "What are the names of taxa that are preyed upon by species that the Common Starling feeds on, excluding those with the taxon name Aphidoidea?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "3b2b9075-0533-4f89-88ea-0dd39ee70b73",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Museum Folkwang'}),(n:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'Modern sculpture'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures that are displayed at Museum Folkwang and are associated with the Modern sculpture movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "faffb6d6-d4ec-42b0-b8c4-fc5dad3c7e6f",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:perpetratedBy]->(m0:Terrorist {name: 'Robert Edward Chambliss'}),(n:TerroristAttack)-[r1:perpetratedBy]->(m1:Terrorist {name: 'Bobby Frank Cherry'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks carried out by both Robert Edward Chambliss and Bobby Frank Cherry?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "3ceedd75-67bd-450d-affb-25b942cb43e5",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'subphylum'}) WITH DISTINCT n RETURN max(n.longest_lifespan_years)",
    "nl_question": "What is the maximum lifespan, in years, of taxa that feed on those ranked as subphylum?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "0a600812-2cee-44d3-8d75-fbe9635705a7",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Honda Sports Award for Soccer'}) WITH DISTINCT n RETURN n.name, n.schools_attended",
    "nl_question": "Who are the players who have received the Honda Sports Award for Soccer, and which schools did they attend?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "fda00253-693e-47a7-be09-c9d6403d8d33",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon {name: 'Arachnida'}),(n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Common Pheasant'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans in years of taxa that are preyed upon by both Arachnida and the Common Pheasant?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "092ca523-2a3f-4be6-9013-44a595f372b0",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'bazooka'}),(n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Israel'}) WITH DISTINCT n RETURN n.name, n.date",
    "nl_question": "What are the names and dates of terrorist attacks that used a bazooka and took place in Israel?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "7ee6e1b0-a544-44a4-bc8f-6ea27fdf6054",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target {name: 'Nariman House'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks that targeted Nariman House?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "52a10abb-38a0-4eb3-8c01-7a4b94dc365b",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'kinetic art'}) WITH DISTINCT n RETURN n.name, n.start_year",
    "nl_question": "What are the names and start years of art movements associated with sculptures in the genre of kinetic art?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "f055f516-9db4-415b-bd27-3bd60e09009c",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Neuroptera'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Tetranychidae'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa that are children of Neuroptera and feed on Tetranychidae?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "dffe8545-7d6a-4129-a279-0dd80ffc923a",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack {name: 'Letelier assassination'}) WITH DISTINCT n RETURN n.name, n.country_of_citizenship",
    "nl_question": "Who are the terrorists involved in the Letelier assassination, and what are their countries of citizenship?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "5f1e0cb9-861b-4edf-ba56-8d4b0cd6ad80",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'Israel'}) OPTIONAL MATCH (n:TerroristAttack)-[r0:perpetratedBy]->(m0:Terrorist) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of terrorist attacks that took place in Israel, and how many terrorists were involved in each?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "c49f5f9e-efff-4f31-afec-fb965948966b",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement)<-[r1:associatedWith]-(m1:Sculpture {name: 'The cathedral'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of paintings linked to art movements that also include the sculpture The Cathedral, and how many such art movements are associated with each painting?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  }
]
