[
  {
    "qid": "6356ed89-379c-4866-a664-85d254867a81",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Venue)<-[r0:hasHomeVenue]-(m0:Club)-[r1:partOfLeague]->(m1:League {name: 'Campeonato Brasileiro Série B'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of venues that have served as home grounds for clubs in the Campeonato Brasileiro Série B, either currently or in the past?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "bbdac14c-a982-4a2e-b48d-f6b0c662d690",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Untitled V'}) WITH DISTINCT n RETURN n.name, n.date_of_birth",
    "nl_question": "Who are the creators of the sculpture Untitled V, and what are their dates of birth?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "5c5a2825-7d4e-44e4-8e60-dde18802103a",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Mrs. de Verninac as Diana the Huntress'}) WITH DISTINCT n RETURN n.name, n.date_of_death",
    "nl_question": "Who are the individuals who created Mrs. de Verninac as Diana the Huntress, and when did they pass away?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "8569c366-e629-4179-8fe3-5c1532ecaa42",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'United Kingdom'}),(n:TerroristAttack)-[r1:employs]->(m1:Weapon {name: 'car bomb'}) WITH DISTINCT n RETURN n.name ORDER BY n.number_of_deaths ASC LIMIT 1",
    "nl_question": "What is the name of the terrorist attack in the United Kingdom that used a car bomb and resulted in the fewest deaths?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "ae5c3b13-3c30-4796-82df-59b0ed110504",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target {name: 'Nariman House'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:occursIn]->(m1:Country {name: 'India'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks that either targeted Nariman House or took place in India?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "b8687a36-f120-456f-9b4d-4d9eaf6b77b0",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'The Thinker'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of paintings created by the same person who sculpted The Thinker?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "87698df2-2d75-4a66-a2f5-c7f58a7a5fa3",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Dwarf Cassowary'}) WITH DISTINCT n RETURN n.name ORDER BY n.longest_lifespan_years DESC LIMIT 1",
    "nl_question": "What is the name of the taxon that preys on the same species as the Dwarf Cassowary and has the longest lifespan?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "2555996e-0c9f-4f6d-b886-d92aa4634f4c",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Award)<-[r1:receivesAward]-(m1:Player {name: 'Diego Forlán'}) OPTIONAL MATCH (n:Award)<-[r0:receivesAward]-(m0:Player) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of all the awards received by Diego Forlán, and how many players have received each of those awards?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)<-[r1]-(m1<name>) OPTIONAL MATCH (n)<-[r0]-(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "0c8f88a4-453d-4ae7-9a5b-385519ec1202",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'FIFA World Player of the Year'}) WITH DISTINCT n RETURN n.name, n.mass_kg",
    "nl_question": "Provide the names and weights in kilograms of players who have received the FIFA World Player of the Year award.",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "d6095ef9-0334-4bb7-a622-76c44c53c60e",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'midfielder'}),(n:Player)-[r1:receivesAward]->(m1:Award {name: 'Honda Sports Award for Soccer'}) WITH DISTINCT n RETURN n.name, n.footedness",
    "nl_question": "What are the names and footedness of players who play as midfielders and have received the Honda Sports Award for Soccer?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "b3e35ca1-03d4-4da2-b987-662b01cf3803",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Sculpture {name: 'The Burghers of Calais'}),(n:ArtMovement)<-[r1:associatedWith]-(m1:Sculpture {name: 'The cathedral'}) WITH DISTINCT n RETURN n.name, n.start_year",
    "nl_question": "What are the names and starting years of art movements associated with both The Burghers of Calais and The Cathedral?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "60ae939f-eaab-477f-b827-2af9a3708fad",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:League)<-[r0:partOfLeague]-(m0:Club {name: 'Juventus FC'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the leagues that include Juventus FC?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "992f340a-80bd-4466-af89-52f2cc11aaa8",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'portrait'}),(n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Buckingham Palace'}) WITH DISTINCT n RETURN DISTINCT n.country_of_origin",
    "nl_question": "Which countries are the origin of paintings that are portraits and are displayed at Buckingham Palace?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "950360d0-5808-40e4-a785-2fff1930efc7",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Sculpture {name: 'St. John the Baptist'}),(n:Museum)<-[r1:displayedAt]-(m1:Painting {name: 'An Overgrown Mineshaft'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of museums where both the sculpture St. John the Baptist and the painting An Overgrown Mineshaft are displayed?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "9a3bd595-ea8d-47fe-b3f5-485148b125cc",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre {name: 'assemblage'}),(n:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'surrealism'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of sculptures that belong to the assemblage genre and are associated with surrealism?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "1b9170ee-3651-4184-9b44-371897c3daaa",
    "graph": "biology",
    "gold_cypher": "MATCH (n:TaxonRank)<-[r0:hasRank]-(m0:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'swamp'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxonomic ranks for taxa that live in swamps?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "848640ca-717f-4c6c-88db-5c03c2314bc3",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Award)<-[r0:receivesAward]-(m0:Player)-[r1:playsPosition]->(m1:Position {name: 'winger'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of awards received by players who play as wingers, and how many such players have received each award?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "c2e521ae-221a-459c-9009-e7dc556c206a",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'family'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days ASC",
    "nl_question": "What are the names of taxa that feed on a taxon ranked as a family, sorted by their average gestation period from shortest to longest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "37c9f5ed-e72c-45f6-9193-6238f9c8ec34",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'FC Metz'}) RETURN n, m0 as m UNION MATCH (n:Player)-[r1:receivesAward]->(m1:Award {name: 'UEFA Team of the Year'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of players who have either played for FC Metz or received the UEFA Team of the Year award?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "bc6bc588-b238-48f8-bac0-fc0f2cdb64ad",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'bolt-action rifle'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:targets]->(m1:Target {name: 'Al Noor Mosque'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many terrorist attacks either used a bolt-action rifle or targeted the Al Noor Mosque?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "25f0abb0-c01d-41fe-888d-305093b5868c",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Award)<-[r0:receivesAward]-(m0:Player {name: 'Samuel Eto\\'o'}) RETURN n, m0 as m UNION MATCH (n:Award)<-[r1:receivesAward]-(m1:Player {name: 'Diego Forlán'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many awards have been received by either Samuel Eto'o or Diego Forlán?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "2666b016-c93b-466a-b9ce-7a26a1de93a9",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon)<-[r1:employs]-(m1:TerroristAttack {name: '2022 Kabul mosque attack'}) WITH DISTINCT n RETURN n.name ORDER BY n.number_of_deaths DESC LIMIT 1",
    "nl_question": "What is the name of the terrorist attack that used the same weapon as the 2022 Kabul mosque attack and resulted in the highest number of deaths?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "0993b18c-06d0-41b0-b652-5c828dfa480c",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'shrubland'}),(n:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Oreostruthus'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans in years of taxa that live in shrubland and have Oreostruthus as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "63619088-a52a-484d-a414-d3792c3b827d",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Strasbourg Museum of Modern and Contemporary Art'}),(n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'nude'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of sculptures that are displayed at the Strasbourg Museum of Modern and Contemporary Art and belong to the nude genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "ca6a91e2-2d41-4927-a793-709a8a32f0a9",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'family'}) WITH DISTINCT n RETURN min(n.avg_gestation_period_days)",
    "nl_question": "What is the shortest average gestation period among taxa that feed on those classified at the family rank?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "eda9e2f2-9421-4c36-bab1-beb832ed63ac",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'trompe-l\\'œil'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of paintings that belong to the trompe-l'œil genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "21db5068-3c99-4f5f-aa51-23dd6884c537",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum)<-[r1:displayedAt]-(m1:Sculpture {name: 'Eustache de Saint Pierre'}) WITH DISTINCT n WHERE n.creation_year < 1887 RETURN n.name",
    "nl_question": "What are the names of sculptures displayed in the same museum as Eustache de Saint Pierre, created before the year 1887?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "551440ec-4f3c-4524-a702-e48cb7ab2906",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Position)<-[r0:playsPosition]-(m0:Player)-[r1:receivesAward]->(m1:Award {name: 'Master of Sport of the USSR, International Class'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of positions played by athletes who have received the Master of Sport of the USSR, International Class award, and how many such athletes play each position?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "48160754-847c-4968-8584-3486ea38c4d4",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist)<-[r0:perpetratedBy]-(m0:TerroristAttack {name: 'Via dei Georgofili bombing'}) WITH DISTINCT n RETURN n.name, n.country_of_citizenship",
    "nl_question": "Who are the terrorists responsible for the Via dei Georgofili bombing, and what are their countries of citizenship?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "ca115209-7582-4d1d-ab87-be3a9df6125a",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Rodin Museum'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures displayed at the Rodin Museum?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "fc0022c0-c71d-4348-89f1-910eb38f1dc1",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: 'Campeonato Paranaense'}) WITH DISTINCT n RETURN n.name ORDER BY n.inception_year ASC",
    "nl_question": "What are the names of clubs that are part of the Campeonato Paranaense league, sorted by their year of inception from the earliest to the latest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "4b6537eb-db8a-46e1-a3ff-fd0dae85e058",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'Shad Fishing at Gloucester on the Delaware: Delaware River and Gloucester Pier'}),(n:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'Knitting'}) WITH DISTINCT n RETURN n.name, n.gender",
    "nl_question": "What are the names and genders of the individuals who created both the painting \"Shad Fishing at Gloucester on the Delaware: Delaware River and Gloucester Pier\" and the sculpture \"Knitting\"?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "9cd52bac-3c99-427e-9604-e748f29a62ea",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon {name: 'Common Starling'}) WITH DISTINCT n RETURN DISTINCT n.diel_cycle",
    "nl_question": "What are the unique diel cycles of the organisms that the Common Starling preys on?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "4d35fd42-f84b-45ef-b8a9-2795af42fd84",
    "graph": "biology",
    "gold_cypher": "MATCH (n:ConservationStatus)<-[r0:hasConservationStatus]-(m0:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'secondary forest'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many distinct conservation statuses are there for taxa that inhabit secondary forests?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "2c224d15-db8e-4fdc-afb0-22540cf03dae",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Position)<-[r0:playsPosition]-(m0:Player {name: 'Antonello Cuccureddu'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What positions did Antonello Cuccureddu play?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "a6e8375d-ee13-484f-b91d-9b2264a95cdb",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Sciurinae'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans in years of taxa that have Sciurinae as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "3c405b31-f465-4d8f-96ab-d84f014730d7",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Tomato Fruitworm'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of taxa that are preyed upon by the parent of the Tomato Fruitworm?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "58af56c3-8d18-4caa-8226-b815a53b6985",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'Recostada'}) WITH DISTINCT n RETURN n.name, n.date_of_birth",
    "nl_question": "Who are the individuals who created the painting Recostada, and what are their dates of birth?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "c3b0d39c-3f52-4da8-8df3-dece050de9a3",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsPosition]->(m0:Position {name: 'midfielder'}),(n:Player)-[r1:playsFor]->(m1:Club {name: 'Montreal Manic'}) WITH DISTINCT n RETURN n.name, n.country_of_citizenship",
    "nl_question": "Who are the players who have played as midfielders for Montreal Manic, and what are their countries of citizenship?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "e46496e4-c969-4717-a11a-8f275d8f4d40",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'mannerism'}),(n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'Baroque'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of paintings linked to both the Mannerism and Baroque art movements?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "0d92d0d7-4adb-458c-a2d4-4de974c35bc5",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Miridae'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that feed on species whose parent is Miridae?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "a1bb0ac4-eece-4d43-beaf-a8d7e1ee85fe",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club {name: 'FC Liefering'}) WITH DISTINCT n RETURN n.head_coach",
    "nl_question": "Who is the head coach of FC Liefering?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "6c30e969-bd45-4bd9-9c64-3e289bb992f2",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Adam Elsheimer'}),(n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'National Gallery'}) WITH DISTINCT n WHERE n.creation_year > 1599 RETURN n.name",
    "nl_question": "What are the names of paintings created by Adam Elsheimer and displayed at the National Gallery, which were made after the year 1599?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "e8de42e4-9817-4a2b-8a97-70cb611ad4ce",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'shoulder'}),(n:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'species'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "Provide the names and average gestation periods in days of species that inhabit the shoulder habitat.",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "dee5ef26-8076-4bd1-b90f-ffe60d45430f",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement)<-[r1:associatedWith]-(m1:Sculpture {name: 'The Thinker'}) WITH DISTINCT n WHERE n.creation_year = 1764 RETURN n.name",
    "nl_question": "What are the names of paintings linked to the same art movement as The Thinker, created in the year 1764?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "fa450a16-94d9-4010-b268-eed1baecd9c5",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:createdBy]->(m0:Person {name: 'Gerrit Lundens'}) WITH DISTINCT n RETURN count(DISTINCT n.country_of_origin)",
    "nl_question": "How many different countries of origin are there for paintings created by Gerrit Lundens?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "8f7795eb-2f68-4bc8-9c97-daa2ff7dd99a",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:targets]->(m0:Target {name: 'St. Anthony\\'s Shrine, Kochchikade'}),(n:TerroristAttack)-[r1:targets]->(m1:Target {name: 'Shangri-La Hotel'}) WITH DISTINCT n RETURN n.name, n.locations",
    "nl_question": "What are the names and locations of terrorist attacks that targeted both St. Anthony's Shrine, Kochchikade and the Shangri-La Hotel?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  }
]
