[
  {
    "qid": "28e62cee-cfe6-42b7-8a9e-0bc748823392",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:League)<-[r0:partOfLeague]-(m0:Club {name: 'Chennaiyin FC'}) RETURN n, m0 as m UNION MATCH (n:League)<-[r1:partOfLeague]-(m1:Club {name: 'Odisha FC'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of leagues that include either Chennaiyin FC or Odisha FC?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "e2db7c61-52eb-48ba-9fbc-214803974f41",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture {name: 'Head of Balzac'}),(n:Person)<-[r1:createdBy]-(m1:Sculpture {name: 'The Age of Bronze'}) WITH DISTINCT n RETURN n.name, n.date_of_birth",
    "nl_question": "Who are the individuals who created both the Head of Balzac and The Age of Bronze, and what are their birth dates?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "51d80fcf-7b0d-4267-bcdc-4325d9be2b04",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Sculpture {name: 'Ecorché: Relief of a Horse (Josephine)'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of museums where the sculpture Ecorché: Relief of a Horse (Josephine) is displayed?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "a797a3e9-d618-43c4-8b4e-8adc42ff4c80",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'Luxembourg Museum'}) OPTIONAL MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of sculptures displayed at the Luxembourg Museum, and how many art movements is each associated with?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "6a050f7b-ae59-492e-8122-618b5a35f1df",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Villa Nova Atlético Clube'}) WITH DISTINCT n WHERE n.mass_kg >= 77 RETURN n.name",
    "nl_question": "What are the names of players who have been part of Villa Nova Atlético Clube and weigh at least 77 kilograms?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "2a739cb1-da87-486c-861b-1fe74446c10a",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting {name: 'Rouen Cathedral, Portal, Morning Fog'}) WITH DISTINCT n RETURN n.name, n.end_year",
    "nl_question": "What are the names and end years of art movements associated with the painting Rouen Cathedral, Portal, Morning Fog?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "7c4891a3-92da-4c88-b5f3-66d8071a0043",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'bank'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods of the parents of taxa that live in a bank habitat?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "6079841b-32ca-4ecc-bc2a-0ce0c5bdb909",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'species'}),(n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Rhectocraspeda periusalis'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of species that are preyed upon by Rhectocraspeda periusalis?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "21ad34e9-5605-4667-ad03-9e55767c7977",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon {name: 'Malayan tapir'}), (m0:Taxon {name: 'Otocolobus manul'}) RETURN n.avg_gestation_period_days - m0.avg_gestation_period_days AS answer",
    "nl_question": "What is the difference in average gestation period in days between the Malayan tapir and the Otocolobus manul?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  },
  {
    "qid": "5b3dacf9-d95f-4296-8dea-a7732b6b1dee",
    "graph": "biology",
    "gold_cypher": "MATCH (n:TaxonRank) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of the taxonomic ranks?",
    "from_template": {
      "match_category": "basic_(n)",
      "match_cypher": "MATCH (n)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "d335266a-9a23-4157-83fc-41aba3c68fa0",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'river'}) OPTIONAL MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of all taxa that live in river habitats, along with the count of different taxa they feed on.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "569d04a5-b9be-49aa-b165-25d799e15a4c",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'genus'}),(n:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Asparagoideae'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods in days of genera that belong to the Asparagoideae subfamily?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "5a1da073-3af5-44ca-88c9-4234862e278a",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'nail bomb'}) WITH DISTINCT n RETURN n.name, n.number_of_deaths",
    "nl_question": "What are the names and death tolls of terrorist attacks that used a nail bomb?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "e710eb3e-760e-430d-b2cb-ba61f449d1b9",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Savio Nsereko'}) WITH DISTINCT n UNWIND n.owners AS prop RETURN DISTINCT prop",
    "nl_question": "Who are the unique owners of the clubs that Savio Nsereko has played for, whether in the past or currently?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_prop_array_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n UNWIND n.${prop} AS prop RETURN DISTINCT prop"
    }
  },
  {
    "qid": "7df6f3c0-cdee-4b92-b56e-d1aece1247ef",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'Museo del Prado'}),(n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'Baroque painting'}) WITH DISTINCT n RETURN n.name, n.creation_year",
    "nl_question": "What are the names and creation years of paintings that are exhibited at the Museo del Prado and are linked to the Baroque painting movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "835951a2-9028-42af-8fe4-93e42fbd0751",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Birkirkara F.C.'}),(n:Player)-[r1:playsPosition]->(m1:Position {name: 'midfielder'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of players who have been midfielders for Birkirkara F.C. at some point?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "a3621778-7e56-416a-9ad0-0c5d228b4aa3",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Scalopinae'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days DESC",
    "nl_question": "What are the names of taxa that are children of Scalopinae, sorted by their average gestation period from longest to shortest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "0b9620a0-9730-4ab0-a3cb-da9ad068f219",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:Country)<-[r0:occursIn]-(m0:TerroristAttack {name: 'Patt Junction bus bombing'}) RETURN n, m0 as m UNION MATCH (n:Country)<-[r1:occursIn]-(m1:TerroristAttack {name: 'Savoy Hotel Attack'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of countries where either the Patt Junction bus bombing or the Savoy Hotel Attack took place?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "ac1a7f82-15a7-43f3-8cda-1e8cf8fef926",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Painting {name: 'Portrait of a Bare-Breasted Woman'}),(n:Museum)<-[r1:displayedAt]-(m1:Painting {name: 'Mater dolorosa'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of museums that have exhibited both the Portrait of a Bare-Breasted Woman and Mater dolorosa?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "533d4aa5-2583-4094-a0a9-fa5a4512ac42",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasConservationStatus]->(m0:ConservationStatus {name: 'Endangered species'}),(n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Mustela erminea'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods in days of taxa that are classified as Endangered species and are preyed upon by Mustela erminea?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "f73b80b2-730b-4adf-9b28-d1b0f017a80e",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Auguste Rodin'}),(n:Sculpture)-[r1:displayedAt]->(m1:Museum {name: 'Cleveland Museum of Art'}) WITH DISTINCT n RETURN count(DISTINCT n.country_of_origin)",
    "nl_question": "How many different countries of origin are there for sculptures created by Auguste Rodin and displayed at the Cleveland Museum of Art?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "b6fad484-c71e-405b-98ea-d55aea88af05",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Museum)<-[r0:displayedAt]-(m0:Painting {name: 'Saint Martin and the Beggar'}) RETURN n, m0 as m UNION MATCH (n:Museum)<-[r1:displayedAt]-(m1:Sculpture {name: 'Statuette of a Woman'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of museums where either the painting Saint Martin and the Beggar or the sculpture Statuette of a Woman is displayed?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)<-[r0]-(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "c52172dd-f2ad-41df-9c90-8ebacc324e26",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player {name: 'Marcos Miranda'}),(n:Club)<-[r1:playsFor]-(m1:Player {name: 'Giuliano Bertarelli'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of clubs that both Marcos Miranda and Giuliano Bertarelli have played for, whether currently or in the past?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "b302f625-4afb-4622-8064-d593e77a128a",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:perpetratedBy]->(m0:Terrorist {name: 'Masato Yokoyama'}),(n:TerroristAttack)-[r1:perpetratedBy]->(m1:Terrorist {name: 'Ikuo Hayashi'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of terrorist attacks carried out by both Masato Yokoyama and Ikuo Hayashi?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "5288f188-f38c-454e-ba76-d4a80c47c5b1",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement {name: 'realism'}),(n:Painting)-[r1:createdBy]->(m1:Person {name: 'Claude Monet'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings associated with realism and created by Claude Monet?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "714576d0-4613-4325-86b6-29b1fa0ddf08",
    "graph": "terrorist_attack",
    "gold_cypher": "CALL { MATCH (n:TerroristAttack)-[r0:perpetratedBy]->(m0:Terrorist {name: 'Muhammadsobir Fayzov'}) RETURN n, m0 as m UNION MATCH (n:TerroristAttack)-[r1:perpetratedBy]->(m1:Terrorist {name: 'Dalerjon Mirzoev'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many terrorist attacks were carried out by either Muhammadsobir Fayzov or Dalerjon Mirzoev?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "cc5f5c24-32af-43ad-9c21-09fd4af2cc54",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'group portrait'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year DESC",
    "nl_question": "What are the names of paintings in the group portrait genre, sorted from the most recently created to the oldest?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_order_by",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order}"
    }
  },
  {
    "qid": "8b65d13a-00e7-49ca-89a1-d60134cd9acc",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player)-[r1:playsFor]->(m1:Club {name: 'U.S.D. Alcamo'}) WITH DISTINCT n RETURN n.name ORDER BY n.inception_year ASC LIMIT 1",
    "nl_question": "Which club, that has had a player who also played for U.S.D. Alcamo, was founded the earliest?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "d6132824-3627-4e1c-920a-734a35ad4c0d",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasRank]->(m0:TaxonRank {name: 'species'}),(n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Manduca sexta'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans in years of species that are preyed upon by Manduca sexta?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "bdfa3c1a-ddba-479e-9653-e7058f4aae9b",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'temperate coniferous forest'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that live in temperate coniferous forests?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "0c0d97b9-34ee-4478-b6be-58c1ff7ff445",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:hasParent]-(m0:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Golden Swallow'}) WITH DISTINCT n RETURN n.name, n.taxon_name",
    "nl_question": "What are the names and taxon names of the grandparents of the Golden Swallow?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "3ed89084-356a-4889-857d-032ad71d0298",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'Los Angeles County Museum of Art'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:createdBy]->(m1:Person {name: 'Claude Monet'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings either showcased at the Los Angeles County Museum of Art or created by Claude Monet?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "eca47a09-8212-4c4d-bcc4-20e1b6fa014e",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'mythological painting'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:associatedWith]->(m1:ArtMovement {name: 'Baroque painting'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many paintings are either mythological or associated with the Baroque art movement?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "51335a44-f879-476f-a73d-bcf369b299c2",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:perpetratedBy]->(m0:Terrorist {name: 'Prospero Gallinari'}),(n:TerroristAttack)-[r1:perpetratedBy]->(m1:Terrorist {name: 'Alessio Casimirri'}) WITH DISTINCT n RETURN n.name, n.number_of_deaths",
    "nl_question": "What are the names and death tolls of terrorist attacks carried out by both Prospero Gallinari and Alessio Casimirri?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "af755fd8-745a-442d-afc7-2e3d2283c731",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'A.S.D. Sport Club Palazzolo'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of players who have been part of A.S.D. Sport Club Palazzolo at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "354b6c2d-09c9-4b1a-8b53-73e3fb278d9a",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'Silbernes Lorbeerblatt'}),(n:Player)-[r1:playsFor]->(m1:Club {name: 'U.C. Sampdoria'}) WITH DISTINCT n RETURN n.name, n.height_cm",
    "nl_question": "What are the names and heights in centimeters of players who have received the Silbernes Lorbeerblatt award and have played for U.C. Sampdoria at some point?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "0c07941d-f722-4fd3-bb65-8f3193ff38f1",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Samia'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that are preyed upon by a taxon whose parent is Samia?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "cc024493-89e5-4c95-9f4c-a7b4470e2ffc",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting)-[r1:hasGenre]->(m1:Genre {name: 'trompe-l\\'œil'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of art movements linked to paintings in the trompe-l'œil genre?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "8e8788bd-72c7-4ee9-b588-254719449b43",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Nephrolepis'}),(n:Taxon)-[r1:hasRank]->(m1:TaxonRank {name: 'species'}) WITH DISTINCT n RETURN n.name, n.diel_cycle",
    "nl_question": "What are the names and diel cycles of species that have Nephrolepis as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "d60b3177-8973-44c0-b113-e5aa6cf5aa67",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon {name: 'Pentalonia nigronervosa'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods in days of the taxa that Pentalonia nigronervosa feeds on?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "6913d646-137f-47c3-8daf-e752bc7284a5",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)<-[r0:playsFor]-(m0:Player)-[r1:playsFor]->(m1:Club {name: 'FK AS Trenčín'}) WITH DISTINCT n RETURN DISTINCT n.country",
    "nl_question": "Which unique countries have clubs that have had players who also played for FK AS Trenčín at some point?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_prop_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN DISTINCT n.${prop}"
    }
  },
  {
    "qid": "933708b3-0780-4207-8207-49e69c8a1c22",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:occursIn]->(m0:Country {name: 'Lithuania'}) WITH DISTINCT n UNWIND n.locations AS prop RETURN DISTINCT prop",
    "nl_question": "What are the unique locations of terrorist attacks that have taken place in Lithuania?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_prop_array_distinct",
      "return_cypher": "${match_cypher} WITH DISTINCT n UNWIND n.${prop} AS prop RETURN DISTINCT prop"
    }
  },
  {
    "qid": "f88bcf60-9fe7-44d7-8dcb-5bf3eb9f8947",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club {name: 'Inter Milan'}), (m0:Club {name: 'NK Croatia Sesvete'}) RETURN n.country = m0.country AS answer",
    "nl_question": "Are Inter Milan and NK Croatia Sesvete based in the same country?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "c90da6d3-f496-4f1c-83cb-8a2f312af12f",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon {name: 'Panthera uncia'}), (m0:Taxon {name: 'Indian muntjac'}) RETURN CASE WHEN n.avg_gestation_period_days > m0.avg_gestation_period_days THEN n.name ELSE m0.name END AS answer",
    "nl_question": "Which has a longer average gestation period, the snow leopard or the Indian muntjac?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_argmax",
      "return_cypher": "${match_cypher} RETURN CASE WHEN n.${prop} > m0.${prop} THEN n.name ELSE m0.name END AS answer"
    }
  },
  {
    "qid": "cb7031f6-935c-4511-b758-79859bcc2da2",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)-[r1:hasConservationStatus]->(m1:ConservationStatus {name: 'Endangered species'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans of taxa whose parents have a conservation status of Endangered species?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "aa500060-5784-4b17-9399-b21b4eef64d4",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:Terrorist {name: 'Ashraf Naalwa'}), (m0:Terrorist {name: 'Brahim Issaoui'}) RETURN n.gender = m0.gender AS answer",
    "nl_question": "Are Ashraf Naalwa and Brahim Issaoui of the same gender?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_boolean",
      "return_cypher": "${match_cypher} RETURN n.${prop} = m0.${prop} AS answer"
    }
  },
  {
    "qid": "36a15204-2200-460e-bf9e-dcfe50b54af9",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting {name: 'The Rio della Salute, 1908'}),(n:Person)<-[r1:createdBy]-(m1:Painting {name: 'Self-portrait in Beret'}) WITH DISTINCT n RETURN n.name, n.date_of_death",
    "nl_question": "Who are the artists who created both The Rio della Salute, 1908 and Self-portrait in Beret, and when did they pass away?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  }
]
