[
  {
    "qid": "b3c1d361-826f-4f77-8f6e-4cd36876d03a",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)<-[r0:feedsOn]-(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Homoptera'}) WITH DISTINCT n RETURN n.name ORDER BY n.avg_gestation_period_days DESC LIMIT 1",
    "nl_question": "What is the name of the taxon that feeds on a species which consumes Homoptera and has the longest average gestation period in days?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "67cd0401-41ac-4d2d-bd4f-a7cb569165f2",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League {name: 'Iran Pro League'}) WITH DISTINCT n WHERE n.head_coach <> 'Mehdi Tartar' RETURN n.name",
    "nl_question": "What are the names of clubs in the Iran Pro League that do not have Mehdi Tartar as their head coach?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "516d0f5d-2a90-45bc-8809-ff524b38c29f",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Award)<-[r0:receivesAward]-(m0:Player)-[r1:receivesAward]->(m1:Award {name: 'Étoile d\\'Or'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of awards received by players who have also won the Étoile d'Or, and how many such players have received each award?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "b50c0969-db14-42d0-8108-8862b39344ab",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club {name: 'FC Liefering'}) WITH DISTINCT n RETURN n.country",
    "nl_question": "Which country is FC Liefering based in?",
    "from_template": {
      "match_category": "basic_(n*)",
      "match_cypher": "MATCH (n<name>)",
      "return_pattern_id": "n_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.${prop}"
    }
  },
  {
    "qid": "a5f99e12-156f-42de-bf07-033c00b74d7f",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'forest'}) RETURN n, m0 as m UNION MATCH (n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'moss'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that either live in forests or consume moss?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "644e4046-bdfa-4cc9-a211-5e78909066d6",
    "graph": "terrorist_attack",
    "gold_cypher": "MATCH (n:TerroristAttack)-[r0:employs]->(m0:Weapon {name: 'hand grenade'}) WITH DISTINCT n RETURN n.name ORDER BY n.date ASC LIMIT 1",
    "nl_question": "What is the name of the earliest terrorist attack that used a hand grenade?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "1307dc2e-98a6-4d0d-9302-beaa53ad04d5",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:hasGenre]->(m0:Genre)<-[r1:hasGenre]-(m1:Sculpture {name: 'Statue of The Risen Christ'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many sculptures share the same genre as the Statue of The Risen Christ?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "b4df1c0e-4577-49e9-8c10-8d3962526daf",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r1:createdBy]->(m1:Person {name: 'Paolo Veronese'}) OPTIONAL MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of paintings created by Paolo Veronese, and how many art movements is each associated with?",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "afbefa8f-f901-4658-979b-aa4346ed7b99",
    "graph": "biology",
    "gold_cypher": "MATCH (n:TaxonRank)<-[r0:hasRank]-(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Rubia'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxonomic ranks assigned to taxa that have Rubia as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "79ab93c8-dd99-4295-b51f-9afec512a1fc",
    "graph": "art",
    "gold_cypher": "MATCH (n:Museum)<-[r0:displayedAt]-(m0:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Joseph Chinard'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of museums that exhibit sculptures created by Joseph Chinard, and how many of his sculptures are displayed at each museum?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "d8af7100-6333-484a-bcfa-e44d4c2776c4",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'Tipulidae'}) RETURN n, m0 as m UNION MATCH (n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'earthworm'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many taxa feed on either Tipulidae or earthworms?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "73414770-4c69-4070-aa81-ff0ac4ae1fd8",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'avant-garde'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'conceptual art'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures linked to the avant-garde art movement or classified under the genre of conceptual art?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "ad4cd385-18e8-45bf-826e-76b47dab6247",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Auguste Rodin'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:hasGenre]->(m1:Genre {name: 'full-length portrait'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many sculptures were either created by Auguste Rodin or are full-length portraits?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "3c30103c-9bcd-43e5-964f-5e52c8b7ff82",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'ungulate'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods (in days) of taxa whose parent feeds on ungulates?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "530d31c3-6f2d-49f4-82dd-7c1199c2864a",
    "graph": "art",
    "gold_cypher": "MATCH (n:Genre)<-[r0:hasGenre]-(m0:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Georges Gardet'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the genres of sculptures created by Georges Gardet?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "b669730e-80a0-4441-ae4c-392e8761491f",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre)<-[r1:hasGenre]-(m1:Painting {name: 'The Feast of Dives and Lazarus'}) WITH DISTINCT n WHERE n.creation_year = 1568 RETURN n.name",
    "nl_question": "What are the names of paintings from 1568 that share the same genre as The Feast of Dives and Lazarus?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_where",
      "return_cypher": "${match_cypher} WITH DISTINCT n WHERE ${condition} RETURN n.name"
    }
  },
  {
    "qid": "9ece9906-8b82-4bc6-8f97-4f57943dfba8",
    "graph": "art",
    "gold_cypher": "MATCH (n:ArtMovement)<-[r0:associatedWith]-(m0:Painting)-[r1:createdBy]->(m1:Person {name: 'Jacopo Tintoretto'}) WITH DISTINCT n RETURN n.name ORDER BY n.end_year DESC LIMIT 1",
    "nl_question": "What is the name of the art movement linked to a painting by Jacopo Tintoretto that ended most recently?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "cd9645e2-99ae-494e-8811-6efdea3a8824",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat {name: 'desert'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'Hymenoptera'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods (in days) of taxa that live in deserts and feed on Hymenoptera?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "4c705e43-92f8-42ba-9c33-8b603caf25ed",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Dicaeum'}),(n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'insect'}) WITH DISTINCT n RETURN n.name, n.avg_gestation_period_days",
    "nl_question": "What are the names and average gestation periods (in days) of taxa that have Dicaeum as a parent and feed on insects?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "a9685ccd-b2c2-4439-aac8-3b0c38fa51a3",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Habitat)<-[r0:inhabits]-(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Ducula'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many habitats are inhabited by taxa that have Ducula as a parent?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "a65d232f-55dc-4a96-b9c4-3c5a66b25a60",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'land art'}) WITH DISTINCT n RETURN n.name, n.date_of_birth",
    "nl_question": "Who are the artists who created sculptures associated with the land art movement, and what are their birth dates?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "aaee1715-92b8-4360-a973-4ac151e5cc8c",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:receivesAward]->(m0:Award {name: 'The Best FIFA Men\\'s Player'}) WITH DISTINCT n RETURN n.name, n.country_of_citizenship",
    "nl_question": "Who are the players who have received The Best FIFA Men's Player award, and what are their countries of citizenship?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "324c5118-2a66-428d-ab54-81f047df99b0",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:associatedWith]->(m0:ArtMovement {name: 'Impressionism'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures linked to the Impressionism art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "1a429aa2-dac8-43e4-819b-5203e0ec348d",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Club)-[r0:partOfLeague]->(m0:League)<-[r1:partOfLeague]-(m1:Club {name: 'PEC Zwolle'}) WITH DISTINCT n RETURN n.name, n.head_coach",
    "nl_question": "What are the names and head coaches of clubs that are in the same league as PEC Zwolle?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "85b62a78-d910-4d11-944a-4e21cbf33cad",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum)<-[r1:displayedAt]-(m1:Sculpture {name: 'The Age of Bronze'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year ASC LIMIT 1",
    "nl_question": "What is the name of the oldest sculpture displayed at the same museum as The Age of Bronze?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "35f2ad55-fa09-4418-81d7-e67e7b8f8f7c",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon)-[r1:hasParent]->(m1:Taxon {name: 'Sauropsida'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "What are the names of taxa that consume species with the parent Sauropsida, and how many such species do they consume?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "0cd992a6-3ca4-4f49-a184-a12a80d95e3e",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club {name: 'Valencia CF Mestalla'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "Who are the players who have been part of Valencia CF Mestalla at any time?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "255fa3e7-8c86-4c71-8406-bee9274c518b",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Museum of Grenoble'}) WITH DISTINCT n RETURN min(n.creation_year)",
    "nl_question": "What is the earliest creation year of sculptures displayed at the Museum of Grenoble?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "cdbafe6c-67a0-4974-8077-57ddf088fd1c",
    "graph": "soccer",
    "gold_cypher": "CALL { MATCH (n:Club)-[r0:hasHomeVenue]->(m0:Venue {name: 'Stadio Arechi'}) RETURN n, m0 as m UNION MATCH (n:Club)-[r1:partOfLeague]->(m1:League {name: 'Serie A'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of clubs that have either played at Stadio Arechi or have been part of Serie A?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "7f72337b-43b9-474f-8466-b0cbf06aa30a",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Joseph Chinard'}),(n:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'mannerism'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of sculptures created by Joseph Chinard that are associated with the mannerism art movement?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "f5954063-f239-4913-af53-92851f5fe851",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Musée Hyacinthe-Rigaud'}),(n:Sculpture)-[r1:createdBy]->(m1:Person {name: 'Aristide Maillol'}) WITH DISTINCT n RETURN count(DISTINCT n)",
    "nl_question": "How many sculptures by Aristide Maillol are displayed at the Musée Hyacinthe-Rigaud?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "8e580bd0-85d4-4763-8123-db6f99109c3e",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'Musée des Beaux-Arts de Bordeaux'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:hasGenre]->(m1:Genre {name: 'religious art'}) RETURN n, m1 as m } WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of paintings that are either displayed at the Musée des Beaux-Arts de Bordeaux or belong to the genre of religious art?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "d6521567-7989-4900-a0d4-665eae433f71",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player)-[r0:playsFor]->(m0:Club)-[r1:hasHomeVenue]->(m1:Venue {name: 'Stadion De Braak'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "List the names of players who have been part of clubs that have used Stadion De Braak as their home venue, and for each player, provide the number of such clubs they have played for.",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)-[r0]->(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "19e0581e-2ea1-49f0-b18c-bb34fcb4ece8",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Fondation Bemberg'}) WITH DISTINCT n RETURN n.name, n.country_of_origin",
    "nl_question": "What are the names and countries of origin of sculptures displayed at the Fondation Bemberg?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "3fb4e365-777c-41a6-b8a5-d27f62541582",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'Neuroptera'}),(n:Taxon)<-[r1:feedsOn]-(m1:Taxon {name: 'Efferia'}) WITH DISTINCT n RETURN n.name, n.longest_lifespan_years",
    "nl_question": "What are the names and longest lifespans in years of taxa that both feed on Neuroptera and are preyed upon by Efferia?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name_prop",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name, n.${prop}"
    }
  },
  {
    "qid": "cb01f616-071d-4fe1-a5e8-fa6e48628bca",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:inhabits]->(m0:Habitat)<-[r1:inhabits]-(m1:Taxon {name: 'Van Sung\\'s shrew'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of taxa that share a habitat with Van Sung's shrew?",
    "from_template": {
      "match_category": "basic_(n)-(m0)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0)<-[r1]-(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "16ca6a24-520c-413c-8f0c-31c8bea30f43",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Painting)-[r0:hasGenre]->(m0:Genre {name: 'religious art'}) RETURN n, m0 as m UNION MATCH (n:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Historical Museum Frankfurt'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many paintings are either classified as religious art or exhibited at the Historical Museum Frankfurt?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "477a8500-69c9-413f-9123-f5d0f8f49f39",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r1:inhabits]->(m1:Habitat {name: 'land'}) OPTIONAL MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of all taxa that live on land, along with the number of different taxa each one feeds on.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "dd7b4113-8822-47f6-9522-11b703548292",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Papilionoideae'}) RETURN n, m0 as m UNION MATCH (n:Taxon)<-[r1:hasParent]-(m1:Taxon {name: 'Dumasia truncata'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many taxa either have Papilionoideae as a parent or are parents of Dumasia truncata?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)<-[r1]-(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "cdb8dffc-5632-45da-86eb-a2b23b82f285",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r1:hasGenre]->(m1:Genre {name: 'genre art'}) OPTIONAL MATCH (n:Painting)-[r0:associatedWith]->(m0:ArtMovement) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Provide the names of all paintings classified under genre art, along with the count of art movements they are associated with.",
    "from_template": {
      "match_category": "special_optional-match",
      "match_cypher": "MATCH (n)-[r1]->(m1<name>) OPTIONAL MATCH (n)-[r0]->(m0)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "0e41307f-7fe0-4446-b159-733712a3adc9",
    "graph": "art",
    "gold_cypher": "MATCH (n:Sculpture)-[r0:createdBy]->(m0:Person {name: 'Georges Récipon'}) WITH DISTINCT n RETURN n.name ORDER BY n.creation_year ASC LIMIT 1",
    "nl_question": "What is the name of the earliest sculpture created by Georges Récipon?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_argmax",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name ORDER BY n.${prop} ${order} LIMIT 1"
    }
  },
  {
    "qid": "56ad5528-680c-48d0-9277-b854e3fbaa60",
    "graph": "biology",
    "gold_cypher": "CALL { MATCH (n:Taxon)-[r0:hasParent]->(m0:Taxon {name: 'Nezara'}) RETURN n, m0 as m UNION MATCH (n:Taxon)-[r1:feedsOn]->(m1:Taxon {name: 'tomato'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many taxa either have Nezara as a parent or feed on tomatoes?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "93f7916d-645f-45d7-bb8c-b1a528135713",
    "graph": "biology",
    "gold_cypher": "MATCH (n:Taxon)-[r0:feedsOn]->(m0:Taxon {name: 'Cervidae'}) WITH DISTINCT n RETURN max(n.avg_gestation_period_days)",
    "nl_question": "What is the longest average gestation period, in days, among taxa that feed on Cervidae?",
    "from_template": {
      "match_category": "basic_(n)-(m0*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>)",
      "return_pattern_id": "n_agg",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN ${agg_clause}"
    }
  },
  {
    "qid": "86268cdf-aae9-4894-9f17-b4e9289fd237",
    "graph": "art",
    "gold_cypher": "MATCH (n:Person)<-[r0:createdBy]-(m0:Painting)-[r1:displayedAt]->(m1:Museum {name: 'Detroit Institute of Arts'}) WITH n, count(DISTINCT m0) AS num RETURN n.name, num",
    "nl_question": "Who are the artists whose paintings are exhibited at the Detroit Institute of Arts, and how many of their paintings are displayed there?",
    "from_template": {
      "match_category": "special_three-node-groupby",
      "match_cypher": "MATCH (n)<-[r0]-(m0)-[r1]->(m1<name>)",
      "return_pattern_id": "n_m0_group_by_count",
      "return_cypher": "${match_cypher} WITH n, count(DISTINCT m0) AS num RETURN n.name, num"
    }
  },
  {
    "qid": "d46e6840-4657-4718-80ec-37b33d3a4217",
    "graph": "art",
    "gold_cypher": "CALL { MATCH (n:Sculpture)-[r0:displayedAt]->(m0:Museum {name: 'Victoria and Albert Museum'}) RETURN n, m0 as m UNION MATCH (n:Sculpture)-[r1:associatedWith]->(m1:ArtMovement {name: 'Modern sculpture'}) RETURN n, m1 as m } WITH DISTINCT n RETURN count(n)",
    "nl_question": "How many sculptures are either displayed at the Victoria and Albert Museum or associated with the Modern sculpture movement?",
    "from_template": {
      "match_category": "special_union",
      "match_cypher": "CALL { MATCH (n)-[r0]->(m0<name>) RETURN n, m0 as m UNION MATCH (n)-[r1]->(m1<name>) RETURN n, m1 as m }",
      "return_pattern_id": "n_union_count",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN count(n)"
    }
  },
  {
    "qid": "61a0a807-a255-48ea-b70d-5a441d7994c5",
    "graph": "art",
    "gold_cypher": "MATCH (n:Painting)-[r0:displayedAt]->(m0:Museum {name: 'Kimbell Art Museum'}),(n:Painting)-[r1:hasGenre]->(m1:Genre {name: 'landscape art'}) WITH DISTINCT n RETURN n.name",
    "nl_question": "What are the names of landscape paintings exhibited at the Kimbell Art Museum?",
    "from_template": {
      "match_category": "basic_(n)-(m0*),(n)-(m1*)",
      "match_cypher": "MATCH (n)-[r0]->(m0<name>),(n)-[r1]->(m1<name>)",
      "return_pattern_id": "n_name",
      "return_cypher": "${match_cypher} WITH DISTINCT n RETURN n.name"
    }
  },
  {
    "qid": "971e4379-2e1d-4f66-85af-9207375e9333",
    "graph": "soccer",
    "gold_cypher": "MATCH (n:Player {name: 'Siniša Mihajlović'}), (m0:Player {name: 'Roberto Gagliardini'}) RETURN n.mass_kg - m0.mass_kg AS answer",
    "nl_question": "How much heavier is Siniša Mihajlović compared to Roberto Gagliardini in kilograms?",
    "from_template": {
      "match_category": "special_comparison",
      "match_cypher": "MATCH (n<name,$prop>),(m0<name,$prop>)",
      "return_pattern_id": "n_m0_comparison_arithmetic",
      "return_cypher": "${match_cypher} RETURN n.${prop} - m0.${prop} AS answer"
    }
  }
]
